[
  {
    "timestamp": 1752887246260,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The RSI is oversold at 29.41, indicating a potential upward correction. The presence of a Doji suggests indecision and potential reversal. The price has pulled back to the EMA50, which can act as support. Stochastic %K is extremely low, suggesting a possible upward movement. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "entryPrice": 117633.49,
    "result": "PENDING",
    "checkAt": 1752887546260
  },
  {
    "timestamp": 1752887966705,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 60 and the stochastic being in the overbought region, the presence of a doji candle pattern and a pullback to EMA50 suggests a potential continuation of the downtrend. The MACD histogram is not specified, but the confluence of the trend and the price action near a significant Fib level supports a bearish outlook.",
    "entryPrice": 117923.99,
    "result": "PENDING",
    "checkAt": 1752888266705
  },
  {
    "timestamp": 1752888027629,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being relatively high at 62.92, suggesting potential overbought conditions, the presence of a doji candle pattern and the stochastic being in the overbought region (%K > %D) support a potential reversal or continuation of the downtrend. The price touching EMA50 during a downtrend often acts as resistance. The proximity to the 0.618 Fibonacci level adds to the likelihood of a continuation of the downtrend. Therefore, the confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117958.21,
    "result": "PENDING",
    "checkAt": 1752888327629
  },
  {
    "timestamp": 1752888866175,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 55.39, not indicating overbought or oversold conditions. The doji candle pattern suggests indecision, but the price action shows a pullback touching the EMA50, which often acts as resistance in a downtrend. The Stochastic is below 50, indicating potential for further downside. The MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend.",
    "entryPrice": 117956.02,
    "result": "PENDING",
    "checkAt": 1752889166175
  },
  {
    "timestamp": 1752889107874,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting the market is not overbought. The presence of a Doji indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic %K is above 70, indicating potential overbought conditions. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. These factors suggest a continuation of the downtrend.",
    "entryPrice": 117990.5,
    "result": "PENDING",
    "checkAt": 1752889407874
  },
  {
    "timestamp": 1752889586496,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but leaning towards bearish. The doji candle pattern suggests indecision, but the touch of EMA50 in a downtrend often acts as resistance. Stochastic is oversold, but not yet showing a clear reversal signal. The proximity to the Fib 0.618 level may provide some support, but the confluence of a downtrend and resistance at EMA50 suggests a higher probability of a downward move.",
    "entryPrice": 117964,
    "result": "PENDING",
    "checkAt": 1752889886496
  },
  {
    "timestamp": 1752889766440,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The presence of a hammer candle pattern near the EMA50 suggests a potential reversal or short-term bullish momentum. Although the overall trend is down, the RSI is neutral, and the stochastic indicates potential upward movement from oversold conditions. The proximity to the Fib 0.618 level adds confluence for a short-term upward retracement.",
    "entryPrice": 117994.33,
    "result": "PENDING",
    "checkAt": 1752890066440
  },
  {
    "timestamp": 1752890307182,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback touching EMA50, suggesting a continuation of the downtrend. The RSI is neutral, but the stochastic is below 50, indicating bearish momentum. The proximity to the Fib 0.618 level could act as resistance, supporting a downward move.",
    "entryPrice": 118023.3,
    "result": "PENDING",
    "checkAt": 1752890607182
  },
  {
    "timestamp": 1752890845913,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but given the trend and lack of bullish signals, the downtrend is likely to continue.",
    "entryPrice": 117978.74,
    "result": "PENDING",
    "checkAt": 1752891145913
  },
  {
    "timestamp": 1752891026080,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic is below 50, suggesting bearish momentum. The MACD histogram is not specified, but given the other indicators, the overall confluence suggests a continuation of the downtrend.",
    "entryPrice": 118005.65,
    "result": "PENDING",
    "checkAt": 1752891326080
  },
  {
    "timestamp": 1752891207519,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions, and the presence of a Doji suggests indecision. However, the pullback touching EMA50 in a downtrend often acts as resistance, suggesting a continuation of the downtrend. The MACD histogram is not provided, but the Stochastic is below 50, indicating potential downward momentum. The proximity to the 0.618 Fib level could add resistance. Overall, the confluence of these factors supports a DOWN trade.",
    "entryPrice": 118000,
    "result": "PENDING",
    "checkAt": 1752891507519
  },
  {
    "timestamp": 1752891446039,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is also showing bearish signals with %K below %D. The presence near the Fib 0.618 level adds a potential resistance confluence. Despite normal volume and no candle pattern, the majority of indicators suggest a continuation of the downtrend.",
    "entryPrice": 117992.92,
    "result": "PENDING",
    "checkAt": 1752891746039
  },
  {
    "timestamp": 1752891506080,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 65,
    "reason": "The presence of a hammer candle pattern at the EMA50 suggests a potential reversal or bounce, despite the overall downtrend. RSI is neutral, and the stochastic indicates potential upward momentum. The proximity to the Fib 0.618 level adds to the likelihood of a short-term upward move.",
    "entryPrice": 118009.99,
    "result": "PENDING",
    "checkAt": 1752891806080
  },
  {
    "timestamp": 1752893967352,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, suggesting potential bearish momentum. The MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend. The Fib level near 0.618 could provide resistance, supporting a downward move.",
    "entryPrice": 118212.02,
    "result": "PENDING",
    "checkAt": 1752894267352
  },
  {
    "timestamp": 1752894267798,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 49.52, providing no strong directional bias. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, suggesting potential continuation of the downward move. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level near 0.618 could act as resistance, supporting a downward move.",
    "entryPrice": 118177.42,
    "result": "PENDING",
    "checkAt": 1752894567798
  },
  {
    "timestamp": 1752894628018,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is low, indicating potential oversold conditions, but the trend and other indicators favor a continuation of the downtrend. The proximity to the Fib 0.618 level adds to the likelihood of resistance holding.",
    "entryPrice": 118145.68,
    "result": "PENDING",
    "checkAt": 1752894928018
  },
  {
    "timestamp": 1752894928150,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the stochastic is overbought, suggesting a potential reversal or continuation of the downtrend. The doji pattern at the EMA50 could indicate indecision, but given the downtrend and overbought stochastic, a continuation downwards is more likely. The price is near the Fib 0.618 level, which often acts as a resistance in a downtrend.",
    "entryPrice": 118209.15,
    "result": "PENDING",
    "checkAt": 1752895228150
  },
  {
    "timestamp": 1752895046882,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 52.71, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The Stochastic is relatively high, suggesting potential for a downward move. The MACD histogram is not provided, but the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 118194.85,
    "result": "PENDING",
    "checkAt": 1752895346882
  },
  {
    "timestamp": 1752895171120,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal a continuation of the trend. RSI is neutral, not indicating overbought or oversold conditions, and the MACD histogram is not specified, but the stochastic is relatively high, suggesting potential for downward movement. The proximity to the Fib 0.618 level adds to the likelihood of a continuation of the downtrend.",
    "entryPrice": 118197.72,
    "result": "PENDING",
    "checkAt": 1752895471120
  },
  {
    "timestamp": 1752895466943,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 60, suggesting some bullish momentum, the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic is in the overbought region, indicating potential for a downward move. The presence near the Fib 0.618 level could also act as a resistance point, supporting a continuation of the downtrend.",
    "entryPrice": 118252.84,
    "result": "PENDING",
    "checkAt": 1752895766943
  },
  {
    "timestamp": 1752895586647,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is relatively high at 62.99, suggesting potential overbought conditions. The Doji candle pattern and the price touching EMA50 indicate indecision and a possible continuation of the downtrend. The Stochastic is in the overbought region, which aligns with a potential downward move. Although the MACD histogram value is missing, the other indicators provide sufficient confluence for a DOWN trade.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752895886647
  },
  {
    "timestamp": 1752895648474,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Although RSI is relatively high at 62.99, suggesting potential overbought conditions, the presence of a Doji candle pattern indicates market indecision. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is above %D, but both are in overbought territory, suggesting a potential reversal. The proximity to the Fib 0.618 level adds to the likelihood of resistance holding. Therefore, the confluences suggest a continuation of the downtrend.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752895948474
  },
  {
    "timestamp": 1752895887276,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, suggesting no strong momentum shift. The price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic indicates a potential continuation of the downtrend as %K is below %D and both are below 50. The proximity to the Fib 0.618 level suggests a possible resistance area. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118251.34,
    "result": "PENDING",
    "checkAt": 1752896187276
  },
  {
    "timestamp": 1752895947603,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is neutral at 55.26, not indicating overbought or oversold conditions. The presence of a Doji candle suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram value is missing, but the Stochastic is above 50, indicating potential for more downside. The proximity to the Fibonacci 0.618 level adds to the resistance. Overall, the confluence of a downtrend and resistance levels suggests a continuation downwards.",
    "entryPrice": 118251.35,
    "result": "PENDING",
    "checkAt": 1752896247603
  },
  {
    "timestamp": 1752896186885,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 53.18, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic %K is below %D and under 50, suggesting potential downward momentum. The proximity to the Fib 0.618 level could act as resistance. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118251.3,
    "result": "PENDING",
    "checkAt": 1752896486885
  },
  {
    "timestamp": 1752896245912,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Although the RSI is relatively neutral and stochastic is not in an extreme position, the lack of a strong reversal pattern and the presence of a downtrend suggest a continuation of the downward movement.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752896545912
  },
  {
    "timestamp": 1752896726430,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The RSI is moderately high, suggesting potential for a downward move. The stochastic indicates a potential overbought condition. Despite the lack of a candle pattern, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 118332.97,
    "result": "PENDING",
    "checkAt": 1752897026430
  },
  {
    "timestamp": 1752896847855,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is neutral but not overbought, suggesting room for further downside. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The presence of a Doji indicates indecision, but the trend and pullback suggest a continuation downward. The MACD histogram is not provided, but the stochastic is near overbought, supporting a potential downward move. The proximity to the Fib 0.618 level can act as a resistance, enhancing the bearish bias.",
    "entryPrice": 118326.52,
    "result": "PENDING",
    "checkAt": 1752897147855
  },
  {
    "timestamp": 1752897087219,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall downtrend, the hammer candle pattern at a pullback to EMA50, oversold RSI, and stochastic %K crossing below %D near the Fib 0.618 level suggest a potential short-term reversal.",
    "entryPrice": 118214.54,
    "result": "PENDING",
    "checkAt": 1752897387219
  },
  {
    "timestamp": 1752897687547,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation of the trend. RSI is neutral, not indicating overbought or oversold conditions. The Stochastic is relatively high, suggesting potential for a downward move. The proximity to the Fib 0.618 level may also act as resistance. Given these factors, a DOWN trade is more likely.",
    "entryPrice": 118287.98,
    "result": "PENDING",
    "checkAt": 1752897987547
  },
  {
    "timestamp": 1752897747045,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The presence of a Doji indicates indecision, but in the context of a downtrend, it may signal a continuation. The Stochastic is not in an oversold or overbought condition, providing no strong counter-signal. The proximity to the Fib 0.618 level could act as resistance, reinforcing the bearish outlook.",
    "entryPrice": 118263.96,
    "result": "PENDING",
    "checkAt": 1752898047045
  },
  {
    "timestamp": 1752897866730,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200, indicating bearish momentum. The RSI is below 50, suggesting lack of bullish strength. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is not in an oversold zone, providing room for further downside. The proximity to the Fib 0.618 level may offer some support, but the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118271.46,
    "result": "PENDING",
    "checkAt": 1752898166730
  },
  {
    "timestamp": 1752897987155,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 50, suggesting some bullish momentum, the Stochastic is overbought, indicating potential for a downward move. The Doji candle pattern and price touching EMA50 suggest indecision and a possible continuation of the downtrend. The proximity to the Fib 0.618 level adds to the potential for a reversal back down. Hence, the confluence of these factors supports a DOWN trade.",
    "entryPrice": 118326.93,
    "result": "PENDING",
    "checkAt": 1752898287155
  },
  {
    "timestamp": 1752898107189,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Although the RSI is neutral and the stochastic is not in an oversold condition, the lack of a strong reversal pattern and the proximity to the Fib 0.618 level suggest a continuation of the downtrend.",
    "entryPrice": 118318.01,
    "result": "PENDING",
    "checkAt": 1752898407189
  },
  {
    "timestamp": 1752898347247,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 54.29, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price has recently pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic %K is above %D, indicating potential short-term upward movement, yet it is still within a downtrend context. The proximity to the Fib 0.618 level suggests potential resistance. Given these factors, the downtrend is likely to continue in the short term.",
    "entryPrice": 118317.81,
    "result": "PENDING",
    "checkAt": 1752898647247
  },
  {
    "timestamp": 1752898407204,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in an extreme position, and the MACD histogram is not provided, but the trend and pullback suggest a continuation of the downtrend. The proximity to the Fib 0.618 level could indicate a potential reversal, but the trend and pullback setup suggest a higher probability of a downward move.",
    "entryPrice": 118331.47,
    "result": "PENDING",
    "checkAt": 1752898707204
  },
  {
    "timestamp": 1752898586496,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting limited upside potential. The doji candle pattern and the price touching EMA50 indicate a potential continuation of the downtrend. Stochastic is overbought, supporting a downward move. Despite being near the Fib 0.618 level, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118348.69,
    "result": "PENDING",
    "checkAt": 1752898886496
  },
  {
    "timestamp": 1752898767614,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but leaning towards bearish territory. The price action shows a pullback to EMA50, which often acts as a resistance in a downtrend. The MACD histogram is not provided, but the stochastic indicators show a bearish crossover potential. The proximity to the Fib 0.618 level suggests a potential reversal, but the confluence of the trend and other indicators favors a continuation of the downtrend.",
    "entryPrice": 118306.09,
    "result": "PENDING",
    "checkAt": 1752899067614
  },
  {
    "timestamp": 1752898826778,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in the oversold region, indicating there is room for further downward movement. Despite being near the Fib 0.618 level, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118280.61,
    "result": "PENDING",
    "checkAt": 1752899126778
  },
  {
    "timestamp": 1752898886848,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and both are below 50, indicating bearish momentum. The proximity to the 0.618 Fib level may provide some support, but the confluence of bearish indicators suggests a continuation of the downtrend.",
    "entryPrice": 118287.45,
    "result": "PENDING",
    "checkAt": 1752899186848
  },
  {
    "timestamp": 1752898947686,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The doji candle pattern at a pullback to EMA50 may indicate indecision, but in the context of a downtrend, it often signals continuation. Stochastic is below 30, indicating potential oversold conditions, but in a strong downtrend, this can persist. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. Overall, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118272.16,
    "result": "PENDING",
    "checkAt": 1752899247686
  },
  {
    "timestamp": 1752899126775,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic indicator is oversold, but the lack of a crossover or divergence reduces its bullish implication. The proximity to the 0.618 Fibonacci level could provide some support, but the prevailing trend and indicators suggest a continuation of the downtrend.",
    "entryPrice": 118233.3,
    "result": "PENDING",
    "checkAt": 1752899426775
  },
  {
    "timestamp": 1752899307663,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is near oversold but not extreme, suggesting potential for further downside. Price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic is at the lower bound, indicating bearish momentum. The proximity to the Fib 0.618 level could provide some support, but the prevailing trend and indicators suggest a continuation of the downward movement.",
    "entryPrice": 118215.45,
    "result": "PENDING",
    "checkAt": 1752899607663
  },
  {
    "timestamp": 1752899428063,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The RSI is near an oversold level (30.97), indicating potential for a reversal. The presence of a Doji candle pattern suggests market indecision and possible reversal. Stochastic is at 0, indicating oversold conditions. Price action shows a pullback to EMA50, which could act as support. Despite the overall downtrend, these factors suggest a short-term upward movement.",
    "entryPrice": 118206.55,
    "result": "PENDING",
    "checkAt": 1752899728063
  },
  {
    "timestamp": 1752899726842,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting the market is not overbought. The stochastic is extremely high, indicating potential for a reversal, but given the downtrend and the doji pattern at a pullback to EMA50, the likelihood of continuation downward is higher. The proximity to the Fib 0.618 level adds to the potential for a downward move.",
    "entryPrice": 118307.46,
    "result": "PENDING",
    "checkAt": 1752900026842
  },
  {
    "timestamp": 1752899847524,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but given the downtrend, it may indicate a continuation of the trend. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic is neutral, slightly leaning towards overbought, which supports a potential downward move. The proximity to the Fib 0.618 level could act as resistance, aligning with the downtrend.",
    "entryPrice": 118266.88,
    "result": "PENDING",
    "checkAt": 1752900147524
  },
  {
    "timestamp": 1752899968632,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is at 34, suggesting bearish momentum, but not yet oversold. The Doji candle pattern indicates indecision, but in a downtrend, it often leads to continuation. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic %K is at 0, indicating strong bearish momentum. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level at 0.618 might provide some support, but the overall confluence supports a DOWN signal.",
    "entryPrice": 118174.69,
    "result": "PENDING",
    "checkAt": 1752900268632
  },
  {
    "timestamp": 1752900207782,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The doji candle pattern indicates indecision, but the pullback touching EMA50 in a downtrend often acts as resistance. Stochastic is below 50, supporting a bearish bias. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. These factors suggest a likely continuation of the downtrend.",
    "entryPrice": 118222.66,
    "result": "PENDING",
    "checkAt": 1752900507782
  },
  {
    "timestamp": 1752900388340,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The stochastic %K is at 0, indicating oversold conditions, but the lack of a reversal pattern or strong bullish confluence reduces the likelihood of an immediate reversal. The price touching EMA50 during a downtrend often acts as resistance. The proximity to the Fib 0.618 level may provide some support, but the prevailing trend and indicators suggest a continuation downward.",
    "entryPrice": 118147.57,
    "result": "PENDING",
    "checkAt": 1752900688340
  },
  {
    "timestamp": 1752900927973,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it can signal a continuation. The MACD histogram is not specified, but the stochastic is above 50, indicating potential for a short-term pullback, yet the overall trend and other indicators suggest a continuation downwards. The proximity to the Fib 0.618 level adds a potential resistance point.",
    "entryPrice": 118176.21,
    "result": "PENDING",
    "checkAt": 1752901227973
  },
  {
    "timestamp": 1752900987921,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but given the downtrend, it may signal a continuation of the trend. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic indicates a bearish crossover below 50. The proximity to the Fib 0.618 level could provide resistance, reinforcing the downtrend. Therefore, the confluence of these factors suggests a continuation of the downward movement.",
    "entryPrice": 118152.57,
    "result": "PENDING",
    "checkAt": 1752901287921
  },
  {
    "timestamp": 1752901046565,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. Price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and in the oversold region, which could indicate a potential continuation of the downtrend. The price is near the 0.618 Fib level, which may act as resistance. These factors suggest a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 118140.06,
    "result": "PENDING",
    "checkAt": 1752901346565
  },
  {
    "timestamp": 1752901107765,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the bearish trend. The Stochastic is below 50, supporting the bearish outlook. The proximity to the Fib 0.618 level could act as a resistance point, reinforcing the downtrend continuation.",
    "entryPrice": 118140.05,
    "result": "PENDING",
    "checkAt": 1752901407765
  },
  {
    "timestamp": 1752901287666,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price is currently in a pullback phase, having touched EMA50, which often acts as resistance in a downtrend. The RSI is neutral at 50.28, not providing a strong counter-signal. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation of the trend. The Stochastic %K is high, suggesting overbought conditions, which aligns with a potential downward move. The MACD histogram is not specified, but the other indicators provide sufficient confluence for a downward prediction.",
    "entryPrice": 118179.48,
    "result": "PENDING",
    "checkAt": 1752901587666
  },
  {
    "timestamp": 1752901348640,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to EMA50, which often acts as resistance in a downtrend. The RSI is neutral, not indicating overbought or oversold conditions, and the Stochastic is in the overbought region, suggesting potential for a downward move. The Doji candle pattern indicates indecision, but in the context of a downtrend and resistance at EMA50, it leans towards continuation of the trend. The presence near the Fib 0.618 level adds to the likelihood of a reversal back down.",
    "entryPrice": 118179.48,
    "result": "PENDING",
    "checkAt": 1752901648640
  },
  {
    "timestamp": 1752901466995,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and both are below 50, indicating potential continuation of the downtrend. The MACD histogram is not provided, but other indicators suggest a bearish bias. The proximity to the Fib 0.618 level could provide temporary support, but the overall confluence supports a downward move.",
    "entryPrice": 118158.13,
    "result": "PENDING",
    "checkAt": 1752901766995
  },
  {
    "timestamp": 1752901588008,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, indicating bearish momentum. The stochastic is oversold, but the %K line is flat, suggesting a lack of immediate bullish reversal. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may precede further downward movement. The proximity to the Fib 0.618 level could provide temporary support, but the prevailing trend and indicators suggest a continuation of the downtrend.",
    "entryPrice": 118120.31,
    "result": "PENDING",
    "checkAt": 1752901888008
  },
  {
    "timestamp": 1752901647640,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is in oversold territory, but the %K is below %D, indicating continued bearish pressure. The MACD histogram is not specified, but the other indicators provide enough confluence for a bearish signal.",
    "entryPrice": 118134.52,
    "result": "PENDING",
    "checkAt": 1752901947640
  },
  {
    "timestamp": 1752901829191,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 80,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price has pulled back to EMA50, which often acts as resistance in a downtrend. Stochastic %K is at 0, indicating oversold conditions, but the lack of a bullish crossover with %D suggests continued bearish pressure. The proximity to the Fib 0.618 level could provide resistance. The confluence of these factors supports a DOWN trade.",
    "entryPrice": 118087.67,
    "result": "PENDING",
    "checkAt": 1752902129191
  },
  {
    "timestamp": 1752901886493,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The presence of a Doji candle indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is oversold, but the MACD histogram is not provided, which limits the analysis. However, the confluence of the trend and RSI suggests a continuation of the downtrend.",
    "entryPrice": 118087.68,
    "result": "PENDING",
    "checkAt": 1752902186493
  },
  {
    "timestamp": 1752914552222,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it could signal a continuation of the bearish move. The Stochastic is near overbought levels, suggesting a potential downward move. The MACD histogram is not provided, but the other indicators suggest a higher probability of a downward move.",
    "entryPrice": 118052.02,
    "result": "PENDING",
    "checkAt": 1752914852222
  },
  {
    "timestamp": 1752914611293,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down (EMA50 < EMA200), and the price is pulling back to the EMA50, suggesting a continuation of the downtrend. The RSI is below 50, indicating bearish momentum. The presence of a Doji candle suggests indecision, but in the context of a downtrend, it may indicate a continuation rather than a reversal. The Stochastic is near overbought levels, which could signal a potential downward move. The proximity to the Fib 0.618 level adds a potential resistance point. Overall, the confluence of these factors suggests a higher probability of a downward move.",
    "entryPrice": 118048,
    "result": "PENDING",
    "checkAt": 1752914911293
  },
  {
    "timestamp": 1752914670556,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the pullback to EMA50 in a downtrend often leads to continuation downward. Stochastic is in the overbought region, suggesting potential for a downward move. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118067.8,
    "result": "PENDING",
    "checkAt": 1752914970556
  },
  {
    "timestamp": 1752914731357,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 53, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action showing a pullback to EMA50 in a downtrend often acts as resistance. The Stochastic is overbought, which aligns with a potential downward move. The MACD histogram is not specified, but given the other indicators, the confluence suggests a continuation of the downtrend.",
    "entryPrice": 118086.85,
    "result": "PENDING",
    "checkAt": 1752915031357
  },
  {
    "timestamp": 1752914910215,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the Stochastic is overbought, suggesting a potential reversal. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The presence of a Doji candle indicates indecision, but given the trend and overbought Stochastic, a continuation of the downtrend is more likely.",
    "entryPrice": 118096.89,
    "result": "PENDING",
    "checkAt": 1752915210215
  },
  {
    "timestamp": 1752915270385,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The price has pulled back to the EMA50, which often acts as a support in an uptrend. Although the RSI is neutral and the stochastic is low, the proximity to the Fibonacci 0.618 level suggests potential support and continuation of the trend. The MACD histogram is not provided, but given the other indicators, an upward movement is more likely.",
    "entryPrice": 118044.19,
    "result": "PENDING",
    "checkAt": 1752915570385
  },
  {
    "timestamp": 1752915633100,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA50 being above EMA200. The RSI is neutral at 52.98, suggesting no overbought or oversold conditions. The doji candle pattern and normal volume indicate indecision, but the pullback to EMA50 suggests a potential continuation of the uptrend. The MACD histogram is not provided, but the stochastic %K is above %D, indicating potential upward momentum. The proximity to the Fib 0.618 level adds a supportive confluence for an upward move.",
    "entryPrice": 118101.82,
    "result": "PENDING",
    "checkAt": 1752915933100
  },
  {
    "timestamp": 1752915813322,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions. The price has pulled back to the EMA50, a potential support level in an uptrend. The stochastic is neutral but slightly leaning towards an upward movement. Being near the Fib 0.618 level, a common retracement level, suggests a potential bounce. The lack of a candle pattern and normal volume do not provide additional confluence, but the existing factors suggest a higher probability of an upward move.",
    "entryPrice": 118109.92,
    "result": "PENDING",
    "checkAt": 1752916113322
  },
  {
    "timestamp": 1752916231666,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. Although a Doji candle indicates indecision, the price has pulled back to the EMA50, which often acts as support in an uptrend. The Stochastic is in the overbought region, but the MACD histogram is not specified, which slightly reduces confidence. The proximity to the Fib 0.618 level also supports a potential bounce upwards.",
    "entryPrice": 118154.99,
    "result": "PENDING",
    "checkAt": 1752916531666
  },
  {
    "timestamp": 1752916291656,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is moderately bullish at 57.35, suggesting room for upward movement. The doji candle pattern indicates indecision, but the price has pulled back to the EMA50, which often acts as support in an uptrend. The stochastic is in the overbought region, which could signal a potential reversal, but given the trend and other indicators, the likelihood of a short-term upward movement is higher. The proximity to the Fib 0.618 level adds to the potential for a bounce.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916591656
  },
  {
    "timestamp": 1752916352335,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below overbought levels, suggesting room for upward movement. The price has pulled back to a significant support level at EMA50, which often acts as a buying opportunity in an uptrend. The stochastic is in the overbought region, but the %K is above %D, indicating potential for continued upward momentum. The presence of a doji suggests indecision, but given the overall bullish context, the bias is slightly towards an upward move.",
    "entryPrice": 118153.99,
    "result": "PENDING",
    "checkAt": 1752916652335
  },
  {
    "timestamp": 1752916530660,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 > EMA200. The RSI is above 50, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. The Stochastic %K is above %D, indicating potential upward momentum. The proximity to the Fib 0.618 level could also act as a support zone. Despite the lack of a specific candle pattern, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916830660
  },
  {
    "timestamp": 1752916592765,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 50, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. Although the doji candle pattern indicates indecision, the stochastic is above 70, supporting a continuation of the upward trend. The proximity to the Fib 0.618 level suggests a potential bounce. The confluence of these factors supports an upward move despite the doji pattern.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916892765
  },
  {
    "timestamp": 1752916652540,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is below overbought levels, suggesting room for upward movement. The stochastic is overbought, but the price action shows a pullback to EMA50, which often acts as support in an uptrend. The presence of a doji indicates indecision, but in the context of an uptrend, it can suggest a continuation. The proximity to the Fib 0.618 level adds a potential support confluence. Despite the doji, the overall confluence supports a short-term upward move.",
    "entryPrice": 118164.62,
    "result": "PENDING",
    "checkAt": 1752916952540
  },
  {
    "timestamp": 1752916892233,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. The stochastic is in a neutral position but slightly favoring upward movement. The proximity to the Fib 0.618 level adds potential support. Despite the lack of a specific candle pattern, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118182.69,
    "result": "PENDING",
    "checkAt": 1752917192233
  },
  {
    "timestamp": 1752917012025,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA50 above EMA200. RSI is above 60, indicating bullish momentum. The price has pulled back to EMA50, which often acts as support in an uptrend. Stochastic is not overbought, suggesting room for upward movement. The proximity to the Fibonacci 0.618 level adds confluence for a potential bounce. Overall, the setup favors an upward move.",
    "entryPrice": 118176,
    "result": "PENDING",
    "checkAt": 1752917312025
  },
  {
    "timestamp": 1752917132674,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting there is still room for upward movement. The doji candle pattern indicates indecision, but the price action shows a pullback to the EMA50, which often acts as support in an uptrend. The stochastic is overbought, which could signal a potential reversal, but given the trend and support at EMA50, the likelihood of continuation is higher. The proximity to the Fib 0.618 level adds to the bullish confluence.",
    "entryPrice": 118197.03,
    "result": "PENDING",
    "checkAt": 1752917432674
  },
  {
    "timestamp": 1752917252469,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting room for upward movement. The doji candle pattern and the pullback to EMA50 indicate potential reversal or continuation of the trend. The stochastic is extremely high, which could indicate overbought conditions, but given the trend and other factors, an upward move is more likely. The proximity to the 0.618 Fib level adds support to the bullish bias.",
    "entryPrice": 118197.3,
    "result": "PENDING",
    "checkAt": 1752917552469
  },
  {
    "timestamp": 1752917433271,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is above 60, suggesting bullish strength. The pullback to EMA50 with a volume spike on the reversal candle indicates potential continuation of the uptrend. The stochastic is not in overbought territory, and the price is near the Fib 0.618 level, which often acts as a support in an uptrend. Despite the doji pattern indicating indecision, the confluence of other indicators supports an upward move.",
    "entryPrice": 118214.41,
    "result": "PENDING",
    "checkAt": 1752917733271
  },
  {
    "timestamp": 1752917735112,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. Although a Doji candle indicates indecision, the price has pulled back to the EMA50, which often acts as a support in an uptrend. The stochastic %K is above %D and near the overbought zone, indicating potential continuation of the upward move. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Therefore, the setup favors an upward move.",
    "entryPrice": 118228.89,
    "result": "PENDING",
    "checkAt": 1752918035112
  },
  {
    "timestamp": 1752917791999,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Doji candle and the RSI being close to overbought levels suggest potential short-term bearishness. The Stochastic indicator is also in the overbought region, indicating a possible pullback. The price touching the EMA50 and being near the Fib 0.618 level further supports a short-term retracement.",
    "entryPrice": 118243.49,
    "result": "PENDING",
    "checkAt": 1752918091999
  },
  {
    "timestamp": 1752917972787,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought, and the Stochastic is extremely high, indicating potential for a short-term pullback. The price action touching the EMA50 suggests a possible resistance level. The proximity to the Fib 0.618 level also suggests a potential reversal point.",
    "entryPrice": 118289.42,
    "result": "PENDING",
    "checkAt": 1752918272787
  },
  {
    "timestamp": 1752918032602,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 65,
    "reason": "Despite the overall uptrend indicated by EMA50 > EMA200, the RSI is overbought at 72.23, suggesting a potential short-term reversal. The price has pulled back to touch EMA50, which can act as resistance in the short term. Additionally, the stochastic %K is below %D, indicating potential bearish momentum. The proximity to the Fib 0.618 level also suggests a possible retracement. Therefore, a short-term downward movement is anticipated.",
    "entryPrice": 118276.97,
    "result": "PENDING",
    "checkAt": 1752918332602
  },
  {
    "timestamp": 1752918212020,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought, the stochastic is extremely overbought, and the presence of a doji with a volume spike on a reversal candle suggests a potential short-term pullback. The price action touching the EMA50 and being near the Fib 0.618 level further supports a temporary downward move.",
    "entryPrice": 118297.72,
    "result": "PENDING",
    "checkAt": 1752918512020
  },
  {
    "timestamp": 1752918392385,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 85,
    "reason": "The overall trend is down with EMA50 below EMA200. RSI and Stochastic are both overbought, suggesting a potential reversal. The Doji candle pattern at the EMA50 pullback indicates indecision but aligns with a continuation of the downtrend. The proximity to the Fib 0.618 level adds to the likelihood of a downward move.",
    "entryPrice": 118305.18,
    "result": "PENDING",
    "checkAt": 1752918692385
  },
  {
    "timestamp": 1752918451886,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 85,
    "reason": "The overall trend is down, indicated by EMA50 being below EMA200. RSI is overbought at 77.29, suggesting a potential reversal. The stochastic is also extremely overbought, reinforcing the likelihood of a downward move. The doji candle pattern and price touching EMA50 suggest indecision but within a downtrend context. The proximity to the Fib 0.618 level may provide resistance. All these factors point to a continuation of the downtrend.",
    "entryPrice": 118305.18,
    "result": "PENDING",
    "checkAt": 1752918751886
  },
  {
    "timestamp": 1752918754597,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the trend. The Stochastic %K is at 0, indicating oversold conditions, but with the %D still above 0, it does not strongly suggest a reversal. The proximity to the Fib 0.618 level adds some support, but the overall confluence points to a continuation of the downtrend.",
    "entryPrice": 118243.04,
    "result": "PENDING",
    "checkAt": 1752919054597
  },
  {
    "timestamp": 1752918812219,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Stochastic is near oversold levels but not yet indicating a reversal. The MACD histogram is not provided, but the other indicators suggest continuation of the downtrend.",
    "entryPrice": 118220.02,
    "result": "PENDING",
    "checkAt": 1752919112219
  },
  {
    "timestamp": 1752919052916,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The stochastic is in the oversold region but not yet showing a clear reversal signal. The presence of a Doji indicates indecision, but given the downtrend and other indicators, the likelihood of continuation downwards is higher.",
    "entryPrice": 118216.92,
    "result": "PENDING",
    "checkAt": 1752919352916
  },
  {
    "timestamp": 1752919172638,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic is below 50, indicating bearish momentum, and the MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118244.3,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752919292557,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 52.09, and the presence of a Doji suggests indecision, but the price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic indicates a potential continuation of the downtrend. The proximity to the 0.618 Fib level could provide resistance, supporting a downward move.",
    "priceAtSignal": 118253.17,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752919717511,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below 50, suggesting potential for upward movement. The doji candle pattern and pullback to EMA50 indicate indecision but potential support. Stochastic is oversold, suggesting a possible upward reversal. The price is near the Fib 0.618 level, which often acts as a strong support. These factors together suggest a likely upward movement.",
    "priceAtSignal": 118202.68,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752919893428,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The price has pulled back to the EMA50, which often acts as support in an uptrend. The RSI is neutral, not indicating overbought or oversold conditions, and the stochastic is rising, suggesting potential upward momentum. The presence of a Doji candle indicates indecision, but in the context of an uptrend, it could signal a continuation. The proximity to the Fib 0.618 level, a common retracement level, adds to the potential for a bounce. These factors combined suggest a higher probability of the price moving up in the next 5 minutes.",
    "priceAtSignal": 118225.44,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920133328,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions, and the price is pulling back to a key moving average (EMA50), which often acts as support in an uptrend. The stochastic is in a neutral zone but slightly rising, and the price is near the Fibonacci 0.618 level, which is a common retracement level for continuation. These factors suggest a higher probability of price moving up in the next 5 minutes.",
    "priceAtSignal": 118225.46,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920192313,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up, indicated by EMA50 being above EMA200. The price has pulled back to touch EMA50, which often acts as support in an uptrend. Although the RSI is neutral and the stochastic is not in an overbought or oversold condition, the proximity to the Fibonacci 0.618 level suggests a potential continuation of the uptrend. The doji candle pattern indicates indecision, but given the trend and support factors, an upward move is more likely.",
    "priceAtSignal": 118225.45,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920434497,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Shooting Star candle pattern at a key resistance level (Fib 0.618) suggests a potential reversal. The RSI is neutral, and the Stochastic is in overbought territory, indicating a possible short-term pullback. The price touching EMA50 further supports a temporary downward movement.",
    "priceAtSignal": 118254.25,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920552681,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Doji candle pattern and the RSI being near overbought levels suggest potential short-term exhaustion. The Stochastic indicator is also in the overbought zone, indicating a possible pullback. The price touching EMA50 and being near the Fib 0.618 level adds to the likelihood of a short-term reversal.",
    "priceAtSignal": 118289.42,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920672860,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is above 50, suggesting bullish strength. The price has pulled back to EMA50, a potential support level, and the stochastic is in the overbought region, which could indicate a continuation of the trend. The proximity to the Fibonacci 0.618 level adds confluence for a potential bounce. However, the lack of a candle pattern and normal volume slightly reduce confidence.",
    "priceAtSignal": 118290.24,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920854367,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting there is still room for upward movement. The price has pulled back to the EMA50, which often acts as support in an uptrend. Stochastic %K is above %D, indicating bullish momentum. The proximity to the Fib 0.618 level adds additional support for a potential bounce. Overall, the confluences suggest a higher probability of price moving up in the next 5 minutes.",
    "priceAtSignal": 118316.59,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752920912833,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is close to overbought but not extreme, suggesting continued upward momentum. The stochastic is extremely high, indicating potential overbought conditions, but this can also signal strong upward momentum in trending markets. The doji candle pattern and pullback to EMA50 suggest a potential reversal, but given the trend and the proximity to the Fibonacci 0.618 level, the bias remains upward.",
    "priceAtSignal": 118316.59,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921092282,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels, the stochastic is extremely overbought, and the doji candle pattern at a key Fib level suggests potential reversal or consolidation. The pullback to EMA50 adds to the likelihood of a short-term downward move.",
    "priceAtSignal": 118327.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921214006,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels, and the stochastic indicators are extremely high, suggesting a potential short-term pullback. The price touching EMA50 could indicate a temporary resistance, especially near the Fib 0.618 level.",
    "priceAtSignal": 118328,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921393467,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels and the stochastic indicators are extremely high, suggesting a potential short-term reversal. The doji candle pattern and the pullback to EMA50 further indicate indecision and potential for a downward move. The proximity to the Fib 0.618 level also suggests a possible retracement.",
    "priceAtSignal": 118327.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921514623,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200, and the RSI is above 60, suggesting bullish momentum. The pullback to EMA50 could be a buying opportunity. Although the Doji candle indicates indecision, the stochastic is in the overbought region, which could suggest a continuation of the trend. The proximity to the Fibonacci 0.618 level adds to the confluence for a potential upward move.",
    "priceAtSignal": 118319.85,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921812706,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought and the Stochastic is extremely high, indicating potential for a short-term pullback. The price action touching the EMA50 suggests a possible temporary correction. The proximity to the Fib 0.618 level may also act as a resistance in the short term.",
    "priceAtSignal": 118450.67,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921880074,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend (EMA50 > EMA200), the RSI is overbought at 77.12, indicating potential for a short-term pullback. The doji candle pattern suggests indecision, and the price has just touched the EMA50, which could act as resistance. The stochastic is also in the overbought region, supporting a potential short-term downward move. The proximity to the Fib 0.618 level adds to the likelihood of a pullback.",
    "priceAtSignal": 118450.66,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752921933600,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought at 77.96, indicating a potential short-term reversal. The stochastic %K and %D are also in the overbought region, suggesting a possible pullback. The price action touching the EMA50 further supports a temporary retracement. The proximity to the Fib 0.618 level adds to the likelihood of a pullback. Hence, a short-term DOWN trade is suggested.",
    "priceAtSignal": 118458,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752922293960,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions. The price has pulled back to the EMA50, which often acts as a support in an uptrend. The Stochastic is near oversold levels, indicating potential upward momentum. The proximity to the Fib 0.618 level adds confluence for a potential bounce. However, the lack of a strong candle pattern and normal volume slightly reduce confidence.",
    "priceAtSignal": 118381.87,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752922952696,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is in bullish territory, and the stochastic is overbought, suggesting strong upward momentum. The pullback to EMA50 could be a buying opportunity in an uptrend. The presence of a doji indicates indecision, but given the trend and other indicators, the likelihood of continuation upwards is higher.",
    "priceAtSignal": 118452.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752923132636,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought at 70.19, the stochastic is extremely overbought, and a doji candle pattern suggests indecision. The price has pulled back to the EMA50, indicating potential short-term resistance. These factors suggest a possible short-term correction.",
    "priceAtSignal": 118479.18,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752923254087,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting potential overbought conditions. The stochastic is also in the overbought region, which aligns with a potential downward move. The doji candle pattern and normal volume suggest indecision, but given the trend and indicators, a continuation downward is more likely.",
    "priceAtSignal": 118472.81,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752923434934,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation lower. The Stochastic is not in overbought territory, and the MACD histogram is not provided, but the general setup supports a continuation of the downtrend. The proximity to the Fib 0.618 level adds a potential resistance point, reinforcing the likelihood of a downward move.",
    "priceAtSignal": 118421.34,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752923672900,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is near the oversold level, suggesting potential for further downward movement. The price has touched EMA50, which could act as resistance in a downtrend. Stochastic indicates oversold conditions, but the lack of a strong reversal pattern or significant divergence suggests continuation of the trend. The proximity to the Fib 0.618 level may provide temporary support, but the prevailing trend and indicators suggest a downward bias.",
    "priceAtSignal": 118302.85,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752923912318,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The RSI is in the oversold territory, indicating a potential reversal. The price action shows a pullback to the EMA50, which can act as support. The Stochastic is also in the oversold region, suggesting a possible upward movement. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "priceAtSignal": 118208.1,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924273902,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting no strong overbought condition. The stochastic is extremely high, indicating potential overbought conditions, which aligns with a potential continuation of the downtrend. The doji candle pattern near the EMA50 suggests indecision but within a downtrend context, it may signal a continuation of the trend. The price action touching EMA50 and near the Fib 0.618 level could act as resistance. These factors combined suggest a higher probability of price moving down.",
    "priceAtSignal": 118429.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924395255,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below the overbought level, suggesting there is room for further downside. The Stochastic is extremely overbought, indicating a potential reversal or continuation of the downtrend. The price touching EMA50 during a downtrend often acts as a resistance level, supporting a downward move. The presence near the Fib 0.618 level adds to the potential for a continuation of the downtrend. However, the lack of a clear candle pattern reduces confidence slightly.",
    "priceAtSignal": 118432.73,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924453733,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is relatively high at 59.2, suggesting potential overbought conditions. The stochastic is also in the overbought region, with %K and %D both above 95. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Despite the lack of a candle pattern and normal volume, the confluence of these indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118435.68,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924573106,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting potential overbought conditions. The stochastic is also at a high level, indicating overbought conditions. The doji candle pattern and pullback to EMA50 suggest potential continuation of the downtrend. The presence near the Fib 0.618 level could act as resistance. These factors align for a short-term bearish outlook.",
    "priceAtSignal": 118459.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924693140,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting no overbought conditions. The stochastic %K is high, indicating potential overbought conditions, but the trend and pullback to EMA50 suggest a continuation downward. The price action touching EMA50 in a downtrend often signals a continuation of the trend. The MACD histogram is not provided, but the other indicators suggest a downtrend continuation. The proximity to the Fib 0.618 level could provide resistance, supporting a downward move.",
    "priceAtSignal": 118453.89,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924812994,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the presence of a Doji suggests indecision, which could lead to continuation of the current trend. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is overbought, indicating potential for a downward move. The proximity to the Fib 0.618 level adds confluence to a potential reversal. Overall, the confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "priceAtSignal": 118429.1,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752924993281,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but not overbought, suggesting room for further downside. The doji candle pattern indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the stochastic is near overbought levels, which could lead to a downward move. The proximity to the Fib 0.618 level suggests a potential reversal point, but the trend and other indicators favor a downward move.",
    "priceAtSignal": 118433.89,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752925052909,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, and the doji candle suggests indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in an overbought or oversold condition, and the MACD histogram is not provided, but the proximity to the Fib 0.618 level suggests a potential continuation of the downtrend. Thus, the confluence of these factors leans towards a continuation of the downtrend.",
    "priceAtSignal": 118433.89,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752925295685,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being neutral and the stochastic showing potential overbought conditions, the price action touching EMA50 suggests a continuation of the downtrend. The MACD histogram is not specified, but given the other indicators, a short-term down move is more likely.",
    "priceAtSignal": 118447.99,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752925355026,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 51.55, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the stochastic %K is below %D, indicating potential bearish momentum. The proximity to the Fib 0.618 level could provide resistance, supporting a continuation of the downtrend.",
    "priceAtSignal": 118424.1,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752925474239,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D and near the lower range, suggesting potential downward momentum. The proximity to the Fib 0.618 level may provide resistance. These factors suggest a continuation of the downtrend.",
    "priceAtSignal": 118433.72,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752925893491,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The Stochastic is oversold, but the %K is below %D, indicating continued bearish pressure. The MACD histogram is not provided, but other indicators suggest a continuation of the downtrend. The proximity to the Fib 0.618 level may provide some support, but the confluence of other indicators supports a DOWN trade.",
    "priceAtSignal": 118332,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926014250,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, a common resistance level in a downtrend. The doji candle pattern indicates indecision, but given the downtrend, it may signal a continuation of the bearish move. The stochastic is in oversold territory but not yet showing a clear reversal. The proximity to the Fib 0.618 level could act as resistance. Overall, the confluence suggests a continuation of the downtrend.",
    "priceAtSignal": 118343.73,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926133776,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "Despite the overall downtrend indicated by EMA50 < EMA200, the presence of a hammer candle pattern at a pullback to EMA50, combined with a volume spike on the reversal candle, suggests a potential short-term reversal. Additionally, the RSI is near oversold levels and the stochastic is showing signs of bullish divergence near the Fib 0.618 level, supporting a short-term upward movement.",
    "priceAtSignal": 118335.34,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926192929,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 65,
    "reason": "The RSI is oversold at 32.41, and the Stochastic %K is at 0, indicating potential upward momentum. The Doji candle suggests indecision, often preceding a reversal, especially near the 0.618 Fib level. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "priceAtSignal": 118306.75,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926373294,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is very low, indicating oversold conditions, but without a clear reversal pattern or strong divergence, the downtrend is likely to continue. The MACD histogram is not specified, but the confluence of other indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118327.06,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926554293,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but given the downtrend, it might signal continuation rather than reversal. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is not in oversold territory, allowing room for further downside. The proximity to the Fib 0.618 level could provide resistance. These factors suggest a higher probability of the price moving down in the next 5 minutes.",
    "priceAtSignal": 118327.05,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752926675457,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching the EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, indicating potential continuation of the downtrend. Although the price is near the Fib 0.618 level, which can act as support, the lack of strong bullish signals and the prevailing downtrend suggest a higher probability of the price moving lower in the next 5 minutes.",
    "priceAtSignal": 118326.42,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752927153185,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200, indicating bearish momentum. RSI is below 50, suggesting bearish conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic is neutral but not oversold, and the MACD histogram is not provided, but given the trend, it likely supports bearish momentum. The proximity to the Fib 0.618 level could act as resistance, reinforcing the downtrend. Volume is normal, providing no counter signals.",
    "priceAtSignal": 118261.69,
    "result": null,
    "confirmedAt": null
  },
  {
    "timestamp": 1752927274352,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200. RSI is near oversold but not yet indicating a reversal. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is very low, suggesting potential for further downward movement. The presence near the Fib 0.618 level could provide resistance, reinforcing the downtrend continuation.",
    "priceAtSignal": 118209.22,
    "result": null,
    "confirmedAt": null
  }
]




[
  {
    "timestamp": 1752887246260,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The RSI is oversold at 29.41, indicating a potential upward correction. The presence of a Doji suggests indecision and potential reversal. The price has pulled back to the EMA50, which can act as support. Stochastic %K is extremely low, suggesting a possible upward movement. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "entryPrice": 117633.49,
    "result": "PENDING",
    "checkAt": 1752887546260,
    "signalTime": "19/07/2025 02:07:26",
    "checkTime": "19/07/2025 02:12:26"
  },
  {
    "timestamp": 1752887966705,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 60 and the stochastic being in the overbought region, the presence of a doji candle pattern and a pullback to EMA50 suggests a potential continuation of the downtrend. The MACD histogram is not specified, but the confluence of the trend and the price action near a significant Fib level supports a bearish outlook.",
    "entryPrice": 117923.99,
    "result": "PENDING",
    "checkAt": 1752888266705,
    "signalTime": "19/07/2025 02:19:26",
    "checkTime": "19/07/2025 02:24:26"
  },
  {
    "timestamp": 1752888027629,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being relatively high at 62.92, suggesting potential overbought conditions, the presence of a doji candle pattern and the stochastic being in the overbought region (%K > %D) support a potential reversal or continuation of the downtrend. The price touching EMA50 during a downtrend often acts as resistance. The proximity to the 0.618 Fibonacci level adds to the likelihood of a continuation of the downtrend. Therefore, the confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117958.21,
    "result": "PENDING",
    "checkAt": 1752888327629,
    "signalTime": "19/07/2025 02:20:27",
    "checkTime": "19/07/2025 02:25:27"
  },
  {
    "timestamp": 1752888866175,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 55.39, not indicating overbought or oversold conditions. The doji candle pattern suggests indecision, but the price action shows a pullback touching the EMA50, which often acts as resistance in a downtrend. The Stochastic is below 50, indicating potential for further downside. The MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend.",
    "entryPrice": 117956.02,
    "result": "PENDING",
    "checkAt": 1752889166175,
    "signalTime": "19/07/2025 02:34:26",
    "checkTime": "19/07/2025 02:39:26"
  },
  {
    "timestamp": 1752889107874,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting the market is not overbought. The presence of a Doji indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic %K is above 70, indicating potential overbought conditions. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. These factors suggest a continuation of the downtrend.",
    "entryPrice": 117990.5,
    "result": "PENDING",
    "checkAt": 1752889407874,
    "signalTime": "19/07/2025 02:38:27",
    "checkTime": "19/07/2025 02:43:27"
  },
  {
    "timestamp": 1752889586496,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but leaning towards bearish. The doji candle pattern suggests indecision, but the touch of EMA50 in a downtrend often acts as resistance. Stochastic is oversold, but not yet showing a clear reversal signal. The proximity to the Fib 0.618 level may provide some support, but the confluence of a downtrend and resistance at EMA50 suggests a higher probability of a downward move.",
    "entryPrice": 117964,
    "result": "PENDING",
    "checkAt": 1752889886496,
    "signalTime": "19/07/2025 02:46:26",
    "checkTime": "19/07/2025 02:51:26"
  },
  {
    "timestamp": 1752889766440,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The presence of a hammer candle pattern near the EMA50 suggests a potential reversal or short-term bullish momentum. Although the overall trend is down, the RSI is neutral, and the stochastic indicates potential upward movement from oversold conditions. The proximity to the Fib 0.618 level adds confluence for a short-term upward retracement.",
    "entryPrice": 117994.33,
    "result": "PENDING",
    "checkAt": 1752890066440,
    "signalTime": "19/07/2025 02:49:26",
    "checkTime": "19/07/2025 02:54:26"
  },
  {
    "timestamp": 1752890307182,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback touching EMA50, suggesting a continuation of the downtrend. The RSI is neutral, but the stochastic is below 50, indicating bearish momentum. The proximity to the Fib 0.618 level could act as resistance, supporting a downward move.",
    "entryPrice": 118023.3,
    "result": "PENDING",
    "checkAt": 1752890607182,
    "signalTime": "19/07/2025 02:58:27",
    "checkTime": "19/07/2025 03:03:27"
  },
  {
    "timestamp": 1752890845913,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but given the trend and lack of bullish signals, the downtrend is likely to continue.",
    "entryPrice": 117978.74,
    "result": "PENDING",
    "checkAt": 1752891145913,
    "signalTime": "19/07/2025 03:07:25",
    "checkTime": "19/07/2025 03:12:25"
  },
  {
    "timestamp": 1752891026080,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic is below 50, suggesting bearish momentum. The MACD histogram is not specified, but given the other indicators, the overall confluence suggests a continuation of the downtrend.",
    "entryPrice": 118005.65,
    "result": "PENDING",
    "checkAt": 1752891326080,
    "signalTime": "19/07/2025 03:10:26",
    "checkTime": "19/07/2025 03:15:26"
  },
  {
    "timestamp": 1752891207519,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions, and the presence of a Doji suggests indecision. However, the pullback touching EMA50 in a downtrend often acts as resistance, suggesting a continuation of the downtrend. The MACD histogram is not provided, but the Stochastic is below 50, indicating potential downward momentum. The proximity to the 0.618 Fib level could add resistance. Overall, the confluence of these factors supports a DOWN trade.",
    "entryPrice": 118000,
    "result": "PENDING",
    "checkAt": 1752891507519,
    "signalTime": "19/07/2025 03:13:27",
    "checkTime": "19/07/2025 03:18:27"
  },
  {
    "timestamp": 1752891446039,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is also showing bearish signals with %K below %D. The presence near the Fib 0.618 level adds a potential resistance confluence. Despite normal volume and no candle pattern, the majority of indicators suggest a continuation of the downtrend.",
    "entryPrice": 117992.92,
    "result": "PENDING",
    "checkAt": 1752891746039,
    "signalTime": "19/07/2025 03:17:26",
    "checkTime": "19/07/2025 03:22:26"
  },
  {
    "timestamp": 1752891506080,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 65,
    "reason": "The presence of a hammer candle pattern at the EMA50 suggests a potential reversal or bounce, despite the overall downtrend. RSI is neutral, and the stochastic indicates potential upward momentum. The proximity to the Fib 0.618 level adds to the likelihood of a short-term upward move.",
    "entryPrice": 118009.99,
    "result": "PENDING",
    "checkAt": 1752891806080,
    "signalTime": "19/07/2025 03:18:26",
    "checkTime": "19/07/2025 03:23:26"
  },
  {
    "timestamp": 1752893967352,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, suggesting potential bearish momentum. The MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend. The Fib level near 0.618 could provide resistance, supporting a downward move.",
    "entryPrice": 118212.02,
    "result": "PENDING",
    "checkAt": 1752894267352,
    "signalTime": "19/07/2025 03:59:27",
    "checkTime": "19/07/2025 04:04:27"
  },
  {
    "timestamp": 1752894267798,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 49.52, providing no strong directional bias. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, suggesting potential continuation of the downward move. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level near 0.618 could act as resistance, supporting a downward move.",
    "entryPrice": 118177.42,
    "result": "PENDING",
    "checkAt": 1752894567798,
    "signalTime": "19/07/2025 04:04:27",
    "checkTime": "19/07/2025 04:09:27"
  },
  {
    "timestamp": 1752894628018,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is low, indicating potential oversold conditions, but the trend and other indicators favor a continuation of the downtrend. The proximity to the Fib 0.618 level adds to the likelihood of resistance holding.",
    "entryPrice": 118145.68,
    "result": "PENDING",
    "checkAt": 1752894928018,
    "signalTime": "19/07/2025 04:10:28",
    "checkTime": "19/07/2025 04:15:28"
  },
  {
    "timestamp": 1752894928150,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the stochastic is overbought, suggesting a potential reversal or continuation of the downtrend. The doji pattern at the EMA50 could indicate indecision, but given the downtrend and overbought stochastic, a continuation downwards is more likely. The price is near the Fib 0.618 level, which often acts as a resistance in a downtrend.",
    "entryPrice": 118209.15,
    "result": "PENDING",
    "checkAt": 1752895228150,
    "signalTime": "19/07/2025 04:15:28",
    "checkTime": "19/07/2025 04:20:28"
  },
  {
    "timestamp": 1752895046882,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 52.71, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The Stochastic is relatively high, suggesting potential for a downward move. The MACD histogram is not provided, but the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 118194.85,
    "result": "PENDING",
    "checkAt": 1752895346882,
    "signalTime": "19/07/2025 04:17:26",
    "checkTime": "19/07/2025 04:22:26"
  },
  {
    "timestamp": 1752895171120,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal a continuation of the trend. RSI is neutral, not indicating overbought or oversold conditions, and the MACD histogram is not specified, but the stochastic is relatively high, suggesting potential for downward movement. The proximity to the Fib 0.618 level adds to the likelihood of a continuation of the downtrend.",
    "entryPrice": 118197.72,
    "result": "PENDING",
    "checkAt": 1752895471120,
    "signalTime": "19/07/2025 04:19:31",
    "checkTime": "19/07/2025 04:24:31"
  },
  {
    "timestamp": 1752895466943,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 60, suggesting some bullish momentum, the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic is in the overbought region, indicating potential for a downward move. The presence near the Fib 0.618 level could also act as a resistance point, supporting a continuation of the downtrend.",
    "entryPrice": 118252.84,
    "result": "PENDING",
    "checkAt": 1752895766943,
    "signalTime": "19/07/2025 04:24:26",
    "checkTime": "19/07/2025 04:29:26"
  },
  {
    "timestamp": 1752895586647,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is relatively high at 62.99, suggesting potential overbought conditions. The Doji candle pattern and the price touching EMA50 indicate indecision and a possible continuation of the downtrend. The Stochastic is in the overbought region, which aligns with a potential downward move. Although the MACD histogram value is missing, the other indicators provide sufficient confluence for a DOWN trade.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752895886647,
    "signalTime": "19/07/2025 04:26:26",
    "checkTime": "19/07/2025 04:31:26"
  },
  {
    "timestamp": 1752895648474,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Although RSI is relatively high at 62.99, suggesting potential overbought conditions, the presence of a Doji candle pattern indicates market indecision. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is above %D, but both are in overbought territory, suggesting a potential reversal. The proximity to the Fib 0.618 level adds to the likelihood of resistance holding. Therefore, the confluences suggest a continuation of the downtrend.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752895948474,
    "signalTime": "19/07/2025 04:27:28",
    "checkTime": "19/07/2025 04:32:28"
  },
  {
    "timestamp": 1752895887276,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, suggesting no strong momentum shift. The price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic indicates a potential continuation of the downtrend as %K is below %D and both are below 50. The proximity to the Fib 0.618 level suggests a possible resistance area. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118251.34,
    "result": "PENDING",
    "checkAt": 1752896187276,
    "signalTime": "19/07/2025 04:31:27",
    "checkTime": "19/07/2025 04:36:27"
  },
  {
    "timestamp": 1752895947603,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is neutral at 55.26, not indicating overbought or oversold conditions. The presence of a Doji candle suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram value is missing, but the Stochastic is above 50, indicating potential for more downside. The proximity to the Fibonacci 0.618 level adds to the resistance. Overall, the confluence of a downtrend and resistance levels suggests a continuation downwards.",
    "entryPrice": 118251.35,
    "result": "PENDING",
    "checkAt": 1752896247603,
    "signalTime": "19/07/2025 04:32:27",
    "checkTime": "19/07/2025 04:37:27"
  },
  {
    "timestamp": 1752896186885,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 53.18, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic %K is below %D and under 50, suggesting potential downward momentum. The proximity to the Fib 0.618 level could act as resistance. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118251.3,
    "result": "PENDING",
    "checkAt": 1752896486885,
    "signalTime": "19/07/2025 04:36:26",
    "checkTime": "19/07/2025 04:41:26"
  },
  {
    "timestamp": 1752896245912,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Although the RSI is relatively neutral and stochastic is not in an extreme position, the lack of a strong reversal pattern and the presence of a downtrend suggest a continuation of the downward movement.",
    "entryPrice": 118279.25,
    "result": "PENDING",
    "checkAt": 1752896545912,
    "signalTime": "19/07/2025 04:37:25",
    "checkTime": "19/07/2025 04:42:25"
  },
  {
    "timestamp": 1752896726430,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The RSI is moderately high, suggesting potential for a downward move. The stochastic indicates a potential overbought condition. Despite the lack of a candle pattern, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 118332.97,
    "result": "PENDING",
    "checkAt": 1752897026430,
    "signalTime": "19/07/2025 04:45:26",
    "checkTime": "19/07/2025 04:50:26"
  },
  {
    "timestamp": 1752896847855,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is neutral but not overbought, suggesting room for further downside. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The presence of a Doji indicates indecision, but the trend and pullback suggest a continuation downward. The MACD histogram is not provided, but the stochastic is near overbought, supporting a potential downward move. The proximity to the Fib 0.618 level can act as a resistance, enhancing the bearish bias.",
    "entryPrice": 118326.52,
    "result": "PENDING",
    "checkAt": 1752897147855,
    "signalTime": "19/07/2025 04:47:27",
    "checkTime": "19/07/2025 04:52:27"
  },
  {
    "timestamp": 1752897087219,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall downtrend, the hammer candle pattern at a pullback to EMA50, oversold RSI, and stochastic %K crossing below %D near the Fib 0.618 level suggest a potential short-term reversal.",
    "entryPrice": 118214.54,
    "result": "PENDING",
    "checkAt": 1752897387219,
    "signalTime": "19/07/2025 04:51:27",
    "checkTime": "19/07/2025 04:56:27"
  },
  {
    "timestamp": 1752897687547,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation of the trend. RSI is neutral, not indicating overbought or oversold conditions. The Stochastic is relatively high, suggesting potential for a downward move. The proximity to the Fib 0.618 level may also act as resistance. Given these factors, a DOWN trade is more likely.",
    "entryPrice": 118287.98,
    "result": "PENDING",
    "checkAt": 1752897987547,
    "signalTime": "19/07/2025 05:01:27",
    "checkTime": "19/07/2025 05:06:27"
  },
  {
    "timestamp": 1752897747045,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The presence of a Doji indicates indecision, but in the context of a downtrend, it may signal a continuation. The Stochastic is not in an oversold or overbought condition, providing no strong counter-signal. The proximity to the Fib 0.618 level could act as resistance, reinforcing the bearish outlook.",
    "entryPrice": 118263.96,
    "result": "PENDING",
    "checkAt": 1752898047045,
    "signalTime": "19/07/2025 05:02:27",
    "checkTime": "19/07/2025 05:07:27"
  },
  {
    "timestamp": 1752897866730,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200, indicating bearish momentum. The RSI is below 50, suggesting lack of bullish strength. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The stochastic is not in an oversold zone, providing room for further downside. The proximity to the Fib 0.618 level may offer some support, but the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118271.46,
    "result": "PENDING",
    "checkAt": 1752898166730,
    "signalTime": "19/07/2025 05:04:26",
    "checkTime": "19/07/2025 05:09:26"
  },
  {
    "timestamp": 1752897987155,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being above 50, suggesting some bullish momentum, the Stochastic is overbought, indicating potential for a downward move. The Doji candle pattern and price touching EMA50 suggest indecision and a possible continuation of the downtrend. The proximity to the Fib 0.618 level adds to the potential for a reversal back down. Hence, the confluence of these factors supports a DOWN trade.",
    "entryPrice": 118326.93,
    "result": "PENDING",
    "checkAt": 1752898287155,
    "signalTime": "19/07/2025 05:06:27",
    "checkTime": "19/07/2025 05:11:27"
  },
  {
    "timestamp": 1752898107189,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Although the RSI is neutral and the stochastic is not in an oversold condition, the lack of a strong reversal pattern and the proximity to the Fib 0.618 level suggest a continuation of the downtrend.",
    "entryPrice": 118318.01,
    "result": "PENDING",
    "checkAt": 1752898407189,
    "signalTime": "19/07/2025 05:08:27",
    "checkTime": "19/07/2025 05:13:27"
  },
  {
    "timestamp": 1752898347247,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 54.29, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price has recently pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic %K is above %D, indicating potential short-term upward movement, yet it is still within a downtrend context. The proximity to the Fib 0.618 level suggests potential resistance. Given these factors, the downtrend is likely to continue in the short term.",
    "entryPrice": 118317.81,
    "result": "PENDING",
    "checkAt": 1752898647247,
    "signalTime": "19/07/2025 05:12:27",
    "checkTime": "19/07/2025 05:17:27"
  },
  {
    "timestamp": 1752898407204,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in an extreme position, and the MACD histogram is not provided, but the trend and pullback suggest a continuation of the downtrend. The proximity to the Fib 0.618 level could indicate a potential reversal, but the trend and pullback setup suggest a higher probability of a downward move.",
    "entryPrice": 118331.47,
    "result": "PENDING",
    "checkAt": 1752898707204,
    "signalTime": "19/07/2025 05:13:27",
    "checkTime": "19/07/2025 05:18:27"
  },
  {
    "timestamp": 1752898586496,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting limited upside potential. The doji candle pattern and the price touching EMA50 indicate a potential continuation of the downtrend. Stochastic is overbought, supporting a downward move. Despite being near the Fib 0.618 level, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118348.69,
    "result": "PENDING",
    "checkAt": 1752898886496,
    "signalTime": "19/07/2025 05:16:26",
    "checkTime": "19/07/2025 05:21:26"
  },
  {
    "timestamp": 1752898767614,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but leaning towards bearish territory. The price action shows a pullback to EMA50, which often acts as a resistance in a downtrend. The MACD histogram is not provided, but the stochastic indicators show a bearish crossover potential. The proximity to the Fib 0.618 level suggests a potential reversal, but the confluence of the trend and other indicators favors a continuation of the downtrend.",
    "entryPrice": 118306.09,
    "result": "PENDING",
    "checkAt": 1752899067614,
    "signalTime": "19/07/2025 05:19:27",
    "checkTime": "19/07/2025 05:24:27"
  },
  {
    "timestamp": 1752898826778,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in the oversold region, indicating there is room for further downward movement. Despite being near the Fib 0.618 level, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118280.61,
    "result": "PENDING",
    "checkAt": 1752899126778,
    "signalTime": "19/07/2025 05:20:26",
    "checkTime": "19/07/2025 05:25:26"
  },
  {
    "timestamp": 1752898886848,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and both are below 50, indicating bearish momentum. The proximity to the 0.618 Fib level may provide some support, but the confluence of bearish indicators suggests a continuation of the downtrend.",
    "entryPrice": 118287.45,
    "result": "PENDING",
    "checkAt": 1752899186848,
    "signalTime": "19/07/2025 05:21:26",
    "checkTime": "19/07/2025 05:26:26"
  },
  {
    "timestamp": 1752898947686,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The doji candle pattern at a pullback to EMA50 may indicate indecision, but in the context of a downtrend, it often signals continuation. Stochastic is below 30, indicating potential oversold conditions, but in a strong downtrend, this can persist. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. Overall, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118272.16,
    "result": "PENDING",
    "checkAt": 1752899247686,
    "signalTime": "19/07/2025 05:22:27",
    "checkTime": "19/07/2025 05:27:27"
  },
  {
    "timestamp": 1752899126775,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic indicator is oversold, but the lack of a crossover or divergence reduces its bullish implication. The proximity to the 0.618 Fibonacci level could provide some support, but the prevailing trend and indicators suggest a continuation of the downtrend.",
    "entryPrice": 118233.3,
    "result": "PENDING",
    "checkAt": 1752899426775,
    "signalTime": "19/07/2025 05:25:26",
    "checkTime": "19/07/2025 05:30:26"
  },
  {
    "timestamp": 1752899307663,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is near oversold but not extreme, suggesting potential for further downside. Price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic is at the lower bound, indicating bearish momentum. The proximity to the Fib 0.618 level could provide some support, but the prevailing trend and indicators suggest a continuation of the downward movement.",
    "entryPrice": 118215.45,
    "result": "PENDING",
    "checkAt": 1752899607663,
    "signalTime": "19/07/2025 05:28:27",
    "checkTime": "19/07/2025 05:33:27"
  },
  {
    "timestamp": 1752899428063,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The RSI is near an oversold level (30.97), indicating potential for a reversal. The presence of a Doji candle pattern suggests market indecision and possible reversal. Stochastic is at 0, indicating oversold conditions. Price action shows a pullback to EMA50, which could act as support. Despite the overall downtrend, these factors suggest a short-term upward movement.",
    "entryPrice": 118206.55,
    "result": "PENDING",
    "checkAt": 1752899728063,
    "signalTime": "19/07/2025 05:30:28",
    "checkTime": "19/07/2025 05:35:28"
  },
  {
    "timestamp": 1752899726842,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting the market is not overbought. The stochastic is extremely high, indicating potential for a reversal, but given the downtrend and the doji pattern at a pullback to EMA50, the likelihood of continuation downward is higher. The proximity to the Fib 0.618 level adds to the potential for a downward move.",
    "entryPrice": 118307.46,
    "result": "PENDING",
    "checkAt": 1752900026842,
    "signalTime": "19/07/2025 05:35:26",
    "checkTime": "19/07/2025 05:40:26"
  },
  {
    "timestamp": 1752899847524,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but given the downtrend, it may indicate a continuation of the trend. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic is neutral, slightly leaning towards overbought, which supports a potential downward move. The proximity to the Fib 0.618 level could act as resistance, aligning with the downtrend.",
    "entryPrice": 118266.88,
    "result": "PENDING",
    "checkAt": 1752900147524,
    "signalTime": "19/07/2025 05:37:27",
    "checkTime": "19/07/2025 05:42:27"
  },
  {
    "timestamp": 1752899968632,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is at 34, suggesting bearish momentum, but not yet oversold. The Doji candle pattern indicates indecision, but in a downtrend, it often leads to continuation. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic %K is at 0, indicating strong bearish momentum. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level at 0.618 might provide some support, but the overall confluence supports a DOWN signal.",
    "entryPrice": 118174.69,
    "result": "PENDING",
    "checkAt": 1752900268632,
    "signalTime": "19/07/2025 05:39:28",
    "checkTime": "19/07/2025 05:44:28"
  },
  {
    "timestamp": 1752900207782,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The doji candle pattern indicates indecision, but the pullback touching EMA50 in a downtrend often acts as resistance. Stochastic is below 50, supporting a bearish bias. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. These factors suggest a likely continuation of the downtrend.",
    "entryPrice": 118222.66,
    "result": "PENDING",
    "checkAt": 1752900507782,
    "signalTime": "19/07/2025 05:43:27",
    "checkTime": "19/07/2025 05:48:27"
  },
  {
    "timestamp": 1752900388340,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The stochastic %K is at 0, indicating oversold conditions, but the lack of a reversal pattern or strong bullish confluence reduces the likelihood of an immediate reversal. The price touching EMA50 during a downtrend often acts as resistance. The proximity to the Fib 0.618 level may provide some support, but the prevailing trend and indicators suggest a continuation downward.",
    "entryPrice": 118147.57,
    "result": "PENDING",
    "checkAt": 1752900688340,
    "signalTime": "19/07/2025 05:46:28",
    "checkTime": "19/07/2025 05:51:28"
  },
  {
    "timestamp": 1752900927973,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it can signal a continuation. The MACD histogram is not specified, but the stochastic is above 50, indicating potential for a short-term pullback, yet the overall trend and other indicators suggest a continuation downwards. The proximity to the Fib 0.618 level adds a potential resistance point.",
    "entryPrice": 118176.21,
    "result": "PENDING",
    "checkAt": 1752901227973,
    "signalTime": "19/07/2025 05:55:27",
    "checkTime": "19/07/2025 06:00:27"
  },
  {
    "timestamp": 1752900987921,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but given the downtrend, it may signal a continuation of the trend. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the Stochastic indicates a bearish crossover below 50. The proximity to the Fib 0.618 level could provide resistance, reinforcing the downtrend. Therefore, the confluence of these factors suggests a continuation of the downward movement.",
    "entryPrice": 118152.57,
    "result": "PENDING",
    "checkAt": 1752901287921,
    "signalTime": "19/07/2025 05:56:27",
    "checkTime": "19/07/2025 06:01:27"
  },
  {
    "timestamp": 1752901046565,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. Price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and in the oversold region, which could indicate a potential continuation of the downtrend. The price is near the 0.618 Fib level, which may act as resistance. These factors suggest a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 118140.06,
    "result": "PENDING",
    "checkAt": 1752901346565,
    "signalTime": "19/07/2025 05:57:26",
    "checkTime": "19/07/2025 06:02:26"
  },
  {
    "timestamp": 1752901107765,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the bearish trend. The Stochastic is below 50, supporting the bearish outlook. The proximity to the Fib 0.618 level could act as a resistance point, reinforcing the downtrend continuation.",
    "entryPrice": 118140.05,
    "result": "PENDING",
    "checkAt": 1752901407765,
    "signalTime": "19/07/2025 05:58:27",
    "checkTime": "19/07/2025 06:03:27"
  },
  {
    "timestamp": 1752901287666,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price is currently in a pullback phase, having touched EMA50, which often acts as resistance in a downtrend. The RSI is neutral at 50.28, not providing a strong counter-signal. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation of the trend. The Stochastic %K is high, suggesting overbought conditions, which aligns with a potential downward move. The MACD histogram is not specified, but the other indicators provide sufficient confluence for a downward prediction.",
    "entryPrice": 118179.48,
    "result": "PENDING",
    "checkAt": 1752901587666,
    "signalTime": "19/07/2025 06:01:27",
    "checkTime": "19/07/2025 06:06:27"
  },
  {
    "timestamp": 1752901348640,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The price has pulled back to EMA50, which often acts as resistance in a downtrend. The RSI is neutral, not indicating overbought or oversold conditions, and the Stochastic is in the overbought region, suggesting potential for a downward move. The Doji candle pattern indicates indecision, but in the context of a downtrend and resistance at EMA50, it leans towards continuation of the trend. The presence near the Fib 0.618 level adds to the likelihood of a reversal back down.",
    "entryPrice": 118179.48,
    "result": "PENDING",
    "checkAt": 1752901648640,
    "signalTime": "19/07/2025 06:02:28",
    "checkTime": "19/07/2025 06:07:28"
  },
  {
    "timestamp": 1752901466995,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic %K is below %D and both are below 50, indicating potential continuation of the downtrend. The MACD histogram is not provided, but other indicators suggest a bearish bias. The proximity to the Fib 0.618 level could provide temporary support, but the overall confluence supports a downward move.",
    "entryPrice": 118158.13,
    "result": "PENDING",
    "checkAt": 1752901766995,
    "signalTime": "19/07/2025 06:04:26",
    "checkTime": "19/07/2025 06:09:26"
  },
  {
    "timestamp": 1752901588008,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, indicating bearish momentum. The stochastic is oversold, but the %K line is flat, suggesting a lack of immediate bullish reversal. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may precede further downward movement. The proximity to the Fib 0.618 level could provide temporary support, but the prevailing trend and indicators suggest a continuation of the downtrend.",
    "entryPrice": 118120.31,
    "result": "PENDING",
    "checkAt": 1752901888008,
    "signalTime": "19/07/2025 06:06:28",
    "checkTime": "19/07/2025 06:11:28"
  },
  {
    "timestamp": 1752901647640,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is in oversold territory, but the %K is below %D, indicating continued bearish pressure. The MACD histogram is not specified, but the other indicators provide enough confluence for a bearish signal.",
    "entryPrice": 118134.52,
    "result": "PENDING",
    "checkAt": 1752901947640,
    "signalTime": "19/07/2025 06:07:27",
    "checkTime": "19/07/2025 06:12:27"
  },
  {
    "timestamp": 1752901829191,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 80,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price has pulled back to EMA50, which often acts as resistance in a downtrend. Stochastic %K is at 0, indicating oversold conditions, but the lack of a bullish crossover with %D suggests continued bearish pressure. The proximity to the Fib 0.618 level could provide resistance. The confluence of these factors supports a DOWN trade.",
    "entryPrice": 118087.67,
    "result": "PENDING",
    "checkAt": 1752902129191,
    "signalTime": "19/07/2025 06:10:29",
    "checkTime": "19/07/2025 06:15:29"
  },
  {
    "timestamp": 1752901886493,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The presence of a Doji candle indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is oversold, but the MACD histogram is not provided, which limits the analysis. However, the confluence of the trend and RSI suggests a continuation of the downtrend.",
    "entryPrice": 118087.68,
    "result": "PENDING",
    "checkAt": 1752902186493,
    "signalTime": "19/07/2025 06:11:26",
    "checkTime": "19/07/2025 06:16:26"
  },
  {
    "timestamp": 1752914552222,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it could signal a continuation of the bearish move. The Stochastic is near overbought levels, suggesting a potential downward move. The MACD histogram is not provided, but the other indicators suggest a higher probability of a downward move.",
    "entryPrice": 118052.02,
    "result": "PENDING",
    "checkAt": 1752914852222,
    "signalTime": "19/07/2025 09:42:32",
    "checkTime": "19/07/2025 09:47:32"
  },
  {
    "timestamp": 1752914611293,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down (EMA50 < EMA200), and the price is pulling back to the EMA50, suggesting a continuation of the downtrend. The RSI is below 50, indicating bearish momentum. The presence of a Doji candle suggests indecision, but in the context of a downtrend, it may indicate a continuation rather than a reversal. The Stochastic is near overbought levels, which could signal a potential downward move. The proximity to the Fib 0.618 level adds a potential resistance point. Overall, the confluence of these factors suggests a higher probability of a downward move.",
    "entryPrice": 118048,
    "result": "PENDING",
    "checkAt": 1752914911293,
    "signalTime": "19/07/2025 09:43:31",
    "checkTime": "19/07/2025 09:48:31"
  },
  {
    "timestamp": 1752914670556,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the pullback to EMA50 in a downtrend often leads to continuation downward. Stochastic is in the overbought region, suggesting potential for a downward move. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. These factors collectively suggest a continuation of the downtrend.",
    "entryPrice": 118067.8,
    "result": "PENDING",
    "checkAt": 1752914970556,
    "signalTime": "19/07/2025 09:44:30",
    "checkTime": "19/07/2025 09:49:30"
  },
  {
    "timestamp": 1752914731357,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 53, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action showing a pullback to EMA50 in a downtrend often acts as resistance. The Stochastic is overbought, which aligns with a potential downward move. The MACD histogram is not specified, but given the other indicators, the confluence suggests a continuation of the downtrend.",
    "entryPrice": 118086.85,
    "result": "PENDING",
    "checkAt": 1752915031357,
    "signalTime": "19/07/2025 09:45:31",
    "checkTime": "19/07/2025 09:50:31"
  },
  {
    "timestamp": 1752914910215,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the Stochastic is overbought, suggesting a potential reversal. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The presence of a Doji candle indicates indecision, but given the trend and overbought Stochastic, a continuation of the downtrend is more likely.",
    "entryPrice": 118096.89,
    "result": "PENDING",
    "checkAt": 1752915210215,
    "signalTime": "19/07/2025 09:48:30",
    "checkTime": "19/07/2025 09:53:30"
  },
  {
    "timestamp": 1752915270385,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The price has pulled back to the EMA50, which often acts as a support in an uptrend. Although the RSI is neutral and the stochastic is low, the proximity to the Fibonacci 0.618 level suggests potential support and continuation of the trend. The MACD histogram is not provided, but given the other indicators, an upward movement is more likely.",
    "entryPrice": 118044.19,
    "result": "PENDING",
    "checkAt": 1752915570385,
    "signalTime": "19/07/2025 09:54:30",
    "checkTime": "19/07/2025 09:59:30"
  },
  {
    "timestamp": 1752915633100,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA50 being above EMA200. The RSI is neutral at 52.98, suggesting no overbought or oversold conditions. The doji candle pattern and normal volume indicate indecision, but the pullback to EMA50 suggests a potential continuation of the uptrend. The MACD histogram is not provided, but the stochastic %K is above %D, indicating potential upward momentum. The proximity to the Fib 0.618 level adds a supportive confluence for an upward move.",
    "entryPrice": 118101.82,
    "result": "PENDING",
    "checkAt": 1752915933100,
    "signalTime": "19/07/2025 10:00:33",
    "checkTime": "19/07/2025 10:05:33"
  },
  {
    "timestamp": 1752915813322,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions. The price has pulled back to the EMA50, a potential support level in an uptrend. The stochastic is neutral but slightly leaning towards an upward movement. Being near the Fib 0.618 level, a common retracement level, suggests a potential bounce. The lack of a candle pattern and normal volume do not provide additional confluence, but the existing factors suggest a higher probability of an upward move.",
    "entryPrice": 118109.92,
    "result": "PENDING",
    "checkAt": 1752916113322,
    "signalTime": "19/07/2025 10:03:33",
    "checkTime": "19/07/2025 10:08:33"
  },
  {
    "timestamp": 1752916231666,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. Although a Doji candle indicates indecision, the price has pulled back to the EMA50, which often acts as support in an uptrend. The Stochastic is in the overbought region, but the MACD histogram is not specified, which slightly reduces confidence. The proximity to the Fib 0.618 level also supports a potential bounce upwards.",
    "entryPrice": 118154.99,
    "result": "PENDING",
    "checkAt": 1752916531666,
    "signalTime": "19/07/2025 10:10:31",
    "checkTime": "19/07/2025 10:15:31"
  },
  {
    "timestamp": 1752916291656,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is moderately bullish at 57.35, suggesting room for upward movement. The doji candle pattern indicates indecision, but the price has pulled back to the EMA50, which often acts as support in an uptrend. The stochastic is in the overbought region, which could signal a potential reversal, but given the trend and other indicators, the likelihood of a short-term upward movement is higher. The proximity to the Fib 0.618 level adds to the potential for a bounce.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916591656,
    "signalTime": "19/07/2025 10:11:31",
    "checkTime": "19/07/2025 10:16:31"
  },
  {
    "timestamp": 1752916352335,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below overbought levels, suggesting room for upward movement. The price has pulled back to a significant support level at EMA50, which often acts as a buying opportunity in an uptrend. The stochastic is in the overbought region, but the %K is above %D, indicating potential for continued upward momentum. The presence of a doji suggests indecision, but given the overall bullish context, the bias is slightly towards an upward move.",
    "entryPrice": 118153.99,
    "result": "PENDING",
    "checkAt": 1752916652335,
    "signalTime": "19/07/2025 10:12:32",
    "checkTime": "19/07/2025 10:17:32"
  },
  {
    "timestamp": 1752916530660,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 > EMA200. The RSI is above 50, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. The Stochastic %K is above %D, indicating potential upward momentum. The proximity to the Fib 0.618 level could also act as a support zone. Despite the lack of a specific candle pattern, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916830660,
    "signalTime": "19/07/2025 10:15:30",
    "checkTime": "19/07/2025 10:20:30"
  },
  {
    "timestamp": 1752916592765,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 50, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. Although the doji candle pattern indicates indecision, the stochastic is above 70, supporting a continuation of the upward trend. The proximity to the Fib 0.618 level suggests a potential bounce. The confluence of these factors supports an upward move despite the doji pattern.",
    "entryPrice": 118141.98,
    "result": "PENDING",
    "checkAt": 1752916892765,
    "signalTime": "19/07/2025 10:16:32",
    "checkTime": "19/07/2025 10:21:32"
  },
  {
    "timestamp": 1752916652540,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is below overbought levels, suggesting room for upward movement. The stochastic is overbought, but the price action shows a pullback to EMA50, which often acts as support in an uptrend. The presence of a doji indicates indecision, but in the context of an uptrend, it can suggest a continuation. The proximity to the Fib 0.618 level adds a potential support confluence. Despite the doji, the overall confluence supports a short-term upward move.",
    "entryPrice": 118164.62,
    "result": "PENDING",
    "checkAt": 1752916952540,
    "signalTime": "19/07/2025 10:17:32",
    "checkTime": "19/07/2025 10:22:32"
  },
  {
    "timestamp": 1752916892233,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. The price has pulled back to the EMA50, which often acts as support in an uptrend. The stochastic is in a neutral position but slightly favoring upward movement. The proximity to the Fib 0.618 level adds potential support. Despite the lack of a specific candle pattern, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118182.69,
    "result": "PENDING",
    "checkAt": 1752917192233,
    "signalTime": "19/07/2025 10:21:32",
    "checkTime": "19/07/2025 10:26:32"
  },
  {
    "timestamp": 1752917012025,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA50 above EMA200. RSI is above 60, indicating bullish momentum. The price has pulled back to EMA50, which often acts as support in an uptrend. Stochastic is not overbought, suggesting room for upward movement. The proximity to the Fibonacci 0.618 level adds confluence for a potential bounce. Overall, the setup favors an upward move.",
    "entryPrice": 118176,
    "result": "PENDING",
    "checkAt": 1752917312025,
    "signalTime": "19/07/2025 10:23:32",
    "checkTime": "19/07/2025 10:28:32"
  },
  {
    "timestamp": 1752917132674,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting there is still room for upward movement. The doji candle pattern indicates indecision, but the price action shows a pullback to the EMA50, which often acts as support in an uptrend. The stochastic is overbought, which could signal a potential reversal, but given the trend and support at EMA50, the likelihood of continuation is higher. The proximity to the Fib 0.618 level adds to the bullish confluence.",
    "entryPrice": 118197.03,
    "result": "PENDING",
    "checkAt": 1752917432674,
    "signalTime": "19/07/2025 10:25:32",
    "checkTime": "19/07/2025 10:30:32"
  },
  {
    "timestamp": 1752917252469,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting room for upward movement. The doji candle pattern and the pullback to EMA50 indicate potential reversal or continuation of the trend. The stochastic is extremely high, which could indicate overbought conditions, but given the trend and other factors, an upward move is more likely. The proximity to the 0.618 Fib level adds support to the bullish bias.",
    "entryPrice": 118197.3,
    "result": "PENDING",
    "checkAt": 1752917552469,
    "signalTime": "19/07/2025 10:27:32",
    "checkTime": "19/07/2025 10:32:32"
  },
  {
    "timestamp": 1752917433271,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is above 60, suggesting bullish strength. The pullback to EMA50 with a volume spike on the reversal candle indicates potential continuation of the uptrend. The stochastic is not in overbought territory, and the price is near the Fib 0.618 level, which often acts as a support in an uptrend. Despite the doji pattern indicating indecision, the confluence of other indicators supports an upward move.",
    "entryPrice": 118214.41,
    "result": "PENDING",
    "checkAt": 1752917733271,
    "signalTime": "19/07/2025 10:30:33",
    "checkTime": "19/07/2025 10:35:33"
  },
  {
    "timestamp": 1752917735112,
    "signal": "UP",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is above 60, suggesting bullish momentum. Although a Doji candle indicates indecision, the price has pulled back to the EMA50, which often acts as a support in an uptrend. The stochastic %K is above %D and near the overbought zone, indicating potential continuation of the upward move. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Therefore, the setup favors an upward move.",
    "entryPrice": 118228.89,
    "result": "PENDING",
    "checkAt": 1752918035112,
    "signalTime": "19/07/2025 10:35:35",
    "checkTime": "19/07/2025 10:40:35"
  },
  {
    "timestamp": 1752917791999,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Doji candle and the RSI being close to overbought levels suggest potential short-term bearishness. The Stochastic indicator is also in the overbought region, indicating a possible pullback. The price touching the EMA50 and being near the Fib 0.618 level further supports a short-term retracement.",
    "entryPrice": 118243.49,
    "result": "PENDING",
    "checkAt": 1752918091999,
    "signalTime": "19/07/2025 10:36:31",
    "checkTime": "19/07/2025 10:41:31"
  },
  {
    "timestamp": 1752917972787,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought, and the Stochastic is extremely high, indicating potential for a short-term pullback. The price action touching the EMA50 suggests a possible resistance level. The proximity to the Fib 0.618 level also suggests a potential reversal point.",
    "entryPrice": 118289.42,
    "result": "PENDING",
    "checkAt": 1752918272787,
    "signalTime": "19/07/2025 10:39:32",
    "checkTime": "19/07/2025 10:44:32"
  },
  {
    "timestamp": 1752918032602,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 65,
    "reason": "Despite the overall uptrend indicated by EMA50 > EMA200, the RSI is overbought at 72.23, suggesting a potential short-term reversal. The price has pulled back to touch EMA50, which can act as resistance in the short term. Additionally, the stochastic %K is below %D, indicating potential bearish momentum. The proximity to the Fib 0.618 level also suggests a possible retracement. Therefore, a short-term downward movement is anticipated.",
    "entryPrice": 118276.97,
    "result": "PENDING",
    "checkAt": 1752918332602,
    "signalTime": "19/07/2025 10:40:32",
    "checkTime": "19/07/2025 10:45:32"
  },
  {
    "timestamp": 1752918212020,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought, the stochastic is extremely overbought, and the presence of a doji with a volume spike on a reversal candle suggests a potential short-term pullback. The price action touching the EMA50 and being near the Fib 0.618 level further supports a temporary downward move.",
    "entryPrice": 118297.72,
    "result": "PENDING",
    "checkAt": 1752918512020,
    "signalTime": "19/07/2025 10:43:32",
    "checkTime": "19/07/2025 10:48:32"
  },
  {
    "timestamp": 1752918392385,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 85,
    "reason": "The overall trend is down with EMA50 below EMA200. RSI and Stochastic are both overbought, suggesting a potential reversal. The Doji candle pattern at the EMA50 pullback indicates indecision but aligns with a continuation of the downtrend. The proximity to the Fib 0.618 level adds to the likelihood of a downward move.",
    "entryPrice": 118305.18,
    "result": "PENDING",
    "checkAt": 1752918692385,
    "signalTime": "19/07/2025 10:46:32",
    "checkTime": "19/07/2025 10:51:32"
  },
  {
    "timestamp": 1752918451886,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 85,
    "reason": "The overall trend is down, indicated by EMA50 being below EMA200. RSI is overbought at 77.29, suggesting a potential reversal. The stochastic is also extremely overbought, reinforcing the likelihood of a downward move. The doji candle pattern and price touching EMA50 suggest indecision but within a downtrend context. The proximity to the Fib 0.618 level may provide resistance. All these factors point to a continuation of the downtrend.",
    "entryPrice": 118305.18,
    "result": "PENDING",
    "checkAt": 1752918751886,
    "signalTime": "19/07/2025 10:47:31",
    "checkTime": "19/07/2025 10:52:31"
  },
  {
    "timestamp": 1752918754597,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the trend. The Stochastic %K is at 0, indicating oversold conditions, but with the %D still above 0, it does not strongly suggest a reversal. The proximity to the Fib 0.618 level adds some support, but the overall confluence points to a continuation of the downtrend.",
    "entryPrice": 118243.04,
    "result": "PENDING",
    "checkAt": 1752919054597,
    "signalTime": "19/07/2025 10:52:34",
    "checkTime": "19/07/2025 10:57:34"
  },
  {
    "timestamp": 1752918812219,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Stochastic is near oversold levels but not yet indicating a reversal. The MACD histogram is not provided, but the other indicators suggest continuation of the downtrend.",
    "entryPrice": 118220.02,
    "result": "PENDING",
    "checkAt": 1752919112219,
    "signalTime": "19/07/2025 10:53:32",
    "checkTime": "19/07/2025 10:58:32"
  },
  {
    "timestamp": 1752919052916,
    "signal": "DOWN",
    "symbol": "BTCUSDT",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The stochastic is in the oversold region but not yet showing a clear reversal signal. The presence of a Doji indicates indecision, but given the downtrend and other indicators, the likelihood of continuation downwards is higher.",
    "entryPrice": 118216.92,
    "result": "PENDING",
    "checkAt": 1752919352916,
    "signalTime": "19/07/2025 10:57:32",
    "checkTime": "19/07/2025 11:02:32"
  },
  {
    "timestamp": 1752919172638,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The Stochastic is below 50, indicating bearish momentum, and the MACD histogram is not provided, but the confluence of other indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118244.3,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 10:59:32",
    "checkAt": 1752919472638,
    "checkTime": "19/07/2025 11:04:32"
  },
  {
    "timestamp": 1752919292557,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 52.09, and the presence of a Doji suggests indecision, but the price action shows a pullback to the EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the Stochastic indicates a potential continuation of the downtrend. The proximity to the 0.618 Fib level could provide resistance, supporting a downward move.",
    "priceAtSignal": 118253.17,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:01:32",
    "checkAt": 1752919592557,
    "checkTime": "19/07/2025 11:06:32"
  },
  {
    "timestamp": 1752919717511,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is below 50, suggesting potential for upward movement. The doji candle pattern and pullback to EMA50 indicate indecision but potential support. Stochastic is oversold, suggesting a possible upward reversal. The price is near the Fib 0.618 level, which often acts as a strong support. These factors together suggest a likely upward movement.",
    "priceAtSignal": 118202.68,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:08:37",
    "checkAt": 1752920017511,
    "checkTime": "19/07/2025 11:13:37"
  },
  {
    "timestamp": 1752919893428,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The price has pulled back to the EMA50, which often acts as support in an uptrend. The RSI is neutral, not indicating overbought or oversold conditions, and the stochastic is rising, suggesting potential upward momentum. The presence of a Doji candle indicates indecision, but in the context of an uptrend, it could signal a continuation. The proximity to the Fib 0.618 level, a common retracement level, adds to the potential for a bounce. These factors combined suggest a higher probability of the price moving up in the next 5 minutes.",
    "priceAtSignal": 118225.44,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:11:33",
    "checkAt": 1752920193428,
    "checkTime": "19/07/2025 11:16:33"
  },
  {
    "timestamp": 1752920133328,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions, and the price is pulling back to a key moving average (EMA50), which often acts as support in an uptrend. The stochastic is in a neutral zone but slightly rising, and the price is near the Fibonacci 0.618 level, which is a common retracement level for continuation. These factors suggest a higher probability of price moving up in the next 5 minutes.",
    "priceAtSignal": 118225.46,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:15:33",
    "checkAt": 1752920433328,
    "checkTime": "19/07/2025 11:20:33"
  },
  {
    "timestamp": 1752920192313,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The overall trend is up, indicated by EMA50 being above EMA200. The price has pulled back to touch EMA50, which often acts as support in an uptrend. Although the RSI is neutral and the stochastic is not in an overbought or oversold condition, the proximity to the Fibonacci 0.618 level suggests a potential continuation of the uptrend. The doji candle pattern indicates indecision, but given the trend and support factors, an upward move is more likely.",
    "priceAtSignal": 118225.45,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:16:32",
    "checkAt": 1752920492313,
    "checkTime": "19/07/2025 11:21:32"
  },
  {
    "timestamp": 1752920434497,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Shooting Star candle pattern at a key resistance level (Fib 0.618) suggests a potential reversal. The RSI is neutral, and the Stochastic is in overbought territory, indicating a possible short-term pullback. The price touching EMA50 further supports a temporary downward movement.",
    "priceAtSignal": 118254.25,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:20:34",
    "checkAt": 1752920734497,
    "checkTime": "19/07/2025 11:25:34"
  },
  {
    "timestamp": 1752920552681,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the presence of a Doji candle pattern and the RSI being near overbought levels suggest potential short-term exhaustion. The Stochastic indicator is also in the overbought zone, indicating a possible pullback. The price touching EMA50 and being near the Fib 0.618 level adds to the likelihood of a short-term reversal.",
    "priceAtSignal": 118289.42,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:22:32",
    "checkAt": 1752920852681,
    "checkTime": "19/07/2025 11:27:32"
  },
  {
    "timestamp": 1752920672860,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up with EMA50 above EMA200, indicating bullish momentum. RSI is above 50, suggesting bullish strength. The price has pulled back to EMA50, a potential support level, and the stochastic is in the overbought region, which could indicate a continuation of the trend. The proximity to the Fibonacci 0.618 level adds confluence for a potential bounce. However, the lack of a candle pattern and normal volume slightly reduce confidence.",
    "priceAtSignal": 118290.24,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:24:32",
    "checkAt": 1752920972860,
    "checkTime": "19/07/2025 11:29:32"
  },
  {
    "timestamp": 1752920854367,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA50 being above EMA200. The RSI is below the overbought level, suggesting there is still room for upward movement. The price has pulled back to the EMA50, which often acts as support in an uptrend. Stochastic %K is above %D, indicating bullish momentum. The proximity to the Fib 0.618 level adds additional support for a potential bounce. Overall, the confluences suggest a higher probability of price moving up in the next 5 minutes.",
    "priceAtSignal": 118316.59,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:27:34",
    "checkAt": 1752921154367,
    "checkTime": "19/07/2025 11:32:34"
  },
  {
    "timestamp": 1752920912833,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is close to overbought but not extreme, suggesting continued upward momentum. The stochastic is extremely high, indicating potential overbought conditions, but this can also signal strong upward momentum in trending markets. The doji candle pattern and pullback to EMA50 suggest a potential reversal, but given the trend and the proximity to the Fibonacci 0.618 level, the bias remains upward.",
    "priceAtSignal": 118316.59,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:28:32",
    "checkAt": 1752921212833,
    "checkTime": "19/07/2025 11:33:32"
  },
  {
    "timestamp": 1752921092282,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels, the stochastic is extremely overbought, and the doji candle pattern at a key Fib level suggests potential reversal or consolidation. The pullback to EMA50 adds to the likelihood of a short-term downward move.",
    "priceAtSignal": 118327.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:31:32",
    "checkAt": 1752921392282,
    "checkTime": "19/07/2025 11:36:32"
  },
  {
    "timestamp": 1752921214006,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels, and the stochastic indicators are extremely high, suggesting a potential short-term pullback. The price touching EMA50 could indicate a temporary resistance, especially near the Fib 0.618 level.",
    "priceAtSignal": 118328,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:33:34",
    "checkAt": 1752921514006,
    "checkTime": "19/07/2025 11:38:34"
  },
  {
    "timestamp": 1752921393467,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is near overbought levels and the stochastic indicators are extremely high, suggesting a potential short-term reversal. The doji candle pattern and the pullback to EMA50 further indicate indecision and potential for a downward move. The proximity to the Fib 0.618 level also suggests a possible retracement.",
    "priceAtSignal": 118327.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:36:33",
    "checkAt": 1752921693467,
    "checkTime": "19/07/2025 11:41:33"
  },
  {
    "timestamp": 1752921514623,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200, and the RSI is above 60, suggesting bullish momentum. The pullback to EMA50 could be a buying opportunity. Although the Doji candle indicates indecision, the stochastic is in the overbought region, which could suggest a continuation of the trend. The proximity to the Fibonacci 0.618 level adds to the confluence for a potential upward move.",
    "priceAtSignal": 118319.85,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:38:34",
    "checkAt": 1752921814623,
    "checkTime": "19/07/2025 11:43:34"
  },
  {
    "timestamp": 1752921812706,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought and the Stochastic is extremely high, indicating potential for a short-term pullback. The price action touching the EMA50 suggests a possible temporary correction. The proximity to the Fib 0.618 level may also act as a resistance in the short term.",
    "priceAtSignal": 118450.67,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:43:32",
    "checkAt": 1752922112706,
    "checkTime": "19/07/2025 11:48:32"
  },
  {
    "timestamp": 1752921880074,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend (EMA50 > EMA200), the RSI is overbought at 77.12, indicating potential for a short-term pullback. The doji candle pattern suggests indecision, and the price has just touched the EMA50, which could act as resistance. The stochastic is also in the overbought region, supporting a potential short-term downward move. The proximity to the Fib 0.618 level adds to the likelihood of a pullback.",
    "priceAtSignal": 118450.66,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:44:40",
    "checkAt": 1752922180074,
    "checkTime": "19/07/2025 11:49:40"
  },
  {
    "timestamp": 1752921933600,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought at 77.96, indicating a potential short-term reversal. The stochastic %K and %D are also in the overbought region, suggesting a possible pullback. The price action touching the EMA50 further supports a temporary retracement. The proximity to the Fib 0.618 level adds to the likelihood of a pullback. Hence, a short-term DOWN trade is suggested.",
    "priceAtSignal": 118458,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:45:33",
    "checkAt": 1752922233600,
    "checkTime": "19/07/2025 11:50:33"
  },
  {
    "timestamp": 1752922293960,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is neutral, suggesting no overbought or oversold conditions. The price has pulled back to the EMA50, which often acts as a support in an uptrend. The Stochastic is near oversold levels, indicating potential upward momentum. The proximity to the Fib 0.618 level adds confluence for a potential bounce. However, the lack of a strong candle pattern and normal volume slightly reduce confidence.",
    "priceAtSignal": 118381.87,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 11:51:33",
    "checkAt": 1752922593960,
    "checkTime": "19/07/2025 11:56:33"
  },
  {
    "timestamp": 1752922952696,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA50 being above EMA200. The RSI is in bullish territory, and the stochastic is overbought, suggesting strong upward momentum. The pullback to EMA50 could be a buying opportunity in an uptrend. The presence of a doji indicates indecision, but given the trend and other indicators, the likelihood of continuation upwards is higher.",
    "priceAtSignal": 118452.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:02:32",
    "checkAt": 1752923252696,
    "checkTime": "19/07/2025 12:07:32"
  },
  {
    "timestamp": 1752923132636,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "Despite the overall uptrend, the RSI is overbought at 70.19, the stochastic is extremely overbought, and a doji candle pattern suggests indecision. The price has pulled back to the EMA50, indicating potential short-term resistance. These factors suggest a possible short-term correction.",
    "priceAtSignal": 118479.18,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:05:32",
    "checkAt": 1752923432636,
    "checkTime": "19/07/2025 12:10:32"
  },
  {
    "timestamp": 1752923254087,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting potential overbought conditions. The stochastic is also in the overbought region, which aligns with a potential downward move. The doji candle pattern and normal volume suggest indecision, but given the trend and indicators, a continuation downward is more likely.",
    "priceAtSignal": 118472.81,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:07:34",
    "checkAt": 1752923554087,
    "checkTime": "19/07/2025 12:12:34"
  },
  {
    "timestamp": 1752923434934,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The price has pulled back to touch EMA50, which often acts as resistance in a downtrend. The Doji candle pattern suggests indecision, but in the context of a downtrend, it may indicate a continuation lower. The Stochastic is not in overbought territory, and the MACD histogram is not provided, but the general setup supports a continuation of the downtrend. The proximity to the Fib 0.618 level adds a potential resistance point, reinforcing the likelihood of a downward move.",
    "priceAtSignal": 118421.34,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:10:34",
    "checkAt": 1752923734934,
    "checkTime": "19/07/2025 12:15:34"
  },
  {
    "timestamp": 1752923672900,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is near the oversold level, suggesting potential for further downward movement. The price has touched EMA50, which could act as resistance in a downtrend. Stochastic indicates oversold conditions, but the lack of a strong reversal pattern or significant divergence suggests continuation of the trend. The proximity to the Fib 0.618 level may provide temporary support, but the prevailing trend and indicators suggest a downward bias.",
    "priceAtSignal": 118302.85,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:14:32",
    "checkAt": 1752923972900,
    "checkTime": "19/07/2025 12:19:32"
  },
  {
    "timestamp": 1752923912318,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "The RSI is in the oversold territory, indicating a potential reversal. The price action shows a pullback to the EMA50, which can act as support. The Stochastic is also in the oversold region, suggesting a possible upward movement. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "priceAtSignal": 118208.1,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:18:32",
    "checkAt": 1752924212318,
    "checkTime": "19/07/2025 12:23:32"
  },
  {
    "timestamp": 1752924273902,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting no strong overbought condition. The stochastic is extremely high, indicating potential overbought conditions, which aligns with a potential continuation of the downtrend. The doji candle pattern near the EMA50 suggests indecision but within a downtrend context, it may signal a continuation of the trend. The price action touching EMA50 and near the Fib 0.618 level could act as resistance. These factors combined suggest a higher probability of price moving down.",
    "priceAtSignal": 118429.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:24:33",
    "checkAt": 1752924573902,
    "checkTime": "19/07/2025 12:29:33"
  },
  {
    "timestamp": 1752924395255,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below the overbought level, suggesting there is room for further downside. The Stochastic is extremely overbought, indicating a potential reversal or continuation of the downtrend. The price touching EMA50 during a downtrend often acts as a resistance level, supporting a downward move. The presence near the Fib 0.618 level adds to the potential for a continuation of the downtrend. However, the lack of a clear candle pattern reduces confidence slightly.",
    "priceAtSignal": 118432.73,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:26:35",
    "checkAt": 1752924695255,
    "checkTime": "19/07/2025 12:31:35"
  },
  {
    "timestamp": 1752924453733,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is relatively high at 59.2, suggesting potential overbought conditions. The stochastic is also in the overbought region, with %K and %D both above 95. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Despite the lack of a candle pattern and normal volume, the confluence of these indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118435.68,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:27:33",
    "checkAt": 1752924753733,
    "checkTime": "19/07/2025 12:32:33"
  },
  {
    "timestamp": 1752924573106,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 < EMA200. The RSI is relatively high, suggesting potential overbought conditions. The stochastic is also at a high level, indicating overbought conditions. The doji candle pattern and pullback to EMA50 suggest potential continuation of the downtrend. The presence near the Fib 0.618 level could act as resistance. These factors align for a short-term bearish outlook.",
    "priceAtSignal": 118459.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:29:33",
    "checkAt": 1752924873106,
    "checkTime": "19/07/2025 12:34:33"
  },
  {
    "timestamp": 1752924693140,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 60, suggesting no overbought conditions. The stochastic %K is high, indicating potential overbought conditions, but the trend and pullback to EMA50 suggest a continuation downward. The price action touching EMA50 in a downtrend often signals a continuation of the trend. The MACD histogram is not provided, but the other indicators suggest a downtrend continuation. The proximity to the Fib 0.618 level could provide resistance, supporting a downward move.",
    "priceAtSignal": 118453.89,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:31:33",
    "checkAt": 1752924993140,
    "checkTime": "19/07/2025 12:36:33"
  },
  {
    "timestamp": 1752924812994,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, but the presence of a Doji suggests indecision, which could lead to continuation of the current trend. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is overbought, indicating potential for a downward move. The proximity to the Fib 0.618 level adds confluence to a potential reversal. Overall, the confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "priceAtSignal": 118429.1,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:33:32",
    "checkAt": 1752925112994,
    "checkTime": "19/07/2025 12:38:32"
  },
  {
    "timestamp": 1752924993281,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral but not overbought, suggesting room for further downside. The doji candle pattern indicates indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the stochastic is near overbought levels, which could lead to a downward move. The proximity to the Fib 0.618 level suggests a potential reversal point, but the trend and other indicators favor a downward move.",
    "priceAtSignal": 118433.89,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:36:33",
    "checkAt": 1752925293281,
    "checkTime": "19/07/2025 12:41:33"
  },
  {
    "timestamp": 1752925052909,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, and the doji candle suggests indecision, but the price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The stochastic is not in an overbought or oversold condition, and the MACD histogram is not provided, but the proximity to the Fib 0.618 level suggests a potential continuation of the downtrend. Thus, the confluence of these factors leans towards a continuation of the downtrend.",
    "priceAtSignal": 118433.89,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:37:32",
    "checkAt": 1752925352909,
    "checkTime": "19/07/2025 12:42:32"
  },
  {
    "timestamp": 1752925295685,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. Despite the RSI being neutral and the stochastic showing potential overbought conditions, the price action touching EMA50 suggests a continuation of the downtrend. The MACD histogram is not specified, but given the other indicators, a short-term down move is more likely.",
    "priceAtSignal": 118447.99,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:41:35",
    "checkAt": 1752925595685,
    "checkTime": "19/07/2025 12:46:35"
  },
  {
    "timestamp": 1752925355026,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral at 51.55, not indicating overbought or oversold conditions. The presence of a Doji suggests indecision, but the price action shows a pullback touching EMA50, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the stochastic %K is below %D, indicating potential bearish momentum. The proximity to the Fib 0.618 level could provide resistance, supporting a continuation of the downtrend.",
    "priceAtSignal": 118424.1,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:42:35",
    "checkAt": 1752925655026,
    "checkTime": "19/07/2025 12:47:35"
  },
  {
    "timestamp": 1752925474239,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 70,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is neutral, not indicating overbought or oversold conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D and near the lower range, suggesting potential downward momentum. The proximity to the Fib 0.618 level may provide resistance. These factors suggest a continuation of the downtrend.",
    "priceAtSignal": 118433.72,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:44:34",
    "checkAt": 1752925774239,
    "checkTime": "19/07/2025 12:49:34"
  },
  {
    "timestamp": 1752925893491,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. The Stochastic is oversold, but the %K is below %D, indicating continued bearish pressure. The MACD histogram is not provided, but other indicators suggest a continuation of the downtrend. The proximity to the Fib 0.618 level may provide some support, but the confluence of other indicators supports a DOWN trade.",
    "priceAtSignal": 118332,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:51:33",
    "checkAt": 1752926193491,
    "checkTime": "19/07/2025 12:56:33"
  },
  {
    "timestamp": 1752926014250,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, a common resistance level in a downtrend. The doji candle pattern indicates indecision, but given the downtrend, it may signal a continuation of the bearish move. The stochastic is in oversold territory but not yet showing a clear reversal. The proximity to the Fib 0.618 level could act as resistance. Overall, the confluence suggests a continuation of the downtrend.",
    "priceAtSignal": 118343.73,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:53:34",
    "checkAt": 1752926314250,
    "checkTime": "19/07/2025 12:58:34"
  },
  {
    "timestamp": 1752926133776,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 70,
    "reason": "Despite the overall downtrend indicated by EMA50 < EMA200, the presence of a hammer candle pattern at a pullback to EMA50, combined with a volume spike on the reversal candle, suggests a potential short-term reversal. Additionally, the RSI is near oversold levels and the stochastic is showing signs of bullish divergence near the Fib 0.618 level, supporting a short-term upward movement.",
    "priceAtSignal": 118335.34,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:55:33",
    "checkAt": 1752926433776,
    "checkTime": "19/07/2025 13:00:33"
  },
  {
    "timestamp": 1752926192929,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 65,
    "reason": "The RSI is oversold at 32.41, and the Stochastic %K is at 0, indicating potential upward momentum. The Doji candle suggests indecision, often preceding a reversal, especially near the 0.618 Fib level. Despite the overall downtrend, these factors suggest a short-term upward correction.",
    "priceAtSignal": 118306.75,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:56:32",
    "checkAt": 1752926492929,
    "checkTime": "19/07/2025 13:01:32"
  },
  {
    "timestamp": 1752926373294,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is very low, indicating oversold conditions, but without a clear reversal pattern or strong divergence, the downtrend is likely to continue. The MACD histogram is not specified, but the confluence of other indicators suggests a continuation of the downtrend.",
    "priceAtSignal": 118327.06,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 12:59:33",
    "checkAt": 1752926673294,
    "checkTime": "19/07/2025 13:04:33"
  },
  {
    "timestamp": 1752926554293,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The Doji candle pattern indicates indecision, but given the downtrend, it might signal continuation rather than reversal. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. The Stochastic is not in oversold territory, allowing room for further downside. The proximity to the Fib 0.618 level could provide resistance. These factors suggest a higher probability of the price moving down in the next 5 minutes.",
    "priceAtSignal": 118327.05,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 13:02:34",
    "checkAt": 1752926854293,
    "checkTime": "19/07/2025 13:07:34"
  },
  {
    "timestamp": 1752926675457,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA50 being below EMA200. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching the EMA50, which often acts as resistance in a downtrend. The Stochastic %K is below %D, indicating potential continuation of the downtrend. Although the price is near the Fib 0.618 level, which can act as support, the lack of strong bullish signals and the prevailing downtrend suggest a higher probability of the price moving lower in the next 5 minutes.",
    "priceAtSignal": 118326.42,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 13:04:35",
    "checkAt": 1752926975457,
    "checkTime": "19/07/2025 13:09:35"
  },
  {
    "timestamp": 1752927153185,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200, indicating bearish momentum. RSI is below 50, suggesting bearish conditions. The price action shows a pullback to EMA50, which often acts as resistance in a downtrend. Stochastic is neutral but not oversold, and the MACD histogram is not provided, but given the trend, it likely supports bearish momentum. The proximity to the Fib 0.618 level could act as resistance, reinforcing the downtrend. Volume is normal, providing no counter signals.",
    "priceAtSignal": 118261.69,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 13:12:33",
    "checkAt": 1752927453185,
    "checkTime": "19/07/2025 13:17:33"
  },
  {
    "timestamp": 1752927274352,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA50 below EMA200. RSI is near oversold but not yet indicating a reversal. The price has pulled back to the EMA50, which often acts as resistance in a downtrend. Stochastic %K is very low, suggesting potential for further downward movement. The presence near the Fib 0.618 level could provide resistance, reinforcing the downtrend continuation.",
    "priceAtSignal": 118209.22,
    "result": null,
    "confirmedAt": null,
    "signalTime": "19/07/2025 13:14:34",
    "checkAt": 1752927574352,
    "checkTime": "19/07/2025 13:19:34"
  }
]
