[

[
  {
    "timestamp": 1753720514800,
    "signalTime": "28/07/2025, 17:35:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern is present, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20, which often acts as support in an uptrend. Additionally, the stochastic is in the overbought zone, which can indicate strong upward momentum in a fast-moving market. The confluence of these factors suggests a high-probability UP trade.",
    "entryPrice": 3314.845,
    "result": "WRONG",
    "confirmedAt": "17:36:43",
    "endPrice": 3313.245,
    "checkAt": 1753720574800
  },
  {
    "timestamp": 1753720873777,
    "signalTime": "28/07/2025, 17:41:13",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, supported by a bullish engulfing pattern and a pullback to EMA20. RSI is above 50, indicating bullish momentum, and the price is near the Fibonacci 0.618 level, which often acts as support. However, the volume is neutral, slightly reducing confidence.",
    "entryPrice": 3314.15,
    "result": "WRONG",
    "confirmedAt": "17:42:17",
    "endPrice": 3314.115,
    "checkAt": 1753720933777
  },
  {
    "timestamp": 1753721233385,
    "signalTime": "28/07/2025, 17:47:13",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern is present, RSI is below 50, and the price action shows a pullback to EMA20. The stochastic is oversold, but other indicators align for a short trade.",
    "entryPrice": 3313.135,
    "result": "CORRECT",
    "confirmedAt": "17:48:20",
    "endPrice": 3312.65,
    "checkAt": 1753721293385
  },
  {
    "timestamp": 1753721353345,
    "signalTime": "28/07/2025, 17:49:13",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The presence of a hammer candle pattern at a pullback to EMA20, combined with an oversold RSI and stochastic near the bottom, suggests a potential short-term reversal. The trend is down, but these confluences indicate a likely bounce.",
    "entryPrice": 3311.93,
    "result": "CORRECT",
    "confirmedAt": "17:50:23",
    "endPrice": 3312.435,
    "checkAt": 1753721413345
  },
  {
    "timestamp": 1753721483432,
    "signalTime": "28/07/2025, 17:51:23",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, and the price action shows a pullback touching EMA20, indicating potential continuation of the downtrend. RSI is below 50, supporting bearish momentum. The Doji candle pattern suggests indecision, but given the overall trend and confluences, a short-term continuation of the downtrend is likely.",
    "entryPrice": 3312.88,
    "result": "CORRECT",
    "confirmedAt": "17:52:27",
    "endPrice": 3312.42,
    "checkAt": 1753721543432
  },
  {
    "timestamp": 1753721596043,
    "signalTime": "28/07/2025, 17:53:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20, RSI is below 50 indicating bearish momentum, and a bearish engulfing pattern has formed. Price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting the bearish trend. Although volume is neutral, the alignment of these factors suggests a high-probability continuation of the downtrend.",
    "entryPrice": 3312.33,
    "result": "CORRECT",
    "confirmedAt": "17:55:12",
    "endPrice": 3311.635,
    "checkAt": 1753721656043
  },
  {
    "timestamp": 1753721654687,
    "signalTime": "28/07/2025, 17:54:14",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed, and the price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The stochastic is oversold, but the overall confluence of indicators supports a continuation of the downtrend. The MACD histogram is not provided, but the other indicators provide sufficient confirmation for a short-term down trade.",
    "entryPrice": 3311.99,
    "result": "CORRECT",
    "confirmedAt": "17:55:45",
    "endPrice": 3311.72,
    "checkAt": 1753721714687
  },
  {
    "timestamp": 1753721895197,
    "signalTime": "28/07/2025, 17:58:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The current trend is down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The Doji candle pattern suggests indecision but in the context of a downtrend, it can signal continuation. MACD is not providing strong signals, and volume is neutral, which does not contradict the downtrend. Overall, the confluence of a downtrend, EMA resistance, and RSI supports a DOWN trade.",
    "entryPrice": 3312.565,
    "result": "CORRECT",
    "confirmedAt": "17:59:19",
    "endPrice": 3312.325,
    "checkAt": 1753721955197
  },
  {
    "timestamp": 1753721956344,
    "signalTime": "28/07/2025, 17:59:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern has formed, and the price action shows a pullback to EMA20. RSI is below 50, indicating bearish momentum, and the MACD histogram is likely negative. These confluences suggest a high probability for a short trade.",
    "entryPrice": 3312.54,
    "result": "CORRECT",
    "confirmedAt": "18:00:25",
    "endPrice": 3312.08,
    "checkAt": 1753722016344
  },
  {
    "timestamp": 1753722015746,
    "signalTime": "28/07/2025, 18:00:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed near the EMA20, suggesting a continuation of the downtrend. The MACD histogram is not specified, but the overall indicators suggest a strong bearish bias. The price is near the Fibonacci 0.618 level, which can act as resistance in a downtrend.",
    "entryPrice": 3312.225,
    "result": "CORRECT",
    "confirmedAt": "18:02:35",
    "endPrice": 3311.6,
    "checkAt": 1753722075746
  },
  {
    "timestamp": 1753722195444,
    "signalTime": "28/07/2025, 18:03:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. The presence of a Shooting Star candle pattern at the EMA20 suggests a potential reversal back down. The MACD histogram is negative, supporting bearish sentiment. Although volume is neutral, the confluence of these indicators suggests a high-probability short trade.",
    "entryPrice": 3311.175,
    "result": "CORRECT",
    "confirmedAt": "18:05:13",
    "endPrice": 3310.725,
    "checkAt": 1753722255444
  },
  {
    "timestamp": 1753722255281,
    "signalTime": "28/07/2025, 18:04:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20, RSI is oversold but not diverging, MACD histogram is negative, and a bearish engulfing pattern has formed near the EMA20 after a pullback, indicating continuation of the downtrend. The stochastic is also in the oversold region but not showing a strong reversal signal. Volume is neutral, not contradicting the bearish setup.",
    "entryPrice": 3310.54,
    "result": "CORRECT",
    "confirmedAt": "18:06:55",
    "endPrice": 3310.5,
    "checkAt": 1753722315281
  },
  {
    "timestamp": 1753722795768,
    "signalTime": "28/07/2025, 18:13:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and price action shows a pullback to EMA20 which often acts as resistance in a downtrend. Despite no significant volume spike, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 3309.575,
    "result": "WRONG",
    "confirmedAt": "18:14:29",
    "endPrice": 3309.72,
    "checkAt": 1753722855768
  },
  {
    "timestamp": 1753722856258,
    "signalTime": "28/07/2025, 18:14:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and price action shows a pullback touching EMA20, suggesting a continuation of the downtrend. The MACD histogram is negative, supporting bearish sentiment. Despite no volume spike, the confluence of indicators aligns for a high-probability downward move.",
    "entryPrice": 3309.51,
    "result": "WRONG",
    "confirmedAt": "18:16:13",
    "endPrice": 3310.645,
    "checkAt": 1753722916258
  },
  {
    "timestamp": 1753723216049,
    "signalTime": "28/07/2025, 18:20:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align for an upward trade: EMA7 is above EMA20 indicating an uptrend, a bullish engulfing pattern suggests a continuation of the trend, RSI is above 50 supporting bullish momentum, and price action shows a pullback to EMA20 which often acts as support. Additionally, the stochastic is in the overbought region but aligning with the trend, and the price is near the Fibonacci 0.618 level which can act as support in an uptrend.",
    "entryPrice": 3311.805,
    "result": "CORRECT",
    "confirmedAt": "18:29:04",
    "endPrice": 3311.835,
    "checkAt": 1753723276049,
    "confirmedLate": true
  },
  {
    "timestamp": 1753723515887,
    "signalTime": "28/07/2025, 18:25:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20. A bullish engulfing pattern has formed after a pullback to EMA20, indicating potential continuation. RSI is above 50, supporting bullish momentum. Stochastic is overbought, but the overall confluence of indicators suggests a high-probability upward move.",
    "entryPrice": 3312.435,
    "result": "WRONG",
    "confirmedAt": "18:29:04",
    "endPrice": 3311.19,
    "checkAt": 1753723575887,
    "confirmedLate": true
  },
  {
    "timestamp": 1753724595391,
    "signalTime": "28/07/2025, 18:43:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed at the EMA20 resistance, suggesting a continuation of the downtrend. The MACD histogram is negative, supporting bearish momentum. The stochastic is oversold but not yet reversing, and the price is near the 0.618 Fibonacci level, which can act as resistance. Overall, multiple indicators align for a high-probability short trade.",
    "entryPrice": 3309.915,
    "result": "WRONG",
    "confirmedAt": "18:44:18",
    "endPrice": 3310.645,
    "checkAt": 1753724655391,
    "confirmedLate": true
  },
  {
    "timestamp": 1753725134317,
    "signalTime": "28/07/2025, 18:52:14",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern has formed, and the price action shows a pullback to EMA20. RSI is below 50, indicating bearish momentum. The MACD histogram supports a bearish bias. Although volume is neutral, the overall confluence suggests a high-probability downward move.",
    "entryPrice": 3310.425,
    "result": "CORRECT",
    "confirmedAt": "18:53:17",
    "endPrice": 3309.945,
    "checkAt": 1753725194317,
    "confirmedLate": true
  },
  {
    "timestamp": 1753725254734,
    "signalTime": "28/07/2025, 18:54:14",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as EMA7 is below EMA20. The price has pulled back to EMA20, which often acts as resistance in a downtrend. RSI is below 50, indicating bearish momentum. MACD histogram suggests bearish momentum. Stochastic is not oversold, allowing for further downside. Lack of volume spike suggests no strong countertrend move.",
    "entryPrice": 3310.125,
    "result": "WRONG",
    "confirmedAt": "18:55:16",
    "endPrice": 3310.275,
    "checkAt": 1753725314734
  },
  {
    "timestamp": 1753725493865,
    "signalTime": "28/07/2025, 18:58:13",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern has formed, and the price has pulled back to touch EMA20, suggesting a continuation of the downtrend. However, RSI is neutral, and volume is normal, slightly reducing confidence.",
    "entryPrice": 3310.63,
    "result": "WRONG",
    "confirmedAt": "18:59:14",
    "endPrice": 3311.27,
    "checkAt": 1753725553865
  },
  {
    "timestamp": 1753725675771,
    "signalTime": "28/07/2025, 19:01:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, price action shows a pullback to EMA20, and the RSI is above 50 indicating bullish momentum. The stochastic is in the overbought region but still rising, suggesting continued upward pressure. The presence of a doji and neutral volume suggests caution, but overall confluences favor an upward move.",
    "entryPrice": 3311.065,
    "result": "CORRECT",
    "confirmedAt": "19:02:19",
    "endPrice": 3311.095,
    "checkAt": 1753725735771,
    "confirmedLate": true
  },
  {
    "timestamp": 1753725735278,
    "signalTime": "28/07/2025, 19:02:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a hammer candle pattern at the EMA20 pullback suggests a reversal, RSI is above 50 indicating bullish momentum, and the stochastic is in the overbought zone but still rising. The price is near the Fib 0.618 level, which often acts as a support in an uptrend. Despite the neutral volume, these confluences suggest a high probability for an upward move.",
    "entryPrice": 3311.065,
    "result": "CORRECT",
    "confirmedAt": "19:03:17",
    "endPrice": 3311.395,
    "checkAt": 1753725795278,
    "confirmedLate": true
  },
  {
    "timestamp": 1753725975305,
    "signalTime": "28/07/2025, 19:06:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20, a bullish engulfing candle pattern, and a pullback touching EMA20. RSI is above 50, indicating bullish momentum. The MACD histogram is not specified, but other indicators provide strong confluence for an upward move. The price is near the Fibonacci 0.618 level, supporting a continuation of the uptrend.",
    "entryPrice": 3311.21,
    "result": "CORRECT",
    "confirmedAt": "19:07:16",
    "endPrice": 3311.335,
    "checkAt": 1753726035305
  },
  {
    "timestamp": 1753726455782,
    "signalTime": "28/07/2025, 19:14:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and the price has pulled back to EMA20 near the 0.618 Fibonacci level, indicating a potential continuation. However, RSI is neutral and volume is normal, slightly reducing confidence.",
    "entryPrice": 3310.925,
    "result": "CORRECT",
    "confirmedAt": "19:15:20",
    "endPrice": 3311.28,
    "checkAt": 1753726515782,
    "confirmedLate": true
  },
  {
    "timestamp": 1753726575422,
    "signalTime": "28/07/2025, 19:16:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is near bullish territory, and price action shows a pullback to EMA20 near the 0.618 Fibonacci level, indicating potential support. However, the doji candle and neutral volume suggest some caution.",
    "entryPrice": 3311.715,
    "result": "CORRECT",
    "confirmedAt": "19:17:19",
    "endPrice": 3312.395,
    "checkAt": 1753726635422,
    "confirmedLate": true
  },
  {
    "timestamp": 1753726754506,
    "signalTime": "28/07/2025, 19:19:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is high indicating bullish momentum, and price action shows a pullback to EMA20, a potential support level. The stochastic is overbought, but the overall confluence suggests a continuation of the uptrend. The doji candle pattern and neutral volume add some caution, but the alignment of other indicators supports an upward move.",
    "entryPrice": 3312.705,
    "result": "WRONG",
    "confirmedAt": "19:20:17",
    "endPrice": 3312.64,
    "checkAt": 1753726814506,
    "confirmedLate": true
  },
  {
    "timestamp": 1753726814865,
    "signalTime": "28/07/2025, 19:20:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is bullish at 66.72, a hammer candle pattern suggests a reversal from the pullback, and price action touched EMA20, which often acts as support in an uptrend. The stochastic is in the overbought zone but still rising, and the price is near the 0.618 Fibonacci level, which is a strong support in an uptrend. Volume is neutral, not contradicting the setup.",
    "entryPrice": 3312.555,
    "result": "CORRECT",
    "confirmedAt": "19:21:16",
    "endPrice": 3313.33,
    "checkAt": 1753726874865
  },
  {
    "timestamp": 1753726994566,
    "signalTime": "28/07/2025, 19:23:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is strongly up with EMA7 above EMA20, RSI is overbought indicating strong momentum, and price action shows a pullback to EMA20 which is a common support level in uptrends. Stochastic is also overbought, supporting continued upward momentum. The proximity to the Fibonacci 0.618 level adds further confluence for a potential bounce. Despite the neutral volume, the other indicators provide a high-probability setup for an upward move.",
    "entryPrice": 3313.35,
    "result": "WRONG",
    "confirmedAt": "19:24:15",
    "endPrice": 3313.285,
    "checkAt": 1753727054566
  },
  {
    "timestamp": 1753727174163,
    "signalTime": "28/07/2025, 19:26:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is near overbought but still supportive of an uptrend, price action shows a pullback to EMA20 which often acts as support, and the stochastic is in the overbought region indicating strong upward momentum. The proximity to the Fibonacci 0.618 level adds further support for a continuation of the uptrend.",
    "entryPrice": 3313.18,
    "result": "CORRECT",
    "confirmedAt": "19:27:23",
    "endPrice": 3313.47,
    "checkAt": 1753727234163,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727234690,
    "signalTime": "28/07/2025, 19:27:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is near overbought but still bullish, and the price action shows a pullback to EMA20 which often acts as support in an uptrend. The stochastic is also in the overbought region, indicating strong upward momentum. The presence of a Doji suggests indecision, but given the overall bullish confluence, an UP trade is favored.",
    "entryPrice": 3313.27,
    "result": "CORRECT",
    "confirmedAt": "19:28:16",
    "endPrice": 3313.715,
    "checkAt": 1753727294690,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727295295,
    "signalTime": "28/07/2025, 19:28:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. RSI is overbought, indicating strong momentum. The bullish engulfing pattern at the EMA20 pullback suggests a continuation of the uptrend. Stochastic is in the overbought zone, supporting the bullish bias. The price is near the 0.618 Fibonacci level, which often acts as a support in an uptrend. Despite the neutral volume, the confluence of other indicators suggests a high-probability UP trade.",
    "entryPrice": 3313.665,
    "result": "CORRECT",
    "confirmedAt": "19:29:17",
    "endPrice": 3313.86,
    "checkAt": 1753727355295,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727414816,
    "signalTime": "28/07/2025, 19:30:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is overbought indicating strong momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. Stochastic is also in the overbought region, confirming bullish momentum. The proximity to the Fibonacci 0.618 level adds further support to the bullish bias.",
    "entryPrice": 3313.83,
    "result": "WRONG",
    "confirmedAt": "19:31:24",
    "endPrice": 3313.625,
    "checkAt": 1753727474816,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727475212,
    "signalTime": "28/07/2025, 19:31:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. The presence near the 0.618 Fibonacci level adds confluence for a potential bounce. However, the doji candle and neutral volume suggest some caution, hence not a higher confidence level.",
    "entryPrice": 3313.485,
    "result": "CORRECT",
    "confirmedAt": "19:32:17",
    "endPrice": 3313.8,
    "checkAt": 1753727535212,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727534962,
    "signalTime": "28/07/2025, 19:32:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, a hammer pattern suggests a reversal after a pullback to EMA20, and price is near the 0.618 Fibonacci level. MACD supports upward momentum. Volume is neutral, not contradicting the setup.",
    "entryPrice": 3313.64,
    "result": "CORRECT",
    "confirmedAt": "19:33:15",
    "endPrice": 3313.765,
    "checkAt": 1753727594962
  },
  {
    "timestamp": 1753727656064,
    "signalTime": "28/07/2025, 19:34:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is near overbought but supports upward momentum, and price action shows a pullback to EMA20, which often acts as support in an uptrend. The stochastic is also in the overbought region, indicating strong upward momentum. However, the doji candle pattern and neutral volume suggest some caution, hence the confidence is not higher.",
    "entryPrice": 3313.93,
    "result": "CORRECT",
    "confirmedAt": "19:35:19",
    "endPrice": 3314.235,
    "checkAt": 1753727716064,
    "confirmedLate": true
  },
  {
    "timestamp": 1753727714534,
    "signalTime": "28/07/2025, 19:35:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is overbought indicating strong momentum, and the price has pulled back to EMA20, a potential support level. The stochastic is also in the overbought region, supporting the upward momentum. Although there is no volume spike, the confluence of these indicators suggests a high probability of continuation in the upward direction.",
    "entryPrice": 3314.23,
    "result": "CORRECT",
    "confirmedAt": "19:36:18",
    "endPrice": 3314.495,
    "checkAt": 1753727774534,
    "confirmedLate": true
  },
  {
    "timestamp": 1753728015315,
    "signalTime": "28/07/2025, 19:40:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, price action shows a pullback to EMA20 which often acts as support in an uptrend, and the price is near the 0.618 Fibonacci level which is a strong support zone. Although the doji candle suggests indecision, the overall confluence supports an upward move.",
    "entryPrice": 3314.12,
    "result": "CORRECT",
    "confirmedAt": "19:41:17",
    "endPrice": 3314.4,
    "checkAt": 1753728075315
  },
  {
    "timestamp": 1753728136073,
    "signalTime": "28/07/2025, 19:42:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align for an upward move: EMA7 is above EMA20 indicating an uptrend, RSI is overbought suggesting strong upward momentum, a bullish engulfing pattern confirms buying interest, price has pulled back to EMA20 which often acts as support in an uptrend, and the stochastic is in overbought territory indicating strong upward pressure. The proximity to the Fibonacci 0.618 level further supports the bullish bias.",
    "entryPrice": 3315.655,
    "result": "WRONG",
    "confirmedAt": "19:43:20",
    "endPrice": 3315.175,
    "checkAt": 1753728196073,
    "confirmedLate": true
  },
  {
    "timestamp": 1753728194910,
    "signalTime": "28/07/2025, 19:43:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is strongly up with EMA7 above EMA20. RSI is overbought, indicating strong bullish momentum. The price has pulled back to EMA20, which often acts as support in an uptrend. Stochastic is also in the overbought region, supporting the bullish momentum. Although there is no volume spike, the confluence of these indicators suggests a high-probability continuation of the uptrend.",
    "entryPrice": 3315.3,
    "result": "WRONG",
    "confirmedAt": "19:44:27",
    "endPrice": 3314.41,
    "checkAt": 1753728254910,
    "confirmedLate": true
  },
  {
    "timestamp": 1753729519162,
    "signalTime": "28/07/2025, 20:05:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. The RSI is near overbought but still supportive of an upward move. A bullish engulfing pattern has formed, indicating strong buying interest. The price has pulled back to EMA20, which often acts as dynamic support in an uptrend. The MACD histogram is positive, supporting upward momentum. The stochastic is overbought, but this is consistent with strong trends. The price is near the 0.618 Fibonacci level, which often acts as a strong support in an uptrend. Overall, multiple confluences suggest a high-probability upward move.",
    "entryPrice": 3315.665,
    "result": "WRONG",
    "confirmedAt": "20:06:23",
    "endPrice": 3315.615,
    "checkAt": 1753729579162,
    "confirmedLate": true
  },
  {
    "timestamp": 1753729818643,
    "signalTime": "28/07/2025, 20:10:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20, a common support level in an uptrend. The stochastic is overbought but not diverging, and the price is near the 0.618 Fibonacci level, which often acts as a strong support in an uptrend. The doji candle suggests indecision, but the overall confluence leans towards continuation of the uptrend.",
    "entryPrice": 3316.105,
    "result": "CORRECT",
    "confirmedAt": "20:11:23",
    "endPrice": 3316.21,
    "checkAt": 1753729878643,
    "confirmedLate": true
  },
  {
    "timestamp": 1753729995238,
    "signalTime": "28/07/2025, 20:13:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI above 60 indicating bullish momentum, and price action showing a pullback to EMA20 which often acts as support. The presence near the Fibonacci 0.618 level adds confluence. However, the doji candle and neutral volume suggest some caution, hence the confidence is not higher.",
    "entryPrice": 3315.985,
    "result": "WRONG",
    "confirmedAt": "20:14:17",
    "endPrice": 3315.21,
    "checkAt": 1753730055238,
    "confirmedLate": true
  },
  {
    "timestamp": 1753730116365,
    "signalTime": "28/07/2025, 20:15:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20. The price has pulled back to EMA20, forming a hammer candle pattern, which is a bullish reversal signal. The RSI is neutral, but the stochastic is in the oversold region, suggesting a potential upward move. The proximity to the Fib 0.618 level adds support to the bullish bias. However, the volume is neutral, slightly reducing confidence.",
    "entryPrice": 3315.31,
    "result": "WRONG",
    "confirmedAt": "20:16:16",
    "endPrice": 3315.05,
    "checkAt": 1753730176365
  },
  {
    "timestamp": 1753730236533,
    "signalTime": "28/07/2025, 20:17:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, confirmed by a bearish engulfing pattern and RSI below 50. The price has pulled back to EMA20, a common resistance point in a downtrend. MACD is not explicitly bullish, and the stochastic is oversold but not showing a reversal. Despite neutral volume, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 3314.28,
    "result": "CORRECT",
    "confirmedAt": "20:18:19",
    "endPrice": 3313.495,
    "checkAt": 1753730296533,
    "confirmedLate": true
  },
  {
    "timestamp": 1753730295195,
    "signalTime": "28/07/2025, 20:18:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and the price action shows a pullback to EMA20 which often acts as resistance in a downtrend. The presence of a Doji suggests indecision, but given the overall bearish setup, the probability favors a continuation of the downtrend.",
    "entryPrice": 3313.85,
    "result": "CORRECT",
    "confirmedAt": "20:19:18",
    "endPrice": 3313.685,
    "checkAt": 1753730355195,
    "confirmedLate": true
  },
  {
    "timestamp": 1753730416208,
    "signalTime": "28/07/2025, 20:20:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as EMA7 is below EMA20. The RSI is below 50, indicating bearish momentum. The price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The doji candle suggests indecision but in the context of a downtrend, it can precede a continuation. MACD is not strongly bullish, and the stochastic is not in oversold territory, supporting a bearish bias. The setup aligns with multiple bearish confluences.",
    "entryPrice": 3314.025,
    "result": "WRONG",
    "confirmedAt": "20:21:17",
    "endPrice": 3314.265,
    "checkAt": 1753730476208
  },
  {
    "timestamp": 1753730657716,
    "signalTime": "28/07/2025, 20:24:17",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. The price action shows a pullback to EMA20 with a shooting star candle pattern, indicating potential reversal continuation. RSI is below 50, supporting bearish momentum. The MACD histogram is not specified but given the trend and other indicators, the overall setup aligns with a high-probability bearish continuation.",
    "entryPrice": 3314.58,
    "result": "WRONG",
    "confirmedAt": "20:25:22",
    "endPrice": 3314.89,
    "checkAt": 1753730717716,
    "confirmedLate": true
  },
  {
    "timestamp": 1753731140027,
    "signalTime": "28/07/2025, 20:32:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a hammer candle pattern indicating potential reversal after a pullback to EMA20, and the price is near the 0.618 Fibonacci level. Stochastic is overbought but suggests strong momentum. RSI is neutral, and volume is normal, providing moderate confidence for an upward move.",
    "entryPrice": 3315.125,
    "result": "CORRECT",
    "confirmedAt": "20:33:20",
    "endPrice": 3315.36,
    "checkAt": 1753731200027
  },
  {
    "timestamp": 1753731195323,
    "signalTime": "28/07/2025, 20:33:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, price is pulling back to EMA20, and RSI is above 50. Stochastic is overbought, but the overall trend and pullback to support suggest a continuation. Lack of volume spike and no candle pattern slightly reduce confidence.",
    "entryPrice": 3315.315,
    "result": "WRONG",
    "confirmedAt": "20:34:19",
    "endPrice": 3315.315,
    "checkAt": 1753731255323,
    "confirmedLate": true
  },
  {
    "timestamp": 1753731374910,
    "signalTime": "28/07/2025, 20:36:14",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 > EMA20, a bullish engulfing pattern has formed, and the price is pulling back to EMA20 near the 0.618 Fibonacci level. RSI is above 50, indicating bullish momentum. Despite normal volume, the confluence of these factors suggests a high-probability upward move.",
    "entryPrice": 3315.23,
    "result": "CORRECT",
    "confirmedAt": "20:37:17",
    "endPrice": 3316.14,
    "checkAt": 1753731434910,
    "confirmedLate": true
  },
  {
    "timestamp": 1753731558504,
    "signalTime": "28/07/2025, 20:39:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20 near the Fib 0.618 level, suggesting a potential continuation. However, the doji candle and neutral volume indicate some caution.",
    "entryPrice": 3316.055,
    "result": "WRONG",
    "confirmedAt": "20:40:28",
    "endPrice": 3315.46,
    "checkAt": 1753731618504,
    "confirmedLate": true
  },
  {
    "timestamp": 1753732278035,
    "signalTime": "28/07/2025, 20:51:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align: The trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, a bullish engulfing pattern is present, price action shows a pullback to EMA20, and the price is near the Fibonacci 0.618 level, which often acts as a support in an uptrend. The MACD is not specified but the stochastic is in the overbought region, which can support a continuation of the trend in a strong uptrend context.",
    "entryPrice": 3316.86,
    "result": "CORRECT",
    "confirmedAt": "20:52:18",
    "endPrice": 3318.07,
    "checkAt": 1753732338035
  },
  {
    "timestamp": 1753732397468,
    "signalTime": "28/07/2025, 20:53:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align for an upward move: EMA7 is above EMA20 indicating an uptrend, RSI is overbought suggesting strong bullish momentum, a bullish engulfing pattern confirms buying pressure, and the price has pulled back to EMA20 which often acts as support. Additionally, the stochastic is in the overbought zone, reinforcing bullish sentiment. Despite the neutral volume, the overall setup favors an upward trade.",
    "entryPrice": 3318.32,
    "result": "CORRECT",
    "confirmedAt": "20:54:29",
    "endPrice": 3318.455,
    "checkAt": 1753732457468,
    "confirmedLate": true
  },
  {
    "timestamp": 1753732455220,
    "signalTime": "28/07/2025, 20:54:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is overbought indicating strong momentum, a bullish engulfing pattern suggests continuation, and price action shows a pullback to EMA20 with a bounce near the Fibonacci 0.618 level. Stochastic is also in the overbought region, supporting upward momentum.",
    "entryPrice": 3318.345,
    "result": "CORRECT",
    "confirmedAt": "20:55:18",
    "endPrice": 3318.6,
    "checkAt": 1753732515220,
    "confirmedLate": true
  },
  {
    "timestamp": 1753732817361,
    "signalTime": "28/07/2025, 21:00:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, and price action shows a pullback to EMA20, which often acts as support in an uptrend. The RSI is above 50, indicating bullish momentum, and the price is near the Fib 0.618 level, a common retracement zone for continuation. Despite the doji candle suggesting indecision, the overall setup leans towards a continuation of the upward trend.",
    "entryPrice": 3317.255,
    "result": "WRONG",
    "confirmedAt": "21:01:17",
    "endPrice": 3316.99,
    "checkAt": 1753732877361
  },
  {
    "timestamp": 1753733057596,
    "signalTime": "28/07/2025, 21:04:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upward with EMA7 above EMA20, and the price has pulled back to EMA20, which often acts as support in an uptrend. RSI is above 50, indicating bullish momentum. The MACD histogram is positive, supporting the upward trend. Although there is no candle pattern or volume spike, the confluence of these indicators suggests a high-probability upward move.",
    "entryPrice": 3317.39,
    "result": "CORRECT",
    "confirmedAt": "21:05:21",
    "endPrice": 3317.9,
    "checkAt": 1753733117596,
    "confirmedLate": true
  },
  {
    "timestamp": 1753734203625,
    "signalTime": "28/07/2025, 21:23:23",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern has formed, and the price action shows a pullback to EMA20. The RSI is below 50, indicating bearish momentum, and the MACD histogram is negative. Although volume is neutral, the confluence of these factors supports a high-probability short trade.",
    "entryPrice": 3317.365,
    "result": "CORRECT",
    "confirmedAt": "21:24:28",
    "endPrice": 3317.125,
    "checkAt": 1753734263625,
    "confirmedLate": true
  },
  {
    "timestamp": 1753734259244,
    "signalTime": "28/07/2025, 21:24:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern is present, and price action shows a pullback touching EMA20. RSI is below 50, indicating bearish momentum, and the stochastic is oversold, suggesting potential continuation of the downtrend. The MACD histogram is negative, supporting the bearish sentiment. Overall, multiple confluences align for a high-probability DOWN trade.",
    "entryPrice": 3317.165,
    "result": "WRONG",
    "confirmedAt": "21:25:23",
    "endPrice": 3317.255,
    "checkAt": 1753734319244,
    "confirmedLate": true
  },
  {
    "timestamp": 1753734319366,
    "signalTime": "28/07/2025, 21:25:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20. A shooting star pattern indicates potential reversal after a pullback to EMA20. RSI is below 50, suggesting bearish momentum. The MACD histogram is negative, supporting a downward bias. Despite neutral volume, multiple indicators align for a short trade.",
    "entryPrice": 3317.285,
    "result": "CORRECT",
    "confirmedAt": "21:26:23",
    "endPrice": 3317.1,
    "checkAt": 1753734379366,
    "confirmedLate": true
  },
  {
    "timestamp": 1753735639627,
    "signalTime": "28/07/2025, 21:47:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "Multiple confluences align for a bearish signal: EMA7 is below EMA20 indicating a downtrend, RSI is below 50 suggesting bearish momentum, a bearish engulfing candle pattern has formed, and price action shows a pullback touching EMA20. The MACD histogram supports bearish momentum, and the stochastic is in the oversold region, aligning with the trend. Despite the neutral volume, the overall setup favors a short position.",
    "entryPrice": 3316.5,
    "result": "CORRECT",
    "confirmedAt": "21:48:21",
    "endPrice": 3315.95,
    "checkAt": 1753735699627,
    "confirmedLate": true
  },
  {
    "timestamp": 1753735881562,
    "signalTime": "28/07/2025, 21:51:21",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down as EMA7 is below EMA20. RSI is oversold, indicating potential for continuation. The price has pulled back to EMA20, which often acts as resistance in a downtrend. MACD histogram is negative, supporting bearish momentum. Despite the lack of a candle pattern and volume spike, the confluence of these indicators suggests a high-probability short trade.",
    "entryPrice": 3314.51,
    "result": "WRONG",
    "confirmedAt": "21:52:22",
    "endPrice": 3314.68,
    "checkAt": 1753735941562
  },
  {
    "timestamp": 1753740439514,
    "signalTime": "28/07/2025, 23:07:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is oversold, and a shooting star pattern suggests further downside. The price action shows a pullback to EMA20, reinforcing the downtrend. MACD and volume are neutral, but the overall confluence supports a continuation of the downtrend.",
    "entryPrice": 3312.64,
    "result": "WRONG",
    "confirmedAt": "23:08:22",
    "endPrice": 3312.995,
    "checkAt": 1753740499514,
    "confirmedLate": true
  },
  {
    "timestamp": 1753740499000,
    "signalTime": "28/07/2025, 23:08:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20 and RSI is oversold at 26.48, indicating bearish momentum. The price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting the bearish trend. Although the doji pattern suggests indecision, the overall confluence of indicators supports a continuation of the downtrend.",
    "entryPrice": 3312.895,
    "result": "CORRECT",
    "confirmedAt": "23:09:22",
    "endPrice": 3312.495,
    "checkAt": 1753740559000,
    "confirmedLate": true
  },
  {
    "timestamp": 1753740560440,
    "signalTime": "28/07/2025, 23:09:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The RSI is oversold at 25.62 indicating potential upward reversal. The price has pulled back to the EMA20, a common reversal point, and a Doji candle pattern suggests indecision, often preceding a reversal. The stochastic is also in the oversold region, supporting a potential upward move. However, the overall trend is down, so the confidence is moderate.",
    "entryPrice": 3312.715,
    "result": "WRONG",
    "confirmedAt": "23:10:22",
    "endPrice": 3312.43,
    "checkAt": 1753740620440
  },
  {
    "timestamp": 1753741455410,
    "signalTime": "28/07/2025, 23:24:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and the price has pulled back to EMA20, which often acts as support in an uptrend. RSI is above 50, indicating bullish momentum, and the price is near the 0.618 Fibonacci level, which is a strong support zone. Although volume is neutral, other indicators provide a strong confluence for an upward move.",
    "entryPrice": 3314.725,
    "result": "WRONG",
    "confirmedAt": "23:25:18",
    "endPrice": 3314.58,
    "checkAt": 1753741515410,
    "confirmedLate": true
  },
  {
    "timestamp": 1753741576120,
    "signalTime": "28/07/2025, 23:26:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed, suggesting further downside. The price has pulled back to EMA20, a common resistance level in a downtrend. MACD histogram is negative, supporting bearish sentiment. Although volume is neutral, the confluence of other indicators suggests a high-probability short opportunity.",
    "entryPrice": 3313.33,
    "result": "WRONG",
    "confirmedAt": "23:27:16",
    "endPrice": 3313.405,
    "checkAt": 1753741636120
  },
  {
    "timestamp": 1753741635392,
    "signalTime": "28/07/2025, 23:27:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. A bearish engulfing pattern at the EMA20 pullback suggests further downside. RSI is below 50, supporting bearish momentum. The MACD histogram is negative, indicating bearish pressure. Despite neutral volume, multiple indicators align for a high-probability downward move.",
    "entryPrice": 3313.405,
    "result": "WRONG",
    "confirmedAt": "23:28:15",
    "endPrice": 3313.595,
    "checkAt": 1753741695392
  },
  {
    "timestamp": 1753741820122,
    "signalTime": "28/07/2025, 23:30:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and price action shows a pullback touching EMA20 which often acts as resistance in a downtrend. No significant volume spike or bullish candle pattern to suggest a reversal.",
    "entryPrice": 3313.225,
    "result": "WRONG",
    "confirmedAt": "23:31:24",
    "endPrice": 3314.49,
    "checkAt": 1753741880122,
    "confirmedLate": true
  },
  {
    "timestamp": 1753741996211,
    "signalTime": "28/07/2025, 23:33:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upward with EMA7 above EMA20, and price action shows a pullback to EMA20, which often acts as support in an uptrend. The RSI is neutral, but the MACD histogram is slightly positive, indicating potential momentum continuation. The proximity to the Fibonacci 0.618 level adds support confluence. However, the lack of a strong volume spike and neutral RSI slightly reduce confidence.",
    "entryPrice": 3313.955,
    "result": "CORRECT",
    "confirmedAt": "23:34:18",
    "endPrice": 3314.045,
    "checkAt": 1753742056211,
    "confirmedLate": true
  },
  {
    "timestamp": 1753742055699,
    "signalTime": "28/07/2025, 23:34:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20. A bullish engulfing pattern has formed at the EMA20 pullback, indicating potential continuation. RSI is above 50, and the stochastic is in a favorable position. The price is near the Fib 0.618 level, supporting a bullish bias. Although volume is neutral, other indicators provide strong confluence for an upward move.",
    "entryPrice": 3314.33,
    "result": "WRONG",
    "confirmedAt": "23:35:16",
    "endPrice": 3314.035,
    "checkAt": 1753742115699
  },
  {
    "timestamp": 1753742476946,
    "signalTime": "28/07/2025, 23:41:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20. RSI is below 50, indicating bearish momentum. Price action shows a pullback to EMA20, a common resistance point in a downtrend. Stochastic is oversold but not yet reversing, and MACD histogram is not provided, limiting confirmation. Overall, the confluences suggest a continuation of the downtrend.",
    "entryPrice": 3312.375,
    "result": "WRONG",
    "confirmedAt": "23:42:20",
    "endPrice": 3313.015,
    "checkAt": 1753742536946,
    "confirmedLate": true
  },
  {
    "timestamp": 1753742716754,
    "signalTime": "28/07/2025, 23:45:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up as EMA7 is above EMA20, and price action shows a pullback to EMA20, a potential support level. Although the RSI is neutral, the stochastic is in a bullish position, and the MACD histogram is not provided but assumed neutral. The presence of a doji indicates indecision, but the overall confluence suggests a continuation of the uptrend.",
    "entryPrice": 3314.095,
    "result": "CORRECT",
    "confirmedAt": "23:46:27",
    "endPrice": 3314.225,
    "checkAt": 1753742776754,
    "confirmedLate": true
  },
  {
    "timestamp": 1753742836055,
    "signalTime": "28/07/2025, 23:47:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upward with EMA7 above EMA20, and the price has pulled back to EMA20, which can act as support. The RSI is neutral but not overbought, and the stochastic indicates potential upward momentum. The doji pattern suggests indecision but in an uptrend can lead to continuation. The proximity to the Fibonacci 0.618 level adds support to the upward bias.",
    "entryPrice": 3313.96,
    "result": "CORRECT",
    "confirmedAt": "23:48:20",
    "endPrice": 3314.255,
    "checkAt": 1753742896055,
    "confirmedLate": true
  },
  {
    "timestamp": 1753743137066,
    "signalTime": "28/07/2025, 23:52:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 50 indicating bullish momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. Stochastic is overbought but can remain so in strong trends. The proximity to the Fibonacci 0.618 level adds further support. However, the lack of a candle pattern and volume spike reduces confidence slightly.",
    "entryPrice": 3314.93,
    "result": "WRONG",
    "confirmedAt": "23:53:19",
    "endPrice": 3314.18,
    "checkAt": 1753743197066,
    "confirmedLate": true
  },
  {
    "timestamp": 1753743256598,
    "signalTime": "28/07/2025, 23:54:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20. A bullish engulfing pattern has formed at the EMA20 support level, indicating a potential continuation of the uptrend. The RSI is above 50, supporting bullish momentum. The MACD histogram is positive, and the price is near the 0.618 Fibonacci level, which often acts as a strong support in an uptrend. Despite the neutral volume, the confluence of these indicators suggests a high-probability upward move.",
    "entryPrice": 3314.555,
    "result": "WRONG",
    "confirmedAt": "23:55:18",
    "endPrice": 3314.385,
    "checkAt": 1753743316598
  },
  {
    "timestamp": 1753743376771,
    "signalTime": "28/07/2025, 23:56:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The EMA7 is above EMA20 indicating an uptrend, and the price has pulled back to EMA20 which often acts as support in an uptrend. The RSI is neutral but above 50, suggesting potential upward momentum. The MACD histogram is not specified, but the stochastic %K is above %D, indicating potential upward movement. The presence of a Doji candle pattern near the 0.618 Fibonacci level suggests indecision but also a potential reversal to continue the trend. Overall, the confluences suggest a high probability for an upward move.",
    "entryPrice": 3314.285,
    "result": "CORRECT",
    "confirmedAt": "23:57:29",
    "endPrice": 3314.53,
    "checkAt": 1753743436771,
    "confirmedLate": true
  },
  {
    "timestamp": 1753743495873,
    "signalTime": "28/07/2025, 23:58:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, price action shows a pullback to EMA20, and RSI is above 50 indicating bullish momentum. The presence of a Doji suggests indecision, but with the trend and RSI, an upward move is more probable. MACD is not strongly bearish, and the price is near the Fibonacci 0.618 level, supporting a potential bounce.",
    "entryPrice": 3314.64,
    "result": "CORRECT",
    "confirmedAt": "23:59:17",
    "endPrice": 3314.65,
    "checkAt": 1753743555873
  },
  {
    "timestamp": 1753743556235,
    "signalTime": "28/07/2025, 23:59:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, and price action shows a pullback to EMA20. RSI is above 50, indicating bullish momentum. The presence of a Doji suggests indecision, but the overall trend and proximity to the 0.618 Fibonacci level support a continuation of the uptrend. MACD is not providing a clear signal, but the stochastic is in a bullish position. Volume is neutral, not contradicting the trend.",
    "entryPrice": 3314.65,
    "result": "WRONG",
    "confirmedAt": "00:00:24",
    "endPrice": 3314.25,
    "checkAt": 1753743616235,
    "confirmedLate": true
  },
  {
    "timestamp": 1753743796643,
    "signalTime": "29/07/2025, 00:03:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 < EMA20, RSI is below 50 indicating bearish momentum, and the price action shows a pullback to EMA20. The presence of a Doji suggests indecision, but given the overall bearish trend and the proximity to the 0.618 Fib level, the likelihood of continuation downwards is higher.",
    "entryPrice": 3313.25,
    "result": "WRONG",
    "confirmedAt": "00:04:18",
    "endPrice": 3313.265,
    "checkAt": 1753743856643
  },
  {
    "timestamp": 1753743915604,
    "signalTime": "29/07/2025, 00:05:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI below 50 indicating bearish momentum, and price action showing a pullback to EMA20 which often acts as resistance in a downtrend. The MACD histogram is not specified but the overall indicators suggest a continuation of the downtrend. Lack of volume spike and candle pattern slightly reduces confidence.",
    "entryPrice": 3313.285,
    "result": "WRONG",
    "confirmedAt": "00:06:16",
    "endPrice": 3313.49,
    "checkAt": 1753743975604
  },
  {
    "timestamp": 1753744337251,
    "signalTime": "29/07/2025, 00:12:17",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern has formed, and the price action shows a pullback to EMA20. The RSI is below 50, indicating bearish momentum, and the MACD histogram is negative. Although the volume is neutral, the confluence of these factors suggests a high-probability continuation of the downtrend.",
    "entryPrice": 3313.765,
    "result": "WRONG",
    "confirmedAt": "00:13:20",
    "endPrice": 3314.13,
    "checkAt": 1753744397251,
    "confirmedLate": true
  },
  {
    "timestamp": 1753744756207,
    "signalTime": "29/07/2025, 00:19:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed after a pullback to EMA20, suggesting continuation of the downtrend. MACD histogram is negative, supporting bearish sentiment. Although volume is neutral, the confluence of these indicators supports a high-probability short trade.",
    "entryPrice": 3313.55,
    "result": "CORRECT",
    "confirmedAt": "00:20:19",
    "endPrice": 3313.525,
    "checkAt": 1753744816207,
    "confirmedLate": true
  },
  {
    "timestamp": 1753744936214,
    "signalTime": "29/07/2025, 00:22:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. RSI is oversold, but the presence of a shooting star candle pattern near the EMA20 suggests a continuation of the downtrend. The MACD histogram is negative, supporting bearish momentum. Despite the neutral volume, the confluence of these factors indicates a high-probability short trade.",
    "entryPrice": 3312.63,
    "result": "WRONG",
    "confirmedAt": "00:23:17",
    "endPrice": 3312.89,
    "checkAt": 1753744996214
  },
  {
    "timestamp": 1753744996800,
    "signalTime": "29/07/2025, 00:23:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI is oversold but not extremely, and the price action shows a pullback touching EMA20, indicating a potential continuation of the downtrend. The Doji candle pattern suggests indecision, but given the overall trend and confluences, a short-term continuation down is more probable.",
    "entryPrice": 3312.73,
    "result": "CORRECT",
    "confirmedAt": "00:24:21",
    "endPrice": 3312.515,
    "checkAt": 1753745056800,
    "confirmedLate": true
  },
  {
    "timestamp": 1753745056792,
    "signalTime": "29/07/2025, 00:24:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20. RSI is oversold, indicating potential continuation. The price action shows a pullback touching EMA20, which often acts as resistance in a downtrend. The stochastic is in the oversold region, supporting further downside. The doji candle pattern and normal volume suggest caution, but overall confluences favor a downward move.",
    "entryPrice": 3312.7,
    "result": "CORRECT",
    "confirmedAt": "00:25:20",
    "endPrice": 3312.22,
    "checkAt": 1753745116792,
    "confirmedLate": true
  },
  {
    "timestamp": 1753745235812,
    "signalTime": "29/07/2025, 00:27:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is oversold indicating potential continuation, and price action shows a pullback to EMA20. Despite no candle pattern or volume spike, the confluence of trend and RSI supports a high-probability short trade.",
    "entryPrice": 3312.04,
    "result": "WRONG",
    "confirmedAt": "00:28:18",
    "endPrice": 3312.285,
    "checkAt": 1753745295812,
    "confirmedLate": true
  },
  {
    "timestamp": 1753745475672,
    "signalTime": "29/07/2025, 00:31:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20, RSI is oversold indicating potential continuation of the downtrend, and price action shows a pullback to EMA20 which often acts as a resistance in a downtrend. MACD histogram supports bearish momentum. Despite the lack of a volume spike, the overall confluence suggests a high probability for a short trade.",
    "entryPrice": 3311.16,
    "result": "CORRECT",
    "confirmedAt": "00:32:18",
    "endPrice": 3310.815,
    "checkAt": 1753745535672,
    "confirmedLate": true
  },
  {
    "timestamp": 1753745536149,
    "signalTime": "29/07/2025, 00:32:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The RSI is oversold at 21.90, indicating a potential reversal. The hammer candle pattern at the EMA20 suggests a bullish reversal. The stochastic %K is below %D, indicating potential upward momentum. Although the trend is down, the confluence of these factors suggests a short-term upward correction.",
    "entryPrice": 3310.85,
    "result": "CORRECT",
    "confirmedAt": "00:33:16",
    "endPrice": 3311.475,
    "checkAt": 1753745596149
  },
  {
    "timestamp": 1753745716620,
    "signalTime": "29/07/2025, 00:35:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20, supported by a bearish engulfing pattern and price action showing a pullback to EMA20. RSI is below 50, indicating bearish momentum. MACD histogram suggests bearish continuation, and the price is near the 0.618 Fib level, which often acts as resistance in a downtrend. Volume is neutral, not contradicting the bearish setup.",
    "entryPrice": 3311.93,
    "result": "WRONG",
    "confirmedAt": "00:36:20",
    "endPrice": 3312.27,
    "checkAt": 1753745776620,
    "confirmedLate": true
  },
  {
    "timestamp": 1753746318225,
    "signalTime": "29/07/2025, 00:45:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 > EMA20, a hammer candle pattern suggests a reversal after a pullback to EMA20, and the price is near the 0.618 Fibonacci level. RSI is neutral, but the overall confluence supports an upward move.",
    "entryPrice": 3312.6,
    "result": "CORRECT",
    "confirmedAt": "00:46:20",
    "endPrice": 3312.885,
    "checkAt": 1753746378225
  },
  {
    "timestamp": 1753746495722,
    "signalTime": "29/07/2025, 00:48:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is bullish at 66.38, and the price has pulled back to EMA20, which often acts as a support in an uptrend. The stochastic is overbought, which is a concern, but the overall confluence suggests a continuation of the upward trend.",
    "entryPrice": 3314.215,
    "result": "WRONG",
    "confirmedAt": "00:49:18",
    "endPrice": 3313.48,
    "checkAt": 1753746555722,
    "confirmedLate": true
  },
  {
    "timestamp": 1753746615590,
    "signalTime": "29/07/2025, 00:50:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 50 indicating bullish momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. The MACD histogram is not specified but the stochastic %K is above %D, suggesting potential upward momentum. The price is near the Fibonacci 0.618 level, which can act as a strong support in an uptrend.",
    "entryPrice": 3313.485,
    "result": "WRONG",
    "confirmedAt": "00:51:16",
    "endPrice": 3313.21,
    "checkAt": 1753746675590
  },
  {
    "timestamp": 1753747037767,
    "signalTime": "29/07/2025, 00:57:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The setup shows multiple bullish confluences: EMA7 is above EMA20 indicating an uptrend, a bullish engulfing pattern has formed, price action has pulled back to EMA20 providing a potential entry point, and the RSI is above 50 suggesting bullish momentum. The proximity to the Fibonacci 0.618 level adds further support. Despite the neutral volume, the overall indicators suggest a high-probability upward move.",
    "entryPrice": 3313.745,
    "result": "WRONG",
    "confirmedAt": "00:58:20",
    "endPrice": 3313.295,
    "checkAt": 1753747097767,
    "confirmedLate": true
  },
  {
    "timestamp": 1753747336196,
    "signalTime": "29/07/2025, 01:02:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The EMA7 is above EMA20 indicating an uptrend. The RSI is above 50, supporting bullish momentum. A bullish engulfing pattern has formed near the EMA20, suggesting a strong reversal. The price is near the 0.618 Fibonacci level, a common retracement zone for continuation. Although volume is neutral, the other confluences provide a high-probability setup for an upward move.",
    "entryPrice": 3313.78,
    "result": "CORRECT",
    "confirmedAt": "01:03:19",
    "endPrice": 3315.05,
    "checkAt": 1753747396196,
    "confirmedLate": true
  },
  {
    "timestamp": 1753747458933,
    "signalTime": "29/07/2025, 01:04:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The setup shows multiple bullish confluences: EMA7 is above EMA20 indicating an uptrend, RSI is above 60 suggesting bullish momentum, a bullish engulfing pattern has formed, price action has pulled back to EMA20 which often acts as support, and the stochastic is in the overbought zone supporting the continuation of the trend. The MACD histogram is not specified, but the overall indicators suggest a high probability for an upward move.",
    "entryPrice": 3315.53,
    "result": "WRONG",
    "confirmedAt": "01:05:22",
    "endPrice": 3314.035,
    "checkAt": 1753747518933,
    "confirmedLate": true
  },
  {
    "timestamp": 1753747755336,
    "signalTime": "29/07/2025, 01:09:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20, RSI is below 50 indicating bearish momentum, a bearish engulfing pattern has formed, and price action shows a pullback to EMA20. Despite normal volume, these confluences suggest a high-probability continuation of the downtrend.",
    "entryPrice": 3310.465,
    "result": "CORRECT",
    "confirmedAt": "01:10:17",
    "endPrice": 3309.29,
    "checkAt": 1753747815336
  },
  {
    "timestamp": 1753747995740,
    "signalTime": "29/07/2025, 01:13:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, confirmed by a shooting star pattern and RSI below 50. The price action shows a pullback to EMA20, suggesting a continuation of the downtrend. MACD and stochastic indicators also support the bearish sentiment.",
    "entryPrice": 3311.21,
    "result": "CORRECT",
    "confirmedAt": "01:14:20",
    "endPrice": 3310.9,
    "checkAt": 1753748055740,
    "confirmedLate": true
  },
  {
    "timestamp": 1753748175751,
    "signalTime": "29/07/2025, 01:16:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20, and a shooting star pattern indicates potential reversal after a pullback to EMA20. RSI is below 50, supporting bearish momentum. MACD is not strongly bullish, and price is near the 0.618 Fib level, suggesting continuation of the downtrend.",
    "entryPrice": 3312.015,
    "result": "CORRECT",
    "confirmedAt": "01:17:18",
    "endPrice": 3310.795,
    "checkAt": 1753748235751,
    "confirmedLate": true
  },
  {
    "timestamp": 1753748415350,
    "signalTime": "29/07/2025, 01:20:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and price action shows a pullback to EMA20, suggesting a continuation of the downtrend. MACD histogram is negative, supporting bearish sentiment. Despite no volume spike, the confluences align for a high-probability bearish setup.",
    "entryPrice": 3310.04,
    "result": "CORRECT",
    "confirmedAt": "01:21:17",
    "endPrice": 3309.745,
    "checkAt": 1753748475350
  },
  {
    "timestamp": 1753748596376,
    "signalTime": "29/07/2025, 01:23:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down as EMA7 is below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing candle pattern has formed, and the price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting bearish momentum. The stochastic is oversold, but given the strong downtrend and other confluences, a short-term bearish trade is favored.",
    "entryPrice": 3309.27,
    "result": "CORRECT",
    "confirmedAt": "01:24:20",
    "endPrice": 3308.975,
    "checkAt": 1753748656376,
    "confirmedLate": true
  },
  {
    "timestamp": 1753749557022,
    "signalTime": "29/07/2025, 01:39:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20. A bullish engulfing pattern has formed near the EMA20 after a pullback, indicating potential upward momentum. The RSI is above 50, suggesting bullish strength, and the stochastic is in the overbought region, which can support continued upward movement in a strong trend. The price is near the 0.618 Fibonacci level, a common support area in an uptrend. Despite the neutral volume, the confluence of these indicators suggests a high probability for an upward move.",
    "entryPrice": 3311.025,
    "result": "WRONG",
    "confirmedAt": "01:40:20",
    "endPrice": 3309.525,
    "checkAt": 1753749617022,
    "confirmedLate": true
  },
  {
    "timestamp": 1753749615790,
    "signalTime": "29/07/2025, 01:40:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as EMA7 is below EMA20, and a shooting star pattern at the EMA20 suggests a bearish reversal. RSI is below 50, indicating bearish momentum. The MACD histogram is not provided, but the stochastic shows a potential bearish crossover. The price is near the 0.618 Fibonacci level, which can act as resistance. Volume is neutral, not contradicting the bearish setup.",
    "entryPrice": 3309.685,
    "result": "CORRECT",
    "confirmedAt": "01:41:19",
    "endPrice": 3309.56,
    "checkAt": 1753749675790,
    "confirmedLate": true
  },
  {
    "timestamp": 1753749736545,
    "signalTime": "29/07/2025, 01:42:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA7 being below EMA20. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA20, which is often a resistance point in a downtrend. The MACD histogram is negative, supporting bearish continuation. Although the doji candle pattern and neutral volume suggest caution, the confluence of trend indicators supports a DOWN signal.",
    "entryPrice": 3309.26,
    "result": "WRONG",
    "confirmedAt": "01:43:18",
    "endPrice": 3309.48,
    "checkAt": 1753749796545
  },
  {
    "timestamp": 1753749795385,
    "signalTime": "29/07/2025, 01:43:15",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 80,
    "reason": "The trend is down with EMA7 below EMA20, a shooting star pattern indicates bearish reversal, and the price action shows a pullback to EMA20. RSI is below 50, supporting bearish momentum, and MACD is not showing strong divergence. The setup aligns with the downtrend, despite normal volume.",
    "entryPrice": 3309.69,
    "result": "CORRECT",
    "confirmedAt": "01:44:16",
    "endPrice": 3309.605,
    "checkAt": 1753749855385
  },
  {
    "timestamp": 1753749916681,
    "signalTime": "29/07/2025, 01:45:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. The RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed, and the price has pulled back to the EMA20, which often acts as resistance in a downtrend. The stochastic is oversold but not yet signaling a reversal. The MACD histogram is not specified, but given the other indicators, the overall confluence suggests a continuation of the downtrend.",
    "entryPrice": 3308.605,
    "result": "WRONG",
    "confirmedAt": "01:46:20",
    "endPrice": 3309.645,
    "checkAt": 1753749976681,
    "confirmedLate": true
  },
  {
    "timestamp": 1753750156110,
    "signalTime": "29/07/2025, 01:49:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 50 indicating bullish momentum, and the price has pulled back to EMA20, a potential support level. Despite the doji candle suggesting indecision, the overall confluence supports a continuation of the uptrend.",
    "entryPrice": 3311.7,
    "result": "CORRECT",
    "confirmedAt": "01:50:18",
    "endPrice": 3311.885,
    "checkAt": 1753750216110,
    "confirmedLate": true
  },
  {
    "timestamp": 1753750277400,
    "signalTime": "29/07/2025, 01:51:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The fast trend is up with EMA7 above EMA20, and the price has pulled back to EMA20, which often acts as support in an uptrend. RSI is above 60, indicating bullish momentum. The stochastic is in the overbought zone, which could suggest a continuation of the trend. The presence of a doji at the EMA20 could indicate indecision but also a potential reversal back up in line with the trend. The proximity to the 0.618 Fibonacci level adds to the confluence for an upward move.",
    "entryPrice": 3311.97,
    "result": "WRONG",
    "confirmedAt": "01:52:22",
    "endPrice": 3311.345,
    "checkAt": 1753750337400,
    "confirmedLate": true
  },
  {
    "timestamp": 1753750335652,
    "signalTime": "29/07/2025, 01:52:15",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI above 60, a bullish engulfing pattern, and price action showing a pullback to EMA20 near the 0.618 Fibonacci level. The stochastic is overbought, but the overall confluence supports an upward move.",
    "entryPrice": 3311.965,
    "result": "CORRECT",
    "confirmedAt": "01:53:20",
    "endPrice": 3312.305,
    "checkAt": 1753750395652,
    "confirmedLate": true
  },
  {
    "timestamp": 1753750396804,
    "signalTime": "29/07/2025, 01:53:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, RSI is above 60 indicating bullish momentum, and the price has pulled back to the EMA20 which often acts as support in an uptrend. Additionally, the stochastic is in the overbought region, supporting upward momentum. The MACD histogram is not specified, but the other indicators provide strong confluence for an upward move.",
    "entryPrice": 3312,
    "result": "CORRECT",
    "confirmedAt": "01:54:18",
    "endPrice": 3312.055,
    "checkAt": 1753750456804
  },
  {
    "timestamp": 1753750638017,
    "signalTime": "29/07/2025, 01:57:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. A bullish engulfing pattern has formed at the EMA20 support level, indicating a potential continuation of the uptrend. The RSI is below overbought levels, suggesting room for upward movement. The MACD histogram is positive, and the stochastic is in the overbought region, which aligns with the bullish momentum. The price is near the 0.618 Fibonacci level, adding further support to the upward bias. Despite the neutral volume, the confluence of these indicators provides a high-probability setup for an upward move.",
    "entryPrice": 3312.04,
    "result": "WRONG",
    "confirmedAt": "01:58:22",
    "endPrice": 3311.775,
    "checkAt": 1753750698017,
    "confirmedLate": true
  },
  {
    "timestamp": 1753750756243,
    "signalTime": "29/07/2025, 01:59:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 50, and price action shows a pullback to EMA20 with a doji indicating potential reversal. Stochastic is overbought but not diverging. Near Fib 0.618 supports continuation. Volume is neutral, not contradicting the setup.",
    "entryPrice": 3311.815,
    "result": "WRONG",
    "confirmedAt": "02:00:16",
    "endPrice": 3309.705,
    "checkAt": 1753750816243
  },
  {
    "timestamp": 1753750876533,
    "signalTime": "29/07/2025, 02:01:16",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, a bearish engulfing pattern has formed, and the price is near the Fib 0.618 level, suggesting continuation of the downtrend.",
    "entryPrice": 3309.5,
    "result": "WRONG",
    "confirmedAt": "02:02:19",
    "endPrice": 3310.9,
    "checkAt": 1753750936533,
    "confirmedLate": true
  },
  {
    "timestamp": 1753751177432,
    "signalTime": "29/07/2025, 02:06:17",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as indicated by EMA7 below EMA20. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it can signal a continuation. The MACD histogram is not provided, but the stochastic is below 50, supporting a bearish bias. The setup aligns with a high-probability continuation of the downtrend.",
    "entryPrice": 3309.965,
    "result": "WRONG",
    "confirmedAt": "02:07:18",
    "endPrice": 3310.02,
    "checkAt": 1753751237432
  },
  {
    "timestamp": 1753751479830,
    "signalTime": "29/07/2025, 02:11:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, and the price has pulled back to EMA20, a common support level in an uptrend. The RSI is above 50, indicating bullish momentum, and the stochastic is overbought, suggesting potential continuation. The presence of a doji and normal volume suggests caution, but the proximity to the 0.618 Fibonacci level supports an upward move.",
    "entryPrice": 3311.985,
    "result": "WRONG",
    "confirmedAt": "02:12:22",
    "endPrice": 3311.92,
    "checkAt": 1753751539830,
    "confirmedLate": true
  },
  {
    "timestamp": 1753751778182,
    "signalTime": "29/07/2025, 02:16:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20. The price has pulled back to EMA20, which often acts as support in an uptrend. RSI is neutral, not overbought or oversold, suggesting room for upward movement. The MACD histogram is not specified, but the overall setup suggests a continuation of the upward trend. The proximity to the Fibonacci 0.618 level adds a potential support confluence. However, the lack of a volume spike and specific candle pattern slightly reduces confidence.",
    "entryPrice": 3311.72,
    "result": "CORRECT",
    "confirmedAt": "02:17:20",
    "endPrice": 3313.085,
    "checkAt": 1753751838182,
    "confirmedLate": true
  },
  {
    "timestamp": 1753752017281,
    "signalTime": "29/07/2025, 02:20:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align: The trend is up with EMA7 > EMA20, a bullish engulfing pattern has formed, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20, a common support level in an uptrend. Additionally, the stochastic is in the overbought zone, indicating strong upward momentum, and the price is near the Fibonacci 0.618 level, a key retracement zone. The volume is neutral, which does not contradict the bullish setup.",
    "entryPrice": 3313.305,
    "result": "WRONG",
    "confirmedAt": "02:21:19",
    "endPrice": 3312.925,
    "checkAt": 1753752077281,
    "confirmedLate": true
  },
  {
    "timestamp": 1753752076943,
    "signalTime": "29/07/2025, 02:21:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 80,
    "reason": "The trend is upward with EMA7 above EMA20, a bullish hammer pattern at the EMA20 support, RSI is above 50 indicating bullish momentum, and price is near the 0.618 Fibonacci level which often acts as a strong support in an uptrend. MACD is not mentioned but the stochastic is in the overbought zone, suggesting potential continuation of the trend.",
    "entryPrice": 3312.665,
    "result": "WRONG",
    "confirmedAt": "02:22:18",
    "endPrice": 3312.47,
    "checkAt": 1753752136943
  },
  {
    "timestamp": 1753752257236,
    "signalTime": "29/07/2025, 02:24:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is currently up with EMA7 above EMA20, indicating bullish momentum. The RSI is above 50, supporting upward movement. The price has pulled back to EMA20, a common support level in an uptrend. The stochastic is in the overbought region, suggesting strong buying pressure. The presence of a doji candle pattern and neutral volume are minor concerns, but overall confluences favor an upward move.",
    "entryPrice": 3313.14,
    "result": "CORRECT",
    "confirmedAt": "02:25:21",
    "endPrice": 3314.295,
    "checkAt": 1753752317236,
    "confirmedLate": true
  },
  {
    "timestamp": 1753752436428,
    "signalTime": "29/07/2025, 02:27:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align for an upward move: EMA7 is above EMA20 indicating an uptrend, RSI is above 50 suggesting bullish momentum, a bullish engulfing pattern has formed, and the price has pulled back to the EMA20 which often acts as support. Additionally, the price is near the 0.618 Fibonacci level, a common reversal zone. Although volume is neutral, the other indicators provide a strong bullish signal.",
    "entryPrice": 3313.78,
    "result": "WRONG",
    "confirmedAt": "02:28:20",
    "endPrice": 3313.42,
    "checkAt": 1753752496428,
    "confirmedLate": true
  },
  {
    "timestamp": 1753752676422,
    "signalTime": "29/07/2025, 02:31:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20 which often acts as support in an uptrend. Additionally, the stochastic is in the overbought region, supporting continued upward momentum. The MACD histogram is not specified but the confluences present suggest a high-probability upward move.",
    "entryPrice": 3314.91,
    "result": "WRONG",
    "confirmedAt": "02:32:18",
    "endPrice": 3314.685,
    "checkAt": 1753752736422,
    "confirmedLate": true
  },
  {
    "timestamp": 1753752736310,
    "signalTime": "29/07/2025, 02:32:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The fast trend is up with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20, a potential support. Stochastic is overbought but not yet reversing, and the price is near the 0.618 Fib level, suggesting a potential continuation. The doji candle pattern and neutral volume reduce confidence slightly.",
    "entryPrice": 3314.895,
    "result": "CORRECT",
    "confirmedAt": "02:33:17",
    "endPrice": 3315.025,
    "checkAt": 1753752796310
  },
  {
    "timestamp": 1753752917049,
    "signalTime": "29/07/2025, 02:35:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. RSI is overbought, indicating strong momentum. The price has pulled back to EMA20, a common support level in an uptrend. Stochastic is in overbought territory, supporting upward momentum. The proximity to the Fibonacci 0.618 level adds to the confluence. Despite the neutral volume, the overall indicators suggest a high-probability continuation of the upward trend.",
    "entryPrice": 3317.075,
    "result": "CORRECT",
    "confirmedAt": "02:36:20",
    "endPrice": 3317.97,
    "checkAt": 1753752977049,
    "confirmedLate": true
  },
  {
    "timestamp": 1753753036846,
    "signalTime": "29/07/2025, 02:37:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is overbought indicating strong momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. Stochastic is also in the overbought region, supporting continuation. Despite no volume spike, the alignment of other indicators suggests a high-probability upward move.",
    "entryPrice": 3317.405,
    "result": "CORRECT",
    "confirmedAt": "02:38:19",
    "endPrice": 3318.165,
    "checkAt": 1753753096846,
    "confirmedLate": true
  },
  {
    "timestamp": 1753753156430,
    "signalTime": "29/07/2025, 02:39:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20, RSI is overbought indicating strong momentum, and the price has pulled back to EMA20 which often acts as support in an uptrend. The stochastic is also in overbought territory, suggesting continued upward pressure. Despite the doji candle pattern indicating indecision, the overall confluences favor an upward move.",
    "entryPrice": 3318.41,
    "result": "WRONG",
    "confirmedAt": "02:40:17",
    "endPrice": 3317.55,
    "checkAt": 1753753216430
  },
  {
    "timestamp": 1753753276165,
    "signalTime": "29/07/2025, 02:41:16",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20, RSI is overbought indicating strong momentum, and the price has pulled back to EMA20 which often acts as support in an uptrend. Additionally, the stochastic is in the overbought zone, supporting upward momentum. Despite the lack of a candle pattern and volume spike, the confluence of indicators suggests a high-probability upward move.",
    "entryPrice": 3317.765,
    "result": "CORRECT",
    "confirmedAt": "02:42:21",
    "endPrice": 3319.23,
    "checkAt": 1753753336165,
    "confirmedLate": true
  },
  {
    "timestamp": 1753753637763,
    "signalTime": "29/07/2025, 02:47:17",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 > EMA20, RSI is overbought indicating strong momentum, and a bullish engulfing pattern suggests continuation. The pullback to EMA20 provides a good entry point.",
    "entryPrice": 3320.115,
    "result": "WRONG",
    "confirmedAt": "02:48:19",
    "endPrice": 3319.565,
    "checkAt": 1753753697763,
    "confirmedLate": true
  },
  {
    "timestamp": 1753753698546,
    "signalTime": "29/07/2025, 02:48:18",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 80,
    "reason": "The trend is up with EMA7 above EMA20, RSI is bullish at 67.44, and the price has pulled back to the EMA20, which often acts as support in an uptrend. The stochastic is also in a bullish position, and the price is near the 0.618 Fibonacci level, which is a strong support zone. Despite the doji candle indicating indecision, the overall confluence supports an upward move.",
    "entryPrice": 3319.43,
    "result": "WRONG",
    "confirmedAt": "02:49:21",
    "endPrice": 3317.335,
    "checkAt": 1753753758546,
    "confirmedLate": true
  },
  {
    "timestamp": 1753754359589,
    "signalTime": "29/07/2025, 02:59:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. A bullish engulfing pattern has formed at the EMA20 support, indicating a potential continuation. RSI is above 50, supporting bullish momentum. The price is near the 0.618 Fibonacci retracement level, which often acts as a strong support in an uptrend. Despite the neutral volume, the confluence of these factors suggests a high-probability upward movement.",
    "entryPrice": 3318.01,
    "result": "CORRECT",
    "confirmedAt": "03:00:23",
    "endPrice": 3318.575,
    "checkAt": 1753754419589,
    "confirmedLate": true
  },
  {
    "timestamp": 1753754479354,
    "signalTime": "29/07/2025, 03:01:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20 which often acts as support in an uptrend. Additionally, the price is near the 0.618 Fibonacci level, which is a strong retracement level. Despite the neutral volume, these factors align for a high-probability UP trade.",
    "entryPrice": 3319.425,
    "result": "CORRECT",
    "confirmedAt": "03:02:23",
    "endPrice": 3319.545,
    "checkAt": 1753754539354,
    "confirmedLate": true
  },
  {
    "timestamp": 1753754719518,
    "signalTime": "29/07/2025, 03:05:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is above 50 indicating bullish momentum, and price action shows a pullback to EMA20 which often acts as support in an uptrend. The MACD histogram is not provided but the stochastic is above 70, suggesting potential continuation of the upward move. The proximity to the 0.618 Fib level adds to the bullish confluence.",
    "entryPrice": 3319.385,
    "result": "WRONG",
    "confirmedAt": "03:06:20",
    "endPrice": 3318.91,
    "checkAt": 1753754779518
  },
  {
    "timestamp": 1753755019302,
    "signalTime": "29/07/2025, 03:10:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and the price has pulled back to the EMA20, which often acts as support in an uptrend. Additionally, the RSI is above 50, and the price is near the Fibonacci 0.618 level, indicating potential support. Although the volume is neutral, the other indicators provide a strong confluence for an upward move.",
    "entryPrice": 3319,
    "result": "CORRECT",
    "confirmedAt": "03:11:21",
    "endPrice": 3319.02,
    "checkAt": 1753755079302,
    "confirmedLate": true
  },
  {
    "timestamp": 1753755139421,
    "signalTime": "29/07/2025, 03:12:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upwards as EMA7 is above EMA20, and price action shows a pullback to EMA20, which often acts as support in an uptrend. RSI is above 50 indicating bullish momentum, and the price is near the 0.618 Fibonacci level, which is a strong retracement zone. Although the volume is neutral and the candle pattern is a Doji, the overall confluence supports a continuation of the upward trend.",
    "entryPrice": 3318.85,
    "result": "WRONG",
    "confirmedAt": "03:13:22",
    "endPrice": 3318.26,
    "checkAt": 1753755199421,
    "confirmedLate": true
  },
  {
    "timestamp": 1753755439566,
    "signalTime": "29/07/2025, 03:17:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and price action shows a pullback to EMA20, suggesting a continuation. RSI is above 50, supporting bullish momentum, and the price is near the 0.618 Fibonacci level, which often acts as a support in an uptrend. Although volume is neutral, other indicators provide strong confluence for an upward move.",
    "entryPrice": 3319.09,
    "result": "WRONG",
    "confirmedAt": "03:18:24",
    "endPrice": 3318.34,
    "checkAt": 1753755499566,
    "confirmedLate": true
  },
  {
    "timestamp": 1753755499099,
    "signalTime": "29/07/2025, 03:18:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a hammer candle pattern suggests a potential reversal after a pullback to EMA20, and the price is near the 0.618 Fibonacci level. RSI is neutral, and MACD does not show divergence. Despite normal volume, these confluences suggest a high-probability upward move.",
    "entryPrice": 3318.8,
    "result": "WRONG",
    "confirmedAt": "03:19:19",
    "endPrice": 3318.725,
    "checkAt": 1753755559099
  },
  {
    "timestamp": 1753755739222,
    "signalTime": "29/07/2025, 03:22:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern is present, and the price action shows a pullback to EMA20. RSI is below 50, indicating bearish momentum. Although volume is neutral, the confluence of other indicators suggests a high-probability downward move.",
    "entryPrice": 3318.215,
    "result": "WRONG",
    "confirmedAt": "03:23:21",
    "endPrice": 3318.46,
    "checkAt": 1753755799222,
    "confirmedLate": true
  },
  {
    "timestamp": 1753756280822,
    "signalTime": "29/07/2025, 03:31:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upward with EMA7 above EMA20, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20, a potential support level. The MACD histogram is not specified, but the stochastic is in a bullish zone. The proximity to the 0.618 Fibonacci level adds to the bullish confluence. However, the absence of a volume spike and candle pattern reduces confidence slightly.",
    "entryPrice": 3319.875,
    "result": "WRONG",
    "confirmedAt": "03:32:23",
    "endPrice": 3319.565,
    "checkAt": 1753756340822,
    "confirmedLate": true
  },
  {
    "timestamp": 1753756406039,
    "signalTime": "29/07/2025, 03:33:26",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is upward with EMA7 above EMA20, and the price has pulled back to EMA20, suggesting a potential continuation. RSI is above 50, indicating bullish momentum. The doji candle pattern near the 0.618 Fibonacci level suggests indecision but potential for reversal in the direction of the trend. MACD is not explicitly bearish, and stochastic is above 50, supporting an upward bias.",
    "entryPrice": 3319.435,
    "result": "WRONG",
    "confirmedAt": "03:34:29",
    "endPrice": 3319.055,
    "checkAt": 1753756466039,
    "confirmedLate": true
  },
  {
    "timestamp": 1753756759172,
    "signalTime": "29/07/2025, 03:39:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern is present, and price action shows a pullback to EMA20. Additionally, the price is near the 0.618 Fibonacci level, which often acts as a support in an uptrend. However, the RSI is neutral and volume is normal, slightly reducing confidence.",
    "entryPrice": 3319.35,
    "result": "CORRECT",
    "confirmedAt": "03:40:21",
    "endPrice": 3319.51,
    "checkAt": 1753756819172,
    "confirmedLate": true
  },
  {
    "timestamp": 1753757120427,
    "signalTime": "29/07/2025, 03:45:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 80,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern is present, and the price has pulled back to EMA20 near the 0.618 Fibonacci level, indicating a potential continuation. RSI is above 50, supporting bullish momentum, and while volume is neutral, the confluence of other indicators suggests a high-probability upward move.",
    "entryPrice": 3319.68,
    "result": "CORRECT",
    "confirmedAt": "03:46:33",
    "endPrice": 3320.305,
    "checkAt": 1753757180427,
    "confirmedLate": true
  },
  {
    "timestamp": 1753757299699,
    "signalTime": "29/07/2025, 03:48:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, and the price has pulled back to EMA20, suggesting a potential continuation. RSI is neutral, and the MACD is not providing a strong signal, but the price is near the 0.618 Fibonacci level, which often acts as support in an uptrend. The confluences suggest a moderate probability for an upward move.",
    "entryPrice": 3319.655,
    "result": "WRONG",
    "confirmedAt": "03:49:24",
    "endPrice": 3318.965,
    "checkAt": 1753757359699,
    "confirmedLate": true
  },
  {
    "timestamp": 1753757359481,
    "signalTime": "29/07/2025, 03:49:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 80,
    "reason": "The trend is down with EMA7 below EMA20. A bearish engulfing pattern has formed at the EMA20 resistance, and RSI is below 50, indicating bearish momentum. The MACD histogram is negative, supporting the downtrend. Although volume is neutral, the confluence of these indicators suggests a high-probability short opportunity.",
    "entryPrice": 3318.67,
    "result": "WRONG",
    "confirmedAt": "03:50:19",
    "endPrice": 3319.19,
    "checkAt": 1753757419481
  },
  {
    "timestamp": 1753757479962,
    "signalTime": "29/07/2025, 03:51:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and price action shows a pullback to EMA20 near the Fib 0.618 level. RSI is neutral but above 50, supporting the uptrend. MACD is not strongly divergent, and volume is neutral, reducing confidence slightly.",
    "entryPrice": 3319.475,
    "result": "WRONG",
    "confirmedAt": "03:52:20",
    "endPrice": 3319.175,
    "checkAt": 1753757539962
  },
  {
    "timestamp": 1753757662365,
    "signalTime": "29/07/2025, 03:54:22",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing candle pattern, and price action showing a pullback to EMA20. RSI is below 50, indicating bearish momentum, and the MACD histogram supports a bearish bias. The stochastic is not overbought, allowing room for further downside. Despite neutral volume, the confluence of these factors suggests a high-probability short opportunity.",
    "entryPrice": 3318.84,
    "result": "CORRECT",
    "confirmedAt": "03:55:25",
    "endPrice": 3318.42,
    "checkAt": 1753757722365,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758018823,
    "signalTime": "29/07/2025, 04:00:18",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. A bearish engulfing pattern has formed near the EMA20, indicating a potential continuation of the downtrend. RSI is below 50, supporting bearish momentum. The MACD histogram is negative, and the price action shows a pullback to the EMA20, suggesting a high-probability continuation of the downtrend.",
    "entryPrice": 3318.505,
    "result": "WRONG",
    "confirmedAt": "04:01:22",
    "endPrice": 3318.86,
    "checkAt": 1753758078823,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758199152,
    "signalTime": "29/07/2025, 04:03:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The presence of a hammer candle pattern near the EMA20 suggests a potential reversal. The RSI is oversold at 36.05, indicating a possible upward correction. The stochastic is also in the oversold region, supporting a short-term bullish move. Although the trend is down, these confluences suggest a high-probability short-term pullback.",
    "entryPrice": 3317.315,
    "result": "CORRECT",
    "confirmedAt": "04:04:23",
    "endPrice": 3318.24,
    "checkAt": 1753758259152,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758379787,
    "signalTime": "29/07/2025, 04:06:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. RSI is below 50, indicating bearish momentum. A bearish engulfing pattern has formed near the EMA20, suggesting a continuation of the downtrend. The MACD histogram is negative, supporting bearish sentiment. The stochastic is oversold, but the overall confluence supports a short-term downward move.",
    "entryPrice": 3317.32,
    "result": "CORRECT",
    "confirmedAt": "04:07:23",
    "endPrice": 3316.92,
    "checkAt": 1753758439787,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758440062,
    "signalTime": "29/07/2025, 04:07:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as indicated by EMA7 < EMA20, and the price has pulled back to EMA20, suggesting a continuation of the downtrend. RSI is below 50, supporting bearish momentum. Although there is no candle pattern or significant volume spike, the confluence of trend and momentum indicators suggests a high-probability short setup.",
    "entryPrice": 3317.385,
    "result": "CORRECT",
    "confirmedAt": "04:08:24",
    "endPrice": 3316.695,
    "checkAt": 1753758500062,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758498487,
    "signalTime": "29/07/2025, 04:08:18",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is oversold, a bearish engulfing pattern is present, and price action shows a pullback to EMA20. These confluences suggest a continuation of the downtrend.",
    "entryPrice": 3316.52,
    "result": "WRONG",
    "confirmedAt": "04:09:30",
    "endPrice": 3316.64,
    "checkAt": 1753758558487,
    "confirmedLate": true
  },
  {
    "timestamp": 1753758560215,
    "signalTime": "29/07/2025, 04:09:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting bearish sentiment. The stochastic is oversold, but the overall confluence supports a continuation of the downtrend.",
    "entryPrice": 3316.595,
    "result": "CORRECT",
    "confirmedAt": "04:10:20",
    "endPrice": 3315.99,
    "checkAt": 1753758620215
  },
  {
    "timestamp": 1753758860051,
    "signalTime": "29/07/2025, 04:14:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "Despite the overall downtrend indicated by EMA7 < EMA20, the presence of a bullish engulfing candle pattern at the EMA20 level, along with an oversold RSI and stochastic, suggests a potential short-term reversal. The price is also near the Fib 0.618 level, which can act as a support. These confluences indicate a high-probability setup for a brief upward movement.",
    "entryPrice": 3316.515,
    "result": "WRONG",
    "confirmedAt": "04:15:21",
    "endPrice": 3316.285,
    "checkAt": 1753758920051
  },
  {
    "timestamp": 1753758980989,
    "signalTime": "29/07/2025, 04:16:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is clearly down with EMA7 below EMA20 and RSI below 50, indicating bearish momentum. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting the bearish trend. Although there is no candle pattern or volume spike, the overall confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 3316.37,
    "result": "CORRECT",
    "confirmedAt": "04:17:22",
    "endPrice": 3315.415,
    "checkAt": 1753759040989
  },
  {
    "timestamp": 1753759039707,
    "signalTime": "29/07/2025, 04:17:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20. The RSI is oversold, but the presence of a shooting star at the EMA20 resistance suggests further downside. The MACD histogram is negative, supporting bearish momentum. The price action is at a pullback level, touching EMA20, which often acts as resistance in a downtrend. Despite the neutral volume, the confluence of these indicators suggests a high-probability short trade.",
    "entryPrice": 3315.34,
    "result": "WRONG",
    "confirmedAt": "04:18:21",
    "endPrice": 3315.785,
    "checkAt": 1753759099707,
    "confirmedLate": true
  },
  {
    "timestamp": 1753759279896,
    "signalTime": "29/07/2025, 04:21:19",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The setup shows a potential reversal with a hammer candle pattern at a pullback to EMA20, RSI is oversold, and price is near the Fibonacci 0.618 level. However, volume is neutral and MACD does not show strong momentum, which slightly reduces confidence.",
    "entryPrice": 3315.545,
    "result": "WRONG",
    "confirmedAt": "04:22:22",
    "endPrice": 3315.3,
    "checkAt": 1753759339896,
    "confirmedLate": true
  },
  {
    "timestamp": 1753759340302,
    "signalTime": "29/07/2025, 04:22:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is oversold, a shooting star pattern indicates bearish sentiment, and price action shows a pullback to EMA20. Despite neutral volume, these confluences suggest a high-probability continuation of the downtrend.",
    "entryPrice": 3315.365,
    "result": "CORRECT",
    "confirmedAt": "04:23:31",
    "endPrice": 3315.23,
    "checkAt": 1753759400302,
    "confirmedLate": true
  },
  {
    "timestamp": 1753759459314,
    "signalTime": "29/07/2025, 04:24:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20. RSI is below 50, indicating bearish momentum. A shooting star pattern at the EMA20 suggests a bearish reversal. The MACD histogram is negative, supporting bearish sentiment. Although volume is neutral, the confluence of other indicators suggests a high probability for a downward move.",
    "entryPrice": 3315.055,
    "result": "WRONG",
    "confirmedAt": "04:25:22",
    "endPrice": 3315.265,
    "checkAt": 1753759519314,
    "confirmedLate": true
  },
  {
    "timestamp": 1753759580429,
    "signalTime": "29/07/2025, 04:26:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and price action shows a pullback to EMA20 which often acts as resistance in a downtrend. MACD is not strongly bullish and the stochastic is oversold but not enough to counter the downtrend. No significant volume spike to indicate reversal.",
    "entryPrice": 3315.15,
    "result": "CORRECT",
    "confirmedAt": "04:27:24",
    "endPrice": 3314.74,
    "checkAt": 1753759640429,
    "confirmedLate": true
  },
  {
    "timestamp": 1753759820969,
    "signalTime": "29/07/2025, 04:30:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down as EMA7 is below EMA20. The RSI is below 50, indicating bearish momentum. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The MACD histogram is not specified, but the stochastic is below 30, suggesting potential continuation of the downtrend. The Doji pattern at a resistance level suggests indecision, but in the context of a downtrend, it can precede further downside. Volume is neutral, not contradicting the bearish setup.",
    "entryPrice": 3315.14,
    "result": "CORRECT",
    "confirmedAt": "04:31:21",
    "endPrice": 3315.06,
    "checkAt": 1753759880969
  },
  {
    "timestamp": 1753759880996,
    "signalTime": "29/07/2025, 04:31:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and a bearish engulfing pattern has formed at the EMA20 resistance. The MACD histogram is negative, supporting the bearish trend. Despite the neutral volume, the confluence of these indicators suggests a high-probability short trade.",
    "entryPrice": 3314.525,
    "result": "WRONG",
    "confirmedAt": "04:32:21",
    "endPrice": 3314.875,
    "checkAt": 1753759940996
  },
  {
    "timestamp": 1753760121844,
    "signalTime": "29/07/2025, 04:35:21",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down as indicated by EMA7 being below EMA20. The RSI is oversold, suggesting potential continuation of the downtrend. The bearish engulfing pattern at the EMA20 resistance level indicates strong selling pressure. The MACD histogram is negative, supporting the downtrend. Although volume is neutral, the confluence of other indicators suggests a high-probability continuation of the downtrend.",
    "entryPrice": 3313.85,
    "result": "CORRECT",
    "confirmedAt": "04:36:22",
    "endPrice": 3313.065,
    "checkAt": 1753760181844
  },
  {
    "timestamp": 1753760179477,
    "signalTime": "29/07/2025, 04:36:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down as EMA7 is below EMA20. RSI is oversold at 28.30, indicating potential for further downside. A bearish engulfing pattern confirms selling pressure. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting bearish momentum. Although volume is neutral, multiple indicators align for a high-probability downward move.",
    "entryPrice": 3313.035,
    "result": "CORRECT",
    "confirmedAt": "04:37:21",
    "endPrice": 3312.535,
    "checkAt": 1753760239477,
    "confirmedLate": true
  },
  {
    "timestamp": 1753760840257,
    "signalTime": "29/07/2025, 04:47:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, RSI is below 50 indicating bearish momentum, and the price has pulled back to EMA20 resistance. The doji candle suggests indecision, but in a downtrend, it often precedes continuation. MACD is not strongly divergent, but the overall setup favors a continuation of the downtrend.",
    "entryPrice": 3312.715,
    "result": "WRONG",
    "confirmedAt": "04:48:24",
    "endPrice": 3313.435,
    "checkAt": 1753760900257,
    "confirmedLate": true
  },
  {
    "timestamp": 1753761199308,
    "signalTime": "29/07/2025, 04:53:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, confirmed by a shooting star candle pattern at the EMA20 resistance level. RSI is below 50, indicating bearish momentum, and MACD is neutral, not contradicting the downtrend. The price is near the 0.618 Fibonacci level, which often acts as a resistance in a downtrend.",
    "entryPrice": 3313.26,
    "result": "WRONG",
    "confirmedAt": "04:54:20",
    "endPrice": 3313.81,
    "checkAt": 1753761259308
  },
  {
    "timestamp": 1753761321039,
    "signalTime": "29/07/2025, 04:55:21",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20. A bullish engulfing pattern has formed near the EMA20, indicating a potential continuation of the uptrend. RSI is above 50, supporting bullish momentum. The MACD histogram is positive, and the price is near the 0.618 Fibonacci level, which often acts as a support in an uptrend. Although the volume is neutral, the other indicators provide a strong confluence for an upward move.",
    "entryPrice": 3314.365,
    "result": "WRONG",
    "confirmedAt": "04:56:21",
    "endPrice": 3313.555,
    "checkAt": 1753761381039
  },
  {
    "timestamp": 1753761560747,
    "signalTime": "29/07/2025, 04:59:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as EMA7 is below EMA20, RSI is below 50 indicating bearish momentum, a bearish engulfing pattern has formed, and the price has pulled back to EMA20 which often acts as resistance in a downtrend. The MACD histogram is negative, and the stochastic is oversold but not yet reversing, suggesting continuation of the downtrend. The confluence of these factors supports a high-probability DOWN trade.",
    "entryPrice": 3312.455,
    "result": "WRONG",
    "confirmedAt": "05:00:22",
    "endPrice": 3313.095,
    "checkAt": 1753761620747,
    "confirmedLate": true
  },
  {
    "timestamp": 1753762220309,
    "signalTime": "29/07/2025, 05:10:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, confirmed by a shooting star candle pattern at the EMA20 resistance. RSI is below 50, indicating bearish momentum, and the price is near the 0.618 Fibonacci level, suggesting a potential reversal point. Despite normal volume, the overall confluence supports a DOWN trade.",
    "entryPrice": 3312.935,
    "result": "WRONG",
    "confirmedAt": "05:11:30",
    "endPrice": 3313.41,
    "checkAt": 1753762280309,
    "confirmedLate": true
  },
  {
    "timestamp": 1753762581071,
    "signalTime": "29/07/2025, 05:16:21",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, a bullish engulfing pattern has formed, and price action shows a pullback to EMA20 near the 0.618 Fibonacci level, indicating potential continuation. RSI is neutral, but MACD and volume do not show strong confluence, hence moderate confidence.",
    "entryPrice": 3313.715,
    "result": "WRONG",
    "confirmedAt": "05:17:22",
    "endPrice": 3313.135,
    "checkAt": 1753762641071
  },
  {
    "timestamp": 1753762639657,
    "signalTime": "29/07/2025, 05:17:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down as indicated by EMA7 < EMA20. A bearish engulfing pattern has formed after a pullback to EMA20, suggesting continuation of the downtrend. RSI is below 50, supporting bearish momentum. MACD histogram is not specified, but the overall indicators align for a downward move.",
    "entryPrice": 3312.955,
    "result": "WRONG",
    "confirmedAt": "05:18:21",
    "endPrice": 3313.005,
    "checkAt": 1753762699657
  },
  {
    "timestamp": 1753762760798,
    "signalTime": "29/07/2025, 05:19:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20. A bearish engulfing pattern has formed at the EMA20 resistance level, and the RSI is below 50, indicating bearish momentum. The MACD histogram is negative, supporting the downtrend. Although the volume is neutral, the confluence of these indicators suggests a high-probability short trade.",
    "entryPrice": 3312.185,
    "result": "WRONG",
    "confirmedAt": "05:20:22",
    "endPrice": 3312.4,
    "checkAt": 1753762820798
  },
  {
    "timestamp": 1753762879283,
    "signalTime": "29/07/2025, 05:21:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The stochastic is oversold, but the overall trend and EMA alignment suggest continuation of the downtrend. No significant volume spike or bullish candle pattern to suggest a reversal.",
    "entryPrice": 3312.415,
    "result": "CORRECT",
    "confirmedAt": "05:22:23",
    "endPrice": 3311.79,
    "checkAt": 1753762939283,
    "confirmedLate": true
  },
  {
    "timestamp": 1753762939446,
    "signalTime": "29/07/2025, 05:22:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is down with EMA7 below EMA20, a bearish engulfing pattern, and RSI below 50 indicating bearish momentum. The price action shows a pullback to EMA20, which often acts as resistance in a downtrend. The MACD is not specified, but the overall confluence suggests a continuation of the downtrend.",
    "entryPrice": 3311.92,
    "result": "CORRECT",
    "confirmedAt": "05:23:23",
    "endPrice": 3311.865,
    "checkAt": 1753762999446,
    "confirmedLate": true
  },
  {
    "timestamp": 1753763121021,
    "signalTime": "29/07/2025, 05:25:21",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "Multiple confluences for a DOWN trade: EMA7 is below EMA20 indicating a downtrend, RSI is oversold at 32.18, a bearish engulfing pattern is present, and price action shows a pullback touching EMA20. The MACD histogram supports bearish momentum, and the stochastic is in the oversold region. Despite neutral volume, the overall setup favors a continuation of the downtrend.",
    "entryPrice": 3311.025,
    "result": "CORRECT",
    "confirmedAt": "05:26:24",
    "endPrice": 3310.015,
    "checkAt": 1753763181021,
    "confirmedLate": true
  },
  {
    "timestamp": 1753763180559,
    "signalTime": "29/07/2025, 05:26:20",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The trend is clearly down with EMA7 below EMA20, RSI is oversold indicating strong bearish momentum, a bearish engulfing pattern confirms the downtrend, and the price action has pulled back to EMA20, which often acts as resistance in a downtrend. The MACD histogram is negative, supporting the bearish sentiment. Despite the neutral volume, the confluence of these indicators suggests a high-probability continuation of the downtrend.",
    "entryPrice": 3309.965,
    "result": "CORRECT",
    "confirmedAt": "05:27:24",
    "endPrice": 3309.59,
    "checkAt": 1753763240559,
    "confirmedLate": true
  },
  {
    "timestamp": 1753763239298,
    "signalTime": "29/07/2025, 05:27:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "Multiple confluences align for a bearish signal: EMA7 is below EMA20 indicating a downtrend, RSI is oversold at 24.34 suggesting continued bearish momentum, a bearish engulfing candle pattern has formed, and price action shows a pullback touching EMA20. Despite the neutral volume, the overall setup favors a continuation of the downtrend.",
    "entryPrice": 3309.595,
    "result": "WRONG",
    "confirmedAt": "05:28:20",
    "endPrice": 3310.395,
    "checkAt": 1753763299298
  },
  {
    "timestamp": 1753763479632,
    "signalTime": "29/07/2025, 05:31:19",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 80,
    "reason": "The trend is down as indicated by EMA7 < EMA20. The price has pulled back to EMA20, which often acts as resistance in a downtrend. The RSI is below 50, suggesting bearish momentum. The Doji candle pattern at a resistance level can indicate a continuation of the downtrend. The MACD histogram is not specified, but the overall indicators suggest a bearish setup.",
    "entryPrice": 3311.43,
    "result": "WRONG",
    "confirmedAt": "05:32:31",
    "endPrice": 3312.79,
    "checkAt": 1753763539632,
    "confirmedLate": true
  },
  {
    "timestamp": 1753764200349,
    "signalTime": "29/07/2025, 05:43:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20, a hammer candle pattern suggests a bullish reversal, RSI is above 60 indicating bullish momentum, and price action shows a pullback to EMA20 which often acts as support. Stochastic is overbought but aligns with the upward trend. The MACD histogram is not provided, but the existing confluences strongly favor an upward move.",
    "entryPrice": 3313.705,
    "result": "WRONG",
    "confirmedAt": "05:44:24",
    "endPrice": 3313.645,
    "checkAt": 1753764260349,
    "confirmedLate": true
  },
  {
    "timestamp": 1753764380037,
    "signalTime": "29/07/2025, 05:46:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "Multiple confluences align for an upward trade: EMA7 is above EMA20 indicating an uptrend, RSI is above 60 suggesting bullish momentum, a bullish engulfing pattern has formed, and the price has pulled back to EMA20 which often acts as support. The MACD is not specified but the stochastic is overbought, which is a minor concern but not enough to negate the strong bullish signals. The price is also near the Fibonacci 0.618 level, which can act as a support in an uptrend.",
    "entryPrice": 3313.835,
    "result": "CORRECT",
    "confirmedAt": "05:47:20",
    "endPrice": 3314.995,
    "checkAt": 1753764440037
  },
  {
    "timestamp": 1753764680513,
    "signalTime": "29/07/2025, 05:51:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is clearly up with EMA7 above EMA20. The RSI is above 60, indicating bullish momentum. A bullish engulfing candle pattern has formed at the EMA20 support, suggesting a continuation of the uptrend. The price is near the Fibonacci 0.618 level, which often acts as a strong support in an uptrend. Despite the neutral volume, the confluence of these factors suggests a high-probability upward move.",
    "entryPrice": 3315.345,
    "result": "WRONG",
    "confirmedAt": "05:52:21",
    "endPrice": 3315.09,
    "checkAt": 1753764740513
  },
  {
    "timestamp": 1753765040318,
    "signalTime": "29/07/2025, 05:57:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, RSI is bullish at 67.68, and the price has pulled back to the EMA20, which often acts as support in an uptrend. Stochastic is in overbought territory but not crossing down, and the price is near the Fib 0.618 level, suggesting potential continuation. However, the lack of a volume spike and a candle pattern slightly reduces confidence.",
    "entryPrice": 3316.39,
    "result": "CORRECT",
    "confirmedAt": "05:58:24",
    "endPrice": 3317.44,
    "checkAt": 1753765100318,
    "confirmedLate": true
  },
  {
    "timestamp": 1753765160748,
    "signalTime": "29/07/2025, 05:59:20",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is up with EMA7 above EMA20, RSI is overbought but indicates strong momentum, price action shows a pullback to EMA20, and the stochastic is overbought but aligning with the trend. The doji candle pattern suggests indecision, but the overall confluence supports continuation of the uptrend.",
    "entryPrice": 3317.365,
    "result": "WRONG",
    "confirmedAt": "06:00:25",
    "endPrice": 3316.55,
    "checkAt": 1753765220748,
    "confirmedLate": true
  },
  {
    "timestamp": 1753765281734,
    "signalTime": "29/07/2025, 06:01:21",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 85,
    "reason": "The trend is upward with EMA7 above EMA20, a bullish engulfing pattern has formed, RSI is above 60 indicating bullish momentum, and the price has pulled back to EMA20 which often acts as support. Additionally, the MACD histogram is positive, and the price is near the 0.618 Fibonacci retracement level, which is a strong support zone. Despite the neutral volume, these confluences suggest a high-probability upward move.",
    "entryPrice": 3316.6,
    "result": "WRONG",
    "confirmedAt": "06:02:25",
    "endPrice": 3316.055,
    "checkAt": 1753765341734,
    "confirmedLate": true
  },
  {
    "timestamp": 1753765521321,
    "signalTime": "29/07/2025, 06:05:21",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, price action shows a pullback to EMA20, and the RSI is above 50 indicating bullish momentum. The MACD is not providing a strong signal, but the proximity to the Fibonacci 0.618 level supports a potential bounce. However, the doji candle and neutral volume suggest caution, hence not a higher confidence level.",
    "entryPrice": 3315.85,
    "result": "WRONG",
    "confirmedAt": "06:06:22",
    "endPrice": 3315.66,
    "checkAt": 1753765581321
  },
  {
    "timestamp": 1753765581598,
    "signalTime": "29/07/2025, 06:06:21",
    "symbol": "XAUUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The trend is up with EMA7 above EMA20, indicating bullish momentum. The price has pulled back to EMA20, which often acts as support in an uptrend. The RSI is above 50, suggesting bullish conditions. The presence of a Doji at support could indicate indecision but also a potential reversal back up. The MACD histogram is not specified, but the overall setup suggests a continuation of the uptrend. The proximity to the Fibonacci 0.618 level adds further support. However, the volume is neutral, slightly reducing confidence.",
    "entryPrice": 3315.685,
    "result": "WRONG",
    "confirmedAt": "06:07:22",
    "endPrice": 3315.63,
    "checkAt": 1753765641598
  },
  {
    "timestamp": 1753765941329,
    "signalTime": "29/07/2025, 06:12:21",
    "symbol": "XAUUSD",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The trend is down with EMA7 below EMA20, and price action shows a pullback to EMA20. The RSI is below 50, indicating bearish momentum. The MACD histogram is not specified, but the stochastic is oversold, which could indicate a continuation of the downtrend. The doji candle pattern suggests indecision, but in the context of a downtrend, it may signal a continuation. The proximity to the 0.618 Fib level adds to the confluence for a potential reversal, but the overall trend and indicators suggest a short-term continuation of the downtrend.",
    "entryPrice": 3314.94,
    "result": "WRONG",
    "confirmedAt": "06:13:23",
    "endPrice": 3314.995,
    "checkAt": 1753766001329
  }
]
  
  
  {
    "timestamp": 1752801153817,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120393.65,
    "checkAt": 1752801453817,
    "result": "WRONG",
    "checkedPrice": 120183.03,
    "checkedAt": 1752801473869
  },
  {
    "timestamp": 1752801218203,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120393.52,
    "checkAt": 1752801518203,
    "result": "WRONG",
    "checkedPrice": 120176.9,
    "checkedAt": 1752801538950
  },
  {
    "timestamp": 1752801281753,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120323.21,
    "checkAt": 1752801581753,
    "result": "WRONG",
    "checkedPrice": 120129.52,
    "checkedAt": 1752801602989
  },
  {
    "timestamp": 1752801668750,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120369.89,
    "checkAt": 1752801968750,
    "result": "WRONG",
    "checkedPrice": 120272.14,
    "checkedAt": 1752802406933
  },
  {
    "timestamp": 1752801733079,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120387.72,
    "checkAt": 1752802033079,
    "result": "WRONG",
    "checkedPrice": 120272.14,
    "checkedAt": 1752802406933
  },
  {
    "timestamp": 1752802473254,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120462.84,
    "checkAt": 1752802773254,
    "result": "CORRECT",
    "checkedPrice": 120553.84,
    "checkedAt": 1752802794334
  },
  {
    "timestamp": 1752802537588,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120462.67,
    "checkAt": 1752802837588,
    "result": "CORRECT",
    "checkedPrice": 120616,
    "checkedAt": 1752802859808
  },
  {
    "timestamp": 1752802601653,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120460,
    "checkAt": 1752802901653,
    "result": "CORRECT",
    "checkedPrice": 120476.43,
    "checkedAt": 1752802925618
  },
  {
    "timestamp": 1752802665039,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120467.43,
    "checkAt": 1752802965039,
    "result": "WRONG",
    "checkedPrice": 120450.67,
    "checkedAt": 1752802990679
  },
  {
    "timestamp": 1752802794331,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120541.78,
    "checkAt": 1752803094331,
    "result": "WRONG",
    "checkedPrice": 118028.86,
    "checkedAt": 1752885252410
  },
  {
    "timestamp": 1752802859807,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120608.03,
    "checkAt": 1752803159807,
    "result": "WRONG",
    "checkedPrice": 118028.85,
    "checkedAt": 1752885252410
  },
  {
    "timestamp": 1752802925616,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 120570.79,
    "checkAt": 1752803225616,
    "result": "WRONG",
    "checkedPrice": 118028.85,
    "checkedAt": 1752885252410
  },
  {
    "timestamp": 1752885252406,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 118028.85,
    "checkAt": 1752885552406,
    "result": "WRONG",
    "checkedPrice": 117951.82,
    "checkedAt": 1752885577205
  },
  {
    "timestamp": 1752886027043,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117867.88,
    "checkAt": 1752886327043,
    "result": "CORRECT",
    "checkedPrice": 117860.01,
    "checkedAt": 1752886345996
  },
  {
    "timestamp": 1752886345993,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117860.01,
    "checkAt": 1752886645993,
    "result": "CORRECT",
    "checkedPrice": 117771.99,
    "checkedAt": 1752886665144
  },
  {
    "timestamp": 1752886797766,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117742.46,
    "checkAt": 1752887097766,
    "result": "CORRECT",
    "checkedPrice": 117661.43,
    "checkedAt": 1752887129875
  },
  {
    "timestamp": 1752886861111,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117723.46,
    "checkAt": 1752887161111,
    "result": "CORRECT",
    "checkedPrice": 117645.02,
    "checkedAt": 1752887194093
  },
  {
    "timestamp": 1752886924039,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117682.51,
    "checkAt": 1752887224039,
    "result": "CORRECT",
    "checkedPrice": 117666.82,
    "checkedAt": 1752887257592
  },
  {
    "timestamp": 1752887066812,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117676.48,
    "checkAt": 1752887366812,
    "result": "WRONG",
    "checkedPrice": 117815.62,
    "checkedAt": 1752887383926
  },
  {
    "timestamp": 1752887194092,
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "entryPrice": 117645.02,
    "checkAt": 1752887494092,
    "result": "WRONG",
    "checkedPrice": 117826.69,
    "checkedAt": 1752887511358
  },
  {
    "timestamp": 1752887383923,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117815.62,
    "checkAt": 1752887683923,
    "result": "CORRECT",
    "checkedPrice": 117896.07,
    "checkedAt": 1752887702918
  },
  {
    "timestamp": 1752887447826,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117793.55,
    "checkAt": 1752887747826,
    "result": "CORRECT",
    "checkedPrice": 117971.78,
    "checkedAt": 1752887767020
  },
  {
    "timestamp": 1752887511357,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117821.34,
    "checkAt": 1752887811357,
    "result": "CORRECT",
    "checkedPrice": 117946.39,
    "checkedAt": 1752887831617
  },
  {
    "timestamp": 1752887575453,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117851.99,
    "checkAt": 1752887875453,
    "result": "CORRECT",
    "checkedPrice": 117901.97,
    "checkedAt": 1752887896875
  },
  {
    "timestamp": 1752887638802,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117884.28,
    "checkAt": 1752887938802,
    "result": "CORRECT",
    "checkedPrice": 117924,
    "checkedAt": 1752887960766
  },
  {
    "timestamp": 1752887702916,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117896.07,
    "checkAt": 1752888002916,
    "result": "CORRECT",
    "checkedPrice": 117958.21,
    "checkedAt": 1752888024120
  },
  {
    "timestamp": 1752887767018,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117971.79,
    "checkAt": 1752888067018,
    "result": "CORRECT",
    "checkedPrice": 117986.34,
    "checkedAt": 1752888087511
  },
  {
    "timestamp": 1752887831612,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117934.44,
    "checkAt": 1752888131612,
    "result": "PENDING"
  },
  {
    "timestamp": 1752887960763,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117923.99,
    "checkAt": 1752888260763,
    "result": "PENDING"
  },
  {
    "timestamp": 1752888024118,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117958.07,
    "checkAt": 1752888324118,
    "result": "PENDING"
  },
  {
    "timestamp": 1752888087509,
    "symbol": "BTCUSDT",
    "signal": "UP",
    "entryPrice": 117985.58,
    "checkAt": 1752888387509,
    "result": "PENDING"
  }
]
[
  {
    "timestamp": 1753276306703,
    "signalTime": "23/07/2025, 14:11:46",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is neutral, but the price action shows a pullback to EMA30, suggesting a potential continuation of the downtrend. The stochastic is in the middle range, not indicating strong momentum in either direction. The MACD histogram is not provided, but the lack of a volume spike suggests no strong buying pressure. The proximity to the Fib 0.618 level could offer resistance, aligning with the downtrend. Given these factors, a DOWN trade is more likely.",
    "entryPrice": 118089.08,
    "result": "CORRECT",
    "confirmedAt": "14:16:54",
    "endPrice": 117976.59,
    "checkAt": 1753276606703
  },
  {
    "timestamp": 1753277026622,
    "signalTime": "23/07/2025, 14:23:46",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, RSI is below 50 indicating bearish momentum, and the price has pulled back to the EMA30 which often acts as resistance in a downtrend. The presence of a Doji suggests indecision, but in the context of a downtrend, it may precede further downside. Stochastic is below 50, supporting a bearish bias. The lack of a significant volume spike suggests no strong reversal pressure.",
    "entryPrice": 117942.71,
    "result": "WRONG",
    "confirmedAt": "14:28:55",
    "endPrice": 118083.78,
    "checkAt": 1753277326622
  },
  {
    "timestamp": 1753277207717,
    "signalTime": "23/07/2025, 14:26:47",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a shooting star candle pattern indicating potential reversal after a pullback, and RSI below 50 suggesting bearish momentum. The Stochastic is also not in oversold territory, supporting further downside potential. Overall, the confluence of these indicators suggests a higher likelihood of the price moving down in the next 5 minutes.",
    "entryPrice": 117945.43,
    "result": "WRONG",
    "confirmedAt": "14:32:09",
    "endPrice": 117948.73,
    "checkAt": 1753277507717
  },
  {
    "timestamp": 1753277394399,
    "signalTime": "23/07/2025, 14:29:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100. The presence of a shooting star candle pattern at a pullback to EMA30 suggests potential continuation of the downtrend. Stochastic is overbought, indicating possible downward momentum. RSI is neutral, and volume is normal, providing no strong counter signals.",
    "entryPrice": 118088,
    "result": "CORRECT",
    "confirmedAt": "14:35:10",
    "endPrice": 117840.24,
    "checkAt": 1753277694399
  },
  {
    "timestamp": 1753277694521,
    "signalTime": "23/07/2025, 14:34:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but with %K below %D, indicating continued bearish pressure. Despite the neutral volume, the confluence of these indicators suggests a higher probability of the price moving down.",
    "entryPrice": 117921.99,
    "result": "WRONG",
    "confirmedAt": "14:40:11",
    "endPrice": 117932,
    "checkAt": 1753277994521
  },
  {
    "timestamp": 1753277755943,
    "signalTime": "23/07/2025, 14:35:55",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The prevailing trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but not yet showing a strong reversal signal. The presence of a Doji indicates indecision, but in the context of a downtrend, it may suggest continuation rather than reversal. Given these factors, the likelihood of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 117904.54,
    "result": "CORRECT",
    "confirmedAt": "14:41:12",
    "endPrice": 117803.09,
    "checkAt": 1753278055943
  },
  {
    "timestamp": 1753279614553,
    "signalTime": "23/07/2025, 15:06:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests potential bearish reversal after a pullback. RSI is relatively high at 59.44, indicating potential overbought conditions in a downtrend. Stochastic %K is at 100, suggesting overbought conditions, and the price is near the Fib 0.618 level, which often acts as resistance. These factors combined with the neutral volume bias suggest a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117823.52,
    "result": "CORRECT",
    "confirmedAt": "15:12:13",
    "endPrice": 117671.25,
    "checkAt": 1753279914553
  },
  {
    "timestamp": 1753279736055,
    "signalTime": "23/07/2025, 15:08:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The RSI is moderately high at 58.18, suggesting limited upside potential. The stochastic indicates overbought conditions with %K above %D. The MACD histogram is not specified, but given the other indicators, the likelihood of continuation of the downtrend is higher. The proximity to the Fib 0.618 level could provide additional resistance.",
    "entryPrice": 117836.76,
    "result": "CORRECT",
    "confirmedAt": "15:14:14",
    "endPrice": 117650.03,
    "checkAt": 1753280036055
  },
  {
    "timestamp": 1753279794466,
    "signalTime": "23/07/2025, 15:09:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The shooting star candle pattern suggests potential bearish reversal after the pullback to EMA30. Stochastic is in the overbought region, indicating a possible downward movement. The RSI is neutral, but the price action and trend provide a stronger bearish confluence.",
    "entryPrice": 117828.22,
    "result": "CORRECT",
    "confirmedAt": "15:15:14",
    "endPrice": 117753.92,
    "checkAt": 1753280094466
  },
  {
    "timestamp": 1753280393477,
    "signalTime": "23/07/2025, 15:19:53",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish shooting star candle pattern, and a volume spike indicating selling pressure. The RSI is near overbought levels, and the stochastic is also overbought, suggesting a potential downward move. Additionally, the price has pulled back to the EMA30, which often acts as resistance in a downtrend.",
    "entryPrice": 117928.77,
    "result": "WRONG",
    "confirmedAt": "15:25:15",
    "endPrice": 117994.6,
    "checkAt": 1753280693477
  },
  {
    "timestamp": 1753283694441,
    "signalTime": "23/07/2025, 16:14:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests a potential reversal. The RSI is below 50, indicating bearish momentum. The Stochastic %K is extremely low, suggesting oversold conditions, but the %D is not confirming a reversal. The price action showing a pullback to EMA30 and nearing the Fib 0.618 level suggests resistance. Therefore, a short-term downward movement is likely.",
    "entryPrice": 117854.08,
    "result": "WRONG",
    "confirmedAt": "16:20:17",
    "endPrice": 117944.65,
    "checkAt": 1753283994441
  },
  {
    "timestamp": 1753287117364,
    "signalTime": "23/07/2025, 17:11:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is low, suggesting potential for upward movement. The hammer candle pattern near the EMA30 suggests a bullish reversal. The Stochastic %K is at a low level, indicating potential for upward momentum. The price is near the Fib 0.618 level, which is a strong support zone. Despite the neutral volume, the confluence of these factors suggests a likely upward movement.",
    "entryPrice": 118069.66,
    "result": "WRONG",
    "confirmedAt": "17:17:19",
    "endPrice": 117972.6,
    "checkAt": 1753287417364
  },
  {
    "timestamp": 1753288375677,
    "signalTime": "23/07/2025, 17:32:55",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent pullback to EMA30 with a doji candle pattern indicates indecision but within a downtrend context. Stochastic is in the oversold region but not yet showing a strong reversal signal. Volume is neutral, providing no counter-trend support. These factors suggest a continuation of the downtrend.",
    "entryPrice": 117709.98,
    "result": "CORRECT",
    "confirmedAt": "17:38:21",
    "endPrice": 117599.99,
    "checkAt": 1753288675677
  },
  {
    "timestamp": 1753288436026,
    "signalTime": "23/07/2025, 17:33:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. The doji candle pattern and neutral volume suggest indecision, but the prevailing trend and indicators favor a continuation to the downside.",
    "entryPrice": 117674.58,
    "result": "CORRECT",
    "confirmedAt": "17:39:22",
    "endPrice": 117657.1,
    "checkAt": 1753288736026
  },
  {
    "timestamp": 1753289456091,
    "signalTime": "23/07/2025, 17:50:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star pattern at the EMA30 suggests a bearish reversal after a pullback. Stochastic is overbought, indicating potential for a downward move. RSI is neutral, providing no strong counter-signal. The MACD histogram is not provided, but other indicators suggest a continuation of the downtrend.",
    "entryPrice": 117782.89,
    "result": "CORRECT",
    "confirmedAt": "17:56:23",
    "endPrice": 117740,
    "checkAt": 1753289756091
  },
  {
    "timestamp": 1753290298183,
    "signalTime": "23/07/2025, 18:04:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is neutral, and the doji candle pattern suggests indecision, but the price action touching EMA30 in a downtrend often acts as resistance. The MACD histogram is not provided, but the stochastic indicates potential overbought conditions. Given these factors, a short-term continuation of the downtrend is likely.",
    "entryPrice": 117833.52,
    "result": "CORRECT",
    "confirmedAt": "18:10:24",
    "endPrice": 117581,
    "checkAt": 1753290598183
  },
  {
    "timestamp": 1753291078015,
    "signalTime": "23/07/2025, 18:17:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region but not yet showing a strong reversal signal. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal continuation rather than reversal. Volume is neutral, providing no counter-signal to the bearish setup.",
    "entryPrice": 117544.04,
    "result": "WRONG",
    "confirmedAt": "18:23:27",
    "endPrice": 117729.54,
    "checkAt": 1753291378015
  },
  {
    "timestamp": 1753291496582,
    "signalTime": "23/07/2025, 18:24:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, indicating bearish sentiment. The RSI is relatively high at 61.76, suggesting potential overbought conditions in a downtrend. The Stochastic %K is also high, indicating a possible reversal. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The presence of a Doji candle pattern suggests indecision, but in the context of a downtrend, it could indicate a continuation of the bearish move. The MACD histogram is not provided, but the other indicators suggest a higher probability of the price moving down.",
    "entryPrice": 117820,
    "result": "CORRECT",
    "confirmedAt": "18:29:58",
    "endPrice": 117647.22,
    "checkAt": 1753291796582
  },
  {
    "timestamp": 1753292099179,
    "signalTime": "23/07/2025, 18:34:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 59.55, suggesting potential overbought conditions in a downtrend. The Stochastic %K is also very high, indicating overbought conditions, which aligns with a potential downward move. The Doji candle pattern and price action touching EMA30 suggest indecision and a possible continuation of the downtrend. The MACD histogram is not provided, but given the other indicators, a DOWN trade is more likely.",
    "entryPrice": 117829.21,
    "result": "CORRECT",
    "confirmedAt": "18:39:59",
    "endPrice": 117728.01,
    "checkAt": 1753292399179
  },
  {
    "timestamp": 1753292458302,
    "signalTime": "23/07/2025, 18:40:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests a potential reversal or continuation of the downtrend. The RSI is neutral, but the price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the upper range, indicating potential overbought conditions. The confluence of these factors suggests a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 117736.44,
    "result": "WRONG",
    "confirmedAt": "18:46:00",
    "endPrice": 117833.21,
    "checkAt": 1753292758302
  },
  {
    "timestamp": 1753292636889,
    "signalTime": "23/07/2025, 18:43:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively neutral, but the stochastic is overbought, suggesting a potential for a downward move. The doji candle pattern indicates indecision, but given the downtrend and the pullback to EMA30, a continuation downward is more likely. The MACD histogram is not provided, but the lack of a volume spike suggests no strong upward momentum. The proximity to the Fib 0.618 level could act as resistance.",
    "entryPrice": 117819.18,
    "result": "WRONG",
    "confirmedAt": "18:49:01",
    "endPrice": 117821.76,
    "checkAt": 1753292936889
  },
  {
    "timestamp": 1753292705286,
    "signalTime": "23/07/2025, 18:45:05",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star pattern suggests potential reversal or continuation of the downtrend. The RSI is relatively high at 60.50, indicating potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, supporting a potential downward move. The price action shows a pullback to EMA30, which could act as resistance. Although the volume is neutral, the confluence of these indicators suggests a higher probability of price moving down.",
    "entryPrice": 117853.33,
    "result": "WRONG",
    "confirmedAt": "18:50:32",
    "endPrice": 117937.31,
    "checkAt": 1753293005286
  },
  {
    "timestamp": 1753292816260,
    "signalTime": "23/07/2025, 18:46:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 65.05, suggesting potential for a short-term reversal or continuation of the downtrend. The price has pulled back to touch EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, indicating potential for downward movement. Despite the lack of a volume spike, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 117956.22,
    "result": "CORRECT",
    "confirmedAt": "18:52:03",
    "endPrice": 117740,
    "checkAt": 1753293116260
  },
  {
    "timestamp": 1753292996514,
    "signalTime": "23/07/2025, 18:49:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests potential reversal or continuation of the downtrend. The RSI is neutral but slightly above 50, indicating no strong upward momentum. The stochastic is in a neutral position, and the price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The lack of a volume spike suggests no strong buying pressure. These factors combined suggest a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117836.58,
    "result": "WRONG",
    "confirmedAt": "18:55:04",
    "endPrice": 117880,
    "checkAt": 1753293296514
  },
  {
    "timestamp": 1753296777998,
    "signalTime": "23/07/2025, 19:52:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is above 50, suggesting bullish momentum. The presence of a hammer candle pattern at the EMA30 support level, along with a volume spike on the reversal candle, indicates potential bullish continuation. Stochastic values show potential for upward movement. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118313.52,
    "result": "CORRECT",
    "confirmedAt": "19:58:06",
    "endPrice": 118365.91,
    "checkAt": 1753297077998
  },
  {
    "timestamp": 1753299299920,
    "signalTime": "23/07/2025, 20:34:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA30 being above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The hammer candle pattern suggests a potential reversal back in the direction of the trend. Although the RSI is below 50, indicating some bearish momentum, the stochastic is in the oversold region, suggesting a potential upward movement. The proximity to the 0.618 Fib level adds to the likelihood of a bounce. The neutral volume does not strongly support either direction, but the confluence of other factors leans towards an upward move.",
    "entryPrice": 118285.66,
    "result": "CORRECT",
    "confirmedAt": "20:40:08",
    "endPrice": 118344.38,
    "checkAt": 1753299599920
  },
  {
    "timestamp": 1753299358499,
    "signalTime": "23/07/2025, 20:35:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA30 being above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is neutral, suggesting no overbought or oversold conditions. The presence of a doji indicates indecision, but the volume spike on the reversal candle suggests potential buying interest. The stochastic is low, indicating potential for upward movement. The proximity to the Fib 0.618 level provides additional support for a bounce. Overall, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118292.79,
    "result": "CORRECT",
    "confirmedAt": "20:41:09",
    "endPrice": 118319.99,
    "checkAt": 1753299658499
  },
  {
    "timestamp": 1753300858347,
    "signalTime": "23/07/2025, 21:00:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is above 50, suggesting bullish sentiment. The price has pulled back to the EMA30, which often acts as support in an uptrend. Additionally, there is a recent spike in buying volume, reinforcing the likelihood of a continued upward move. The stochastic is neutral, but the overall confluence supports an UP trade.",
    "entryPrice": 118415.06,
    "result": "WRONG",
    "confirmedAt": "21:06:11",
    "endPrice": 118311.99,
    "checkAt": 1753301158347
  },
  {
    "timestamp": 1753301759995,
    "signalTime": "23/07/2025, 21:15:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is above 50, supporting upward movement. The presence of a hammer candle pattern suggests a potential reversal or continuation of the uptrend after a pullback to EMA30. Stochastic is in the overbought region, which can be risky, but given the overall trend and support from the EMA, an upward move is more likely. The proximity to the Fib 0.618 level adds to the potential for a bounce. Volume is neutral, not contradicting the trend.",
    "entryPrice": 118471,
    "result": "WRONG",
    "confirmedAt": "21:21:13",
    "endPrice": 118359.99,
    "checkAt": 1753302059995
  },
  {
    "timestamp": 1753302057962,
    "signalTime": "23/07/2025, 21:20:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The recent pullback to EMA30 with a doji candle suggests indecision, but the volume spike on the reversal candle and the buying volume bias support a potential continuation of the uptrend. The stochastic is oversold, which could lead to a bounce. However, the RSI is below 50, indicating caution. Overall, the confluences suggest a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118336.36,
    "result": "WRONG",
    "confirmedAt": "21:26:14",
    "endPrice": 118261.18,
    "checkAt": 1753302357962
  },
  {
    "timestamp": 1753304216641,
    "signalTime": "23/07/2025, 21:56:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, and a shooting star pattern indicates potential bearish reversal after a pullback. RSI is neutral, but the price action near EMA30 suggests resistance. Stochastic is not overbought, but the trend and pattern confluence support a downward move.",
    "entryPrice": 117917.33,
    "result": "WRONG",
    "confirmedAt": "22:02:15",
    "endPrice": 117938.05,
    "checkAt": 1753304516641
  },
  {
    "timestamp": 1753305780215,
    "signalTime": "23/07/2025, 22:23:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation lower. The stochastic is in the oversold region but not yet signaling a reversal. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level near 0.618 may provide some support, but the confluence of other factors suggests a downward bias.",
    "entryPrice": 117718.05,
    "result": "CORRECT",
    "confirmedAt": "22:28:17",
    "endPrice": 117452.71,
    "checkAt": 1753306080215
  },
  {
    "timestamp": 1753306738164,
    "signalTime": "23/07/2025, 22:38:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA30, which often acts as resistance in a downtrend. Stochastic %K is below %D, suggesting potential continuation of the downward move. Despite the neutral volume, the overall indicators support a bearish outlook.",
    "entryPrice": 117603.64,
    "result": "WRONG",
    "confirmedAt": "22:44:18",
    "endPrice": 117906.45,
    "checkAt": 1753307038164
  },
  {
    "timestamp": 1753307040362,
    "signalTime": "23/07/2025, 22:44:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 61.21, suggesting potential overbought conditions in a downtrend. The Stochastic is also extremely high, indicating possible overbought conditions. The price action shows a pullback touching EMA30, which could act as resistance in a downtrend. Despite the doji candle pattern indicating indecision, the confluence of a downtrend, high RSI, and high Stochastic suggests a continuation of the downtrend is more likely.",
    "entryPrice": 117951.19,
    "result": "WRONG",
    "confirmedAt": "22:49:20",
    "endPrice": 118041.99,
    "checkAt": 1753307340362
  },
  {
    "timestamp": 1753307217348,
    "signalTime": "23/07/2025, 22:46:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price is currently in a pullback phase touching EMA30, which often acts as resistance in a downtrend. The RSI is relatively high at 60.84, suggesting limited upside potential. Stochastic is overbought, indicating a potential for a price decrease. The lack of a candle pattern and normal volume spike reduce the confidence slightly, but the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 117979.8,
    "result": "WRONG",
    "confirmedAt": "22:52:21",
    "endPrice": 118074.78,
    "checkAt": 1753307517348
  },
  {
    "timestamp": 1753307277515,
    "signalTime": "23/07/2025, 22:47:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price action shows a pullback touching EMA30, suggesting a potential continuation of the downtrend. The Stochastic indicator is in the overbought region, which often precedes a price drop. Despite the RSI being above 60, the presence of a Doji candle pattern suggests indecision, but given the dominant downtrend, a downward move is more likely. Volume is neutral, not contradicting the trend.",
    "entryPrice": 117975.24,
    "result": "WRONG",
    "confirmedAt": "22:53:22",
    "endPrice": 118074.78,
    "checkAt": 1753307577515
  },
  {
    "timestamp": 1753307337527,
    "signalTime": "23/07/2025, 22:48:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high, suggesting potential overbought conditions. Stochastic is also in the overbought region, indicating a possible reversal or continuation of the downtrend. Despite the price touching EMA30, the lack of a volume spike and the presence near the Fib 0.618 level support the continuation of the downtrend. Therefore, the likelihood of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 118037.52,
    "result": "WRONG",
    "confirmedAt": "22:54:23",
    "endPrice": 118115.13,
    "checkAt": 1753307637527
  },
  {
    "timestamp": 1753309437810,
    "signalTime": "23/07/2025, 23:23:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is near overbought but not extreme, suggesting continued upward momentum. The hammer pattern at the EMA30 support level indicates a potential bullish reversal after the pullback. Stochastic is overbought, but the %K is above %D, supporting upward momentum. Volume is neutral, not contradicting the trend.",
    "entryPrice": 118364.06,
    "result": "CORRECT",
    "confirmedAt": "23:29:24",
    "endPrice": 118551.71,
    "checkAt": 1753309737810
  },
  {
    "timestamp": 1753309739355,
    "signalTime": "23/07/2025, 23:28:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 80,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The RSI is close to overbought but still supports upward momentum. The hammer candle pattern and the volume spike on the reversal candle suggest a potential continuation of the uptrend. The stochastic is in the overbought region, but the high %K and %D values indicate strong bullish momentum. Overall, the confluence of these factors supports an upward movement in the next 5 minutes.",
    "entryPrice": 118440.08,
    "result": "CORRECT",
    "confirmedAt": "23:34:25",
    "endPrice": 118578.14,
    "checkAt": 1753310039355
  },
  {
    "timestamp": 1753311838022,
    "signalTime": "24/07/2025, 00:03:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is upward with EMA30 above EMA100. The RSI is below overbought levels, suggesting room for upward movement. The price has pulled back to EMA30, which often acts as support in an uptrend. The volume spike on the reversal candle indicates strong buying interest. Although the stochastic is overbought, the trend and volume suggest a continuation of the upward movement.",
    "entryPrice": 118621.25,
    "result": "CORRECT",
    "confirmedAt": "00:09:28",
    "endPrice": 118697.73,
    "checkAt": 1753312138022
  },
  {
    "timestamp": 1753315378754,
    "signalTime": "24/07/2025, 01:02:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 > EMA100. The RSI is not overbought, suggesting room for upward movement. The price has pulled back to the EMA30, which often acts as support in an uptrend. The stochastic is not overbought, and there is a recent spike in buying volume, indicating bullish sentiment. The proximity to the Fib 0.618 level adds to the potential for a bounce. Overall, these factors suggest a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118740.35,
    "result": "WRONG",
    "confirmedAt": "01:08:00",
    "endPrice": 118719.66,
    "checkAt": 1753315678754
  },
  {
    "timestamp": 1753316280320,
    "signalTime": "24/07/2025, 01:18:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to touch EMA30, which often acts as support in an uptrend. The RSI is above 50, indicating bullish momentum, and the hammer candle pattern suggests a potential reversal to the upside. The stochastic is in the overbought region but not extremely so, which aligns with the uptrend. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118731.18,
    "result": "CORRECT",
    "confirmedAt": "01:23:01",
    "endPrice": 118930.76,
    "checkAt": 1753316580320
  },
  {
    "timestamp": 1753320239633,
    "signalTime": "24/07/2025, 02:23:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as a support level in an uptrend. The hammer candle pattern suggests a potential reversal back to the upside. Although the RSI is neutral, the proximity to the Fibonacci 0.618 level supports a continuation of the upward trend. The Stochastic is not overbought, indicating room for upward movement. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118959.99,
    "result": "CORRECT",
    "confirmedAt": "02:29:03",
    "endPrice": 118999.99,
    "checkAt": 1753320539633
  },
  {
    "timestamp": 1753320959415,
    "signalTime": "24/07/2025, 02:35:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests potential bearish reversal. The RSI is below 50, indicating bearish momentum. Stochastic %K is extremely low, suggesting oversold conditions but not yet showing a reversal signal. The price has pulled back to EMA30, which could act as resistance. The proximity to the Fib 0.618 level may also act as a resistance. Given these factors, a short-term down movement is more likely.",
    "entryPrice": 118871.11,
    "result": "WRONG",
    "confirmedAt": "02:41:04",
    "endPrice": 118939.17,
    "checkAt": 1753321259415
  },
  {
    "timestamp": 1753321079898,
    "signalTime": "24/07/2025, 02:37:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to touch EMA30, which often acts as support in an uptrend. The RSI is neutral but not overbought, and there is a recent spike in buying volume, indicating potential bullish momentum. The stochastic is not in the overbought zone, and the price is near the Fib 0.618 level, which can act as a support. These factors suggest a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118921.23,
    "result": "CORRECT",
    "confirmedAt": "02:43:05",
    "endPrice": 119035.04,
    "checkAt": 1753321379898
  },
  {
    "timestamp": 1753321321810,
    "signalTime": "24/07/2025, 02:42:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has recently pulled back to the EMA30, which often acts as support in an uptrend. The RSI is above 50, suggesting bullish momentum. The recent spike in buying volume indicates potential continued upward movement. Stochastic is not overbought, providing room for upward movement. Overall, the confluence of indicators suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 119002.03,
    "result": "WRONG",
    "confirmedAt": "02:47:06",
    "endPrice": 118982.99,
    "checkAt": 1753321621810
  },
  {
    "timestamp": 1753321559701,
    "signalTime": "24/07/2025, 02:45:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support in an uptrend. The hammer candle pattern suggests a potential reversal back up. Although the RSI is neutral, the stochastic is near overbought, indicating potential continuation of the trend. The price is near the Fib 0.618 level, which is a strong support zone. Despite the neutral volume, the confluence of these factors suggests a higher probability of price moving up.",
    "entryPrice": 118999.99,
    "result": "CORRECT",
    "confirmedAt": "02:51:07",
    "endPrice": 119079.85,
    "checkAt": 1753321859701
  },
  {
    "timestamp": 1753322221480,
    "signalTime": "24/07/2025, 02:57:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is above 60, suggesting bullish momentum. The price has pulled back to the EMA30, which often acts as support in an uptrend. Although the stochastic is overbought, the overall trend and RSI support a continuation upwards. The proximity to the Fib 0.618 level could provide additional support for an upward move.",
    "entryPrice": 119088.74,
    "result": "WRONG",
    "confirmedAt": "03:02:08",
    "endPrice": 119068.64,
    "checkAt": 1753322521480
  },
  {
    "timestamp": 1753322579690,
    "signalTime": "24/07/2025, 03:02:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as a support in an uptrend. The hammer candle pattern suggests a potential reversal back upwards. RSI is neutral, allowing room for upward movement. Stochastic indicates potential upward momentum as %K is above %D. The proximity to the Fib 0.618 level, a common retracement level, adds to the potential for a bounce. However, the volume is neutral, slightly reducing confidence.",
    "entryPrice": 119059.7,
    "result": "WRONG",
    "confirmedAt": "03:08:09",
    "endPrice": 119016.43,
    "checkAt": 1753322879690
  },
  {
    "timestamp": 1753323779771,
    "signalTime": "24/07/2025, 03:22:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is oversold but not showing a clear reversal signal. The price action shows a pullback to EMA30, which could act as resistance in a downtrend. The lack of a volume spike and absence of a bullish candle pattern reduce the likelihood of an immediate reversal.",
    "entryPrice": 118847.47,
    "result": "CORRECT",
    "confirmedAt": "03:28:10",
    "endPrice": 118808.45,
    "checkAt": 1753324079771
  },
  {
    "timestamp": 1753324500911,
    "signalTime": "24/07/2025, 03:35:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price action shows a pullback to EMA30, which often acts as a resistance in a downtrend. The RSI is neutral, not indicating overbought or oversold conditions, and the stochastic is in a neutral position as well. The lack of a candle pattern and normal volume suggests no strong reversal signals. Therefore, the confluence of a downtrend and resistance at EMA30 suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 118911.33,
    "result": "WRONG",
    "confirmedAt": "03:40:11",
    "endPrice": 118930.21,
    "checkAt": 1753324800911
  },
  {
    "timestamp": 1753325160617,
    "signalTime": "24/07/2025, 03:46:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is at 67.16, indicating bullish momentum, and the presence of a hammer candle pattern suggests a potential reversal to the upside. Although the stochastic is overbought, it can remain in that state during strong trends. The proximity to the Fib 0.618 level also supports a continuation of the trend. Overall, the confluence of these factors suggests a higher likelihood of the price being above the current level in the next 5 minutes.",
    "entryPrice": 119045.12,
    "result": "WRONG",
    "confirmedAt": "03:51:12",
    "endPrice": 118994.05,
    "checkAt": 1753325460617
  },
  {
    "timestamp": 1753325220661,
    "signalTime": "24/07/2025, 03:47:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is near overbought but not extreme, suggesting continued strength. The hammer candle pattern at the EMA30 support level indicates potential bullish reversal after a pullback. Stochastic is at maximum, supporting bullish continuation. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Overall, the setup favors an upward move in the next 5 minutes.",
    "entryPrice": 119058.35,
    "result": "WRONG",
    "confirmedAt": "03:52:13",
    "endPrice": 118956.91,
    "checkAt": 1753325520661
  },
  {
    "timestamp": 1753326000652,
    "signalTime": "24/07/2025, 04:00:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the RSI is below 50, suggesting weak bullish momentum. The presence of a doji candle and a volume spike on a reversal candle indicates indecision and potential reversal. The stochastic is in the oversold region, but the recent selling volume spike and the price touching the EMA30 suggest a possible short-term bearish move. Additionally, the price is near the Fib 0.618 level, which can act as resistance.",
    "entryPrice": 118934.98,
    "result": "WRONG",
    "confirmedAt": "04:05:14",
    "endPrice": 119019.32,
    "checkAt": 1753326300652
  },
  {
    "timestamp": 1753326421433,
    "signalTime": "24/07/2025, 04:07:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support. The hammer candle pattern suggests a potential reversal back up. The RSI is neutral, but the stochastic is near overbought, indicating potential for continued upward movement. The proximity to the Fib 0.618 level adds confluence for a bounce. Overall, the confluence of trend, support, and candlestick pattern suggests an upward move.",
    "entryPrice": 118987.04,
    "result": "CORRECT",
    "confirmedAt": "04:12:15",
    "endPrice": 118996.49,
    "checkAt": 1753326721433
  },
  {
    "timestamp": 1753326842023,
    "signalTime": "24/07/2025, 04:14:02",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support. The RSI is neutral but above 50, indicating potential for further upward movement. The hammer candle pattern suggests a reversal or continuation of the uptrend. Stochastic is in the upper range, supporting bullish momentum. The price is near the Fib 0.618 level, which is a strong retracement level, suggesting a potential bounce. Despite the neutral volume, the confluence of these factors leans towards an upward movement.",
    "entryPrice": 118995.06,
    "result": "CORRECT",
    "confirmedAt": "04:19:16",
    "endPrice": 119043.26,
    "checkAt": 1753327142023
  },
  {
    "timestamp": 1753327141946,
    "signalTime": "24/07/2025, 04:19:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has pulled back to EMA30, which often acts as support in an uptrend. RSI is above 60, indicating bullish momentum. The Stochastic is overbought, but this can persist in strong trends. The presence of a Doji and volume spike suggests indecision but also potential for continuation. The proximity to the Fib 0.618 level adds support to the bullish bias.",
    "entryPrice": 119043.26,
    "result": "CORRECT",
    "confirmedAt": "04:24:16",
    "endPrice": 119088.12,
    "checkAt": 1753327441946
  },
  {
    "timestamp": 1753327980636,
    "signalTime": "24/07/2025, 04:33:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market setup shows a strong uptrend with EMA30 above EMA100, a hammer candle pattern indicating potential reversal, and a volume spike suggesting buying interest. RSI is moderately bullish, and the price is near the Fib 0.618 level, which often acts as support. Although the Stochastic is not in the oversold region, the overall confluence supports a continuation of the uptrend.",
    "entryPrice": 119152.37,
    "result": "WRONG",
    "confirmedAt": "04:38:18",
    "endPrice": 119014.54,
    "checkAt": 1753328280636
  },
  {
    "timestamp": 1753328102494,
    "signalTime": "24/07/2025, 04:35:02",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is above 50, indicating bullish momentum. The hammer candle pattern suggests a potential reversal to the upside. Although volume is neutral, the confluence of trend, support, and candlestick pattern supports an upward move.",
    "entryPrice": 119158.36,
    "result": "WRONG",
    "confirmedAt": "04:40:18",
    "endPrice": 118965.36,
    "checkAt": 1753328402494
  },
  {
    "timestamp": 1753328401968,
    "signalTime": "24/07/2025, 04:40:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests a potential reversal. The RSI is low at 36.63, indicating bearish momentum. The Stochastic is also oversold, but the %K is at 0, suggesting limited upward momentum. The price action shows a pullback to EMA30, which could act as resistance. The proximity to the Fib 0.618 level further supports a potential reversal. Therefore, a short-term bearish move is likely.",
    "entryPrice": 118974.51,
    "result": "CORRECT",
    "confirmedAt": "04:45:19",
    "endPrice": 118928,
    "checkAt": 1753328701968
  },
  {
    "timestamp": 1753329120617,
    "signalTime": "24/07/2025, 04:52:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The market is in a downtrend with EMA30 below EMA100. The RSI is oversold, but the presence of a shooting star candle pattern suggests bearish momentum. The Stochastic is also in the oversold region, indicating potential for further downside. The MACD histogram is not provided, but overall indicators align with a continuation of the downtrend.",
    "entryPrice": 118678.14,
    "result": "CORRECT",
    "confirmedAt": "04:57:20",
    "endPrice": 118572.79,
    "checkAt": 1753329420617
  },
  {
    "timestamp": 1753330082105,
    "signalTime": "24/07/2025, 05:08:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. Stochastic is not in an oversold condition, indicating there is room for further downside. The lack of a volume spike suggests no strong buying interest. Therefore, the probability of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 118465.2,
    "result": "CORRECT",
    "confirmedAt": "05:13:21",
    "endPrice": 118457.76,
    "checkAt": 1753330382105
  },
  {
    "timestamp": 1753330200606,
    "signalTime": "24/07/2025, 05:10:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The presence of a shooting star candle pattern near the EMA30 resistance level indicates potential reversal back to the downside. The MACD histogram is not specified, but the stochastic is showing a slight bearish crossover. The price action touched EMA30 and is likely to continue the downtrend. Despite neutral volume, the confluence of these factors suggests a higher probability of price moving down.",
    "entryPrice": 118410.97,
    "result": "WRONG",
    "confirmedAt": "05:15:22",
    "endPrice": 118565.52,
    "checkAt": 1753330500606
  },
  {
    "timestamp": 1753333921636,
    "signalTime": "24/07/2025, 06:12:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The presence of a shooting star candle pattern near the EMA30 indicates potential reversal to the downside after a pullback. Stochastic is in the oversold region but not showing a strong reversal signal. Volume is neutral, not contradicting the downtrend. These factors suggest a continuation of the downtrend in the next 5 minutes.",
    "entryPrice": 117725.04,
    "result": "WRONG",
    "confirmedAt": "06:17:24",
    "endPrice": 117763.99,
    "checkAt": 1753334221636
  },
  {
    "timestamp": 1753334881385,
    "signalTime": "24/07/2025, 06:28:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, and the RSI is below 50, indicating bearish momentum. The doji candle at the EMA30 suggests indecision but not a reversal. Stochastic is oversold but not yet signaling a clear reversal. Given these factors, the probability favors continuation of the downtrend in the short term.",
    "entryPrice": 117574.09,
    "result": "WRONG",
    "confirmedAt": "06:33:26",
    "endPrice": 117722.35,
    "checkAt": 1753335181385
  },
  {
    "timestamp": 1753336021638,
    "signalTime": "24/07/2025, 06:47:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests a potential reversal or continuation of the downtrend. RSI is relatively neutral but not oversold, and the price action indicates a pullback to the EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, suggesting a potential reversal. The confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117858.07,
    "result": "CORRECT",
    "confirmedAt": "06:52:27",
    "endPrice": 117688,
    "checkAt": 1753336321638
  },
  {
    "timestamp": 1753336440268,
    "signalTime": "24/07/2025, 06:54:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The Stochastic is in the oversold region but not yet showing a clear reversal signal. The neutral volume and lack of a bullish candle pattern further support a continuation of the downtrend.",
    "entryPrice": 117701.99,
    "result": "CORRECT",
    "confirmedAt": "06:59:28",
    "endPrice": 117625.72,
    "checkAt": 1753336740268
  },
  {
    "timestamp": 1753337161851,
    "signalTime": "24/07/2025, 07:06:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent volume spike on a reversal candle indicates strong selling pressure. The price action shows a pullback touching EMA30, which often acts as resistance in a downtrend. The stochastic is neutral, but the overall indicators suggest a continuation of the downtrend.",
    "entryPrice": 117622.28,
    "result": "WRONG",
    "confirmedAt": "07:11:29",
    "endPrice": 117711.88,
    "checkAt": 1753337461851
  },
  {
    "timestamp": 1753337882182,
    "signalTime": "24/07/2025, 07:18:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. Despite the hammer pattern and pullback to EMA30, the recent volume spike is on a red candle, indicating strong selling pressure. Stochastic %K is low, but %D is above %K, which often suggests a continuation of the current trend. The confluence of these factors supports a bearish outlook.",
    "entryPrice": 117548.46,
    "result": "WRONG",
    "confirmedAt": "07:23:30",
    "endPrice": 117808.14,
    "checkAt": 1753338182182
  },
  {
    "timestamp": 1753338362917,
    "signalTime": "24/07/2025, 07:26:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high, suggesting a potential overbought condition in a downtrend. The stochastic is also in the overbought region, indicating a possible reversal. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. Despite the lack of a candle pattern and neutral volume, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 117827.22,
    "result": "CORRECT",
    "confirmedAt": "07:31:31",
    "endPrice": 117783.05,
    "checkAt": 1753338662917
  },
  {
    "timestamp": 1753338664489,
    "signalTime": "24/07/2025, 07:31:04",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is neutral, suggesting no strong momentum shift. The price is pulling back to the EMA30, which often acts as resistance in a downtrend. Stochastic is overbought, indicating a potential for a downward move. The lack of a volume spike suggests no strong buying pressure. These factors combined suggest a continuation of the downtrend.",
    "entryPrice": 117823.78,
    "result": "CORRECT",
    "confirmedAt": "07:36:32",
    "endPrice": 117755.96,
    "checkAt": 1753338964489
  },
  {
    "timestamp": 1753338781934,
    "signalTime": "24/07/2025, 07:33:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively neutral, but the price action shows a pullback to the EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, suggesting potential for a downward move. The lack of a strong volume spike and the proximity to the Fib 0.618 level add some caution, but the trend and stochastic indicators provide a stronger case for a downward move.",
    "entryPrice": 117841.27,
    "result": "CORRECT",
    "confirmedAt": "07:38:03",
    "endPrice": 117649.76,
    "checkAt": 1753339081934
  },
  {
    "timestamp": 1753339141776,
    "signalTime": "24/07/2025, 07:39:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and the presence of a shooting star candle pattern suggests bearish sentiment. RSI is below 50, indicating potential continuation of the downtrend. Stochastic is oversold, but the overall trend and candle pattern suggest a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 117620.02,
    "result": "WRONG",
    "confirmedAt": "08:23:42",
    "endPrice": 118015.26,
    "checkAt": 1753339441776
  },
  {
    "timestamp": 1753350738305,
    "signalTime": "24/07/2025, 10:52:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, indicating bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. The Stochastic is in the oversold region but not showing a clear reversal signal. The MACD histogram is not provided, but other indicators suggest continuation of the downtrend. The Fib level near 0.618 could provide some support, but the confluence of bearish signals suggests a higher probability of price moving down.",
    "entryPrice": 118383.26,
    "result": "WRONG",
    "confirmedAt": "10:57:47",
    "endPrice": 118477.26,
    "checkAt": 1753351038305
  },
  {
    "timestamp": 1753350978321,
    "signalTime": "24/07/2025, 10:56:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100. RSI is below 50, indicating bearish momentum. The price action shows a pullback touching EMA30, suggesting a potential continuation of the downtrend. Stochastic is not in oversold territory, providing room for further downside. The proximity to the 0.618 Fib level could act as resistance. Volume is neutral, not contradicting the downtrend bias.",
    "entryPrice": 118430.72,
    "result": "WRONG",
    "confirmedAt": "11:01:18",
    "endPrice": 118501.9,
    "checkAt": 1753351278321
  },
  {
    "timestamp": 1753351998234,
    "signalTime": "24/07/2025, 11:13:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is in the oversold region but not yet showing a reversal signal. The Doji candle pattern and neutral volume suggest indecision, but the pullback to EMA30 in a downtrend often results in continuation. The proximity to the Fib 0.618 level adds a potential resistance point, supporting a bearish outlook.",
    "entryPrice": 118357.79,
    "result": "CORRECT",
    "confirmedAt": "11:18:20",
    "endPrice": 118255.78,
    "checkAt": 1753352298234
  },
  {
    "timestamp": 1753354398096,
    "signalTime": "24/07/2025, 11:53:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 61.38, suggesting potential overbought conditions in a downtrend. The price has recently touched EMA30, which could act as resistance in a downtrend. Stochastic is in the overbought region, further supporting a potential downward move. Despite the lack of a volume spike, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 118327.21,
    "result": "WRONG",
    "confirmedAt": "11:58:23",
    "endPrice": 118398.24,
    "checkAt": 1753354698096
  },
  {
    "timestamp": 1753354518639,
    "signalTime": "24/07/2025, 11:55:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 62.16, suggesting potential overbought conditions in a downtrend. The stochastic is also in the overbought region, reinforcing the potential for a downward move. The doji pattern and neutral volume suggest indecision, but the prevailing trend and indicators favor a continuation of the downtrend.",
    "entryPrice": 118344,
    "result": "WRONG",
    "confirmedAt": "12:00:24",
    "endPrice": 118392.84,
    "checkAt": 1753354818639
  },
  {
    "timestamp": 1753354759375,
    "signalTime": "24/07/2025, 11:59:19",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 66.46, suggesting potential overbought conditions. The stochastic is extremely high, indicating a possible reversal or continuation of the downtrend. The presence of a Doji at a pullback to EMA30 suggests indecision, but given the downtrend, it may resolve downward. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. Volume is neutral, not contradicting the downtrend bias.",
    "entryPrice": 118407.05,
    "result": "WRONG",
    "confirmedAt": "12:04:25",
    "endPrice": 118435.7,
    "checkAt": 1753355059375
  },
  {
    "timestamp": 1753354878081,
    "signalTime": "24/07/2025, 12:01:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 65.05, suggesting potential overbought conditions. The stochastic is also in the overbought region, indicating possible downward pressure. Despite the price touching EMA30, the lack of a strong volume spike and the presence of a downtrend suggest a continuation of the downward movement.",
    "entryPrice": 118412.86,
    "result": "WRONG",
    "confirmedAt": "12:06:26",
    "endPrice": 118421.58,
    "checkAt": 1753355178081
  },
  {
    "timestamp": 1753355000051,
    "signalTime": "24/07/2025, 12:03:20",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 66.57, suggesting potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, indicating a possible reversal or continuation of the downtrend. The price action shows a pullback to the EMA30, which often acts as resistance in a downtrend. Despite the lack of a significant volume spike, the confluence of indicators suggests a higher probability of the price moving down.",
    "entryPrice": 118430.64,
    "result": "CORRECT",
    "confirmedAt": "12:08:28",
    "endPrice": 118362.59,
    "checkAt": 1753355300051
  },
  {
    "timestamp": 1753355058313,
    "signalTime": "24/07/2025, 12:04:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. Despite the hammer pattern suggesting a potential reversal, the RSI is relatively high, indicating overbought conditions. The stochastic is also in the overbought region, suggesting limited upside potential. The price touching EMA30 during a downtrend typically acts as resistance. The MACD histogram is not provided, but the lack of a volume spike suggests no strong buying pressure. Therefore, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118435.7,
    "result": "CORRECT",
    "confirmedAt": "12:09:29",
    "endPrice": 118425.89,
    "checkAt": 1753355358313
  },
  {
    "timestamp": 1753356080017,
    "signalTime": "24/07/2025, 12:21:20",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is below the overbought level, suggesting room for further upward movement. The hammer candle pattern at the EMA30 support level suggests a potential reversal to the upside. Although the stochastic is in the overbought region, the overall trend and price action support an upward move. Volume remains neutral, not contradicting the bullish setup.",
    "entryPrice": 118683.77,
    "result": "WRONG",
    "confirmedAt": "12:26:30",
    "endPrice": 118643.99,
    "checkAt": 1753356380017
  },
  {
    "timestamp": 1753644027467,
    "signalTime": "27/07/2025, 20:20:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend, the presence of a shooting star candle pattern, a recent volume spike on a reversal candle, and the RSI being below 50 suggest potential short-term bearish pressure. Additionally, the price action touching the EMA30 and the stochastic being below 50 indicate a possible continuation of the pullback. The proximity to the Fib 0.618 level further supports a potential short-term reversal.",
    "entryPrice": 3843.47,
    "result": "WRONG",
    "confirmedAt": "20:25:55",
    "endPrice": 118970.1,
    "checkAt": 1753644327467
  },
  {
    "timestamp": 1753644270425,
    "signalTime": "27/07/2025, 20:24:30",
    "symbol": "ETHUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and a bullish engulfing pattern suggests a potential continuation of the trend. The RSI is below 50, indicating potential room for upward movement. The price has pulled back to the EMA30, which often acts as support in an uptrend. Despite the stochastic being in the oversold region, the overall confluence supports an upward move.",
    "entryPrice": 3840.55,
    "result": "CORRECT",
    "confirmedAt": "20:29:55",
    "endPrice": 118941.17,
    "checkAt": 1753644570425
  },
  {
    "timestamp": 1753647149072,
    "signalTime": "27/07/2025, 21:12:29",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 60.78, suggesting potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, indicating a possible reversal. The doji candle pattern near a resistance level (EMA30) suggests indecision, but in the context of a downtrend, it could lead to a continuation downward. The price action has touched EMA30, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the other indicators suggest a higher probability of a downward move.",
    "entryPrice": 3842.47,
    "result": "WRONG",
    "confirmedAt": "21:17:57",
    "endPrice": 119077,
    "checkAt": 1753647449072
  },
  {
    "timestamp": 1753647207254,
    "signalTime": "27/07/2025, 21:13:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish engulfing candle pattern, and a pullback touching EMA30. Despite the RSI being above 50, the high stochastic %K and %D values suggest overbought conditions, aligning with the bearish trend. The neutral volume and proximity to the Fib 0.618 level add some risk, but overall confluence favors a downward move.",
    "entryPrice": 3841.13,
    "result": "WRONG",
    "confirmedAt": "21:18:28",
    "endPrice": 119076.99,
    "checkAt": 1753647507254
  },
  {
    "timestamp": 1753647510181,
    "signalTime": "27/07/2025, 21:18:30",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The shooting star candle pattern suggests a potential reversal or continuation of the downtrend after a pullback to EMA30. RSI is below 50, indicating bearish momentum. Stochastic %K is below %D and in the oversold region, which could suggest a potential bounce, but given the overall downtrend and the shooting star pattern, the bearish signals are stronger. The price is near the Fib 0.618 level, which could act as resistance. Volume is neutral, not contradicting the downtrend. Therefore, a DOWN trade is more likely.",
    "entryPrice": 3834.51,
    "result": "WRONG",
    "confirmedAt": "21:23:59",
    "endPrice": 119012.92,
    "checkAt": 1753647810181
  },
  {
    "timestamp": 1753647567217,
    "signalTime": "27/07/2025, 21:19:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish engulfing pattern, and RSI below 50 indicating bearish momentum. The stochastic is oversold, but the overall confluence supports a continuation of the downtrend.",
    "entryPrice": 3832.79,
    "result": "WRONG",
    "confirmedAt": "21:24:30",
    "endPrice": 119007.61,
    "checkAt": 1753647867217
  },
  {
    "timestamp": 1753647628918,
    "signalTime": "27/07/2025, 21:20:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The Stochastic is also in the oversold region, but given the strong downtrend, it may remain oversold for a while. The lack of a volume spike and the neutral MACD histogram suggest no strong reversal signals. Therefore, the likelihood of the price continuing downwards is higher.",
    "entryPrice": 3832.13,
    "result": "WRONG",
    "confirmedAt": "21:25:31",
    "endPrice": 119009.09,
    "checkAt": 1753647928918
  },
  {
    "timestamp": 1753648227313,
    "signalTime": "27/07/2025, 21:30:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100. The bearish engulfing pattern and RSI below 50 support further downside. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. Stochastic is not oversold, allowing room for further decline. Volume is neutral, not contradicting the bearish bias.",
    "entryPrice": 3832.01,
    "result": "WRONG",
    "confirmedAt": "21:35:32",
    "endPrice": 118899.61,
    "checkAt": 1753648527313
  },
  {
    "timestamp": 1753649307932,
    "signalTime": "27/07/2025, 21:48:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal continuation. The stochastic is not in oversold territory, suggesting room for further downside. The MACD histogram is not provided, but given the other indicators, a DOWN trade is more likely.",
    "entryPrice": 3827.56,
    "result": "WRONG",
    "confirmedAt": "21:53:33",
    "endPrice": 118807.91,
    "checkAt": 1753649607932
  },
  {
    "timestamp": 1753649848114,
    "signalTime": "27/07/2025, 21:57:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30 level, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the bearish move. The stochastic is not in an overbought condition, allowing room for further downside. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. Given these factors, a DOWN trade is more likely.",
    "entryPrice": 3824.46,
    "result": "WRONG",
    "confirmedAt": "22:02:35",
    "endPrice": 118835.1,
    "checkAt": 1753650148114
  },
  {
    "timestamp": 1753650328108,
    "signalTime": "27/07/2025, 22:05:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and a bearish engulfing pattern has formed. The RSI is below 50, indicating bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is not in oversold territory, suggesting more room for downside. The setup aligns with the overall bearish trend, despite the neutral volume.",
    "entryPrice": 3824.83,
    "result": "WRONG",
    "confirmedAt": "22:10:36",
    "endPrice": 118784.53,
    "checkAt": 1753650628108
  },
  {
    "timestamp": 1753650627199,
    "signalTime": "27/07/2025, 22:10:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and a bearish engulfing pattern has formed. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA30, which often acts as resistance in a downtrend. Stochastic is below 50, supporting the bearish sentiment. Despite the neutral volume, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 3823.67,
    "result": "WRONG",
    "confirmedAt": "22:15:37",
    "endPrice": 118733.58,
    "checkAt": 1753650927199
  },
  {
    "timestamp": 1753650808149,
    "signalTime": "27/07/2025, 22:13:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. Stochastic is oversold but not showing a strong reversal signal. The lack of a volume spike and absence of a bullish candle pattern reduces the likelihood of an immediate upward reversal.",
    "entryPrice": 3823.05,
    "result": "WRONG",
    "confirmedAt": "22:18:38",
    "endPrice": 118773.99,
    "checkAt": 1753651108149
  },
  {
    "timestamp": 1753650928135,
    "signalTime": "27/07/2025, 22:15:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is in the oversold region but not yet showing a clear reversal signal. The doji candle pattern and neutral volume suggest indecision, but the pullback to EMA30 in a downtrend often leads to continuation. The proximity to the Fib 0.618 level could provide some support, but the confluence of indicators leans towards a short-term continuation of the downtrend.",
    "entryPrice": 3822.61,
    "result": "WRONG",
    "confirmedAt": "22:20:39",
    "endPrice": 118837.56,
    "checkAt": 1753651228135
  },
  {
    "timestamp": 1753652188253,
    "signalTime": "27/07/2025, 22:36:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The recent bearish engulfing pattern suggests further downside potential. The RSI is neutral but leaning slightly towards bearish territory. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the stochastic is not in an overbought condition, allowing room for further downside. The proximity to the Fib 0.618 level suggests a potential reversal, but the confluence of other indicators supports a short-term bearish outlook.",
    "entryPrice": 3825.75,
    "result": "WRONG",
    "confirmedAt": "22:41:40",
    "endPrice": 119021,
    "checkAt": 1753652488253
  },
  {
    "timestamp": 1753652248316,
    "signalTime": "27/07/2025, 22:37:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, a bearish engulfing pattern has formed, and the RSI is below 50 indicating bearish momentum. The price action shows a pullback touching EMA30, suggesting a continuation of the downtrend. Stochastic is also in a bearish position. Despite the neutral volume, the overall confluence supports a DOWN trade.",
    "entryPrice": 3824.31,
    "result": "WRONG",
    "confirmedAt": "22:42:42",
    "endPrice": 119082.59,
    "checkAt": 1753652548316
  },
  {
    "timestamp": 1753653207815,
    "signalTime": "27/07/2025, 22:53:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 63.32, suggesting potential overbought conditions in a downtrend. The doji candle pattern and touch of EMA30 indicate indecision and a possible continuation of the downtrend. Stochastic is in the overbought region, further supporting a potential downward move. Although volume is neutral, the confluence of these indicators suggests a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 3832.85,
    "result": "WRONG",
    "confirmedAt": "22:58:42",
    "endPrice": 119226.54,
    "checkAt": 1753653507815
  },
  {
    "timestamp": 1753682749008,
    "signalTime": "28/07/2025, 07:05:49",
    "symbol": "ETHUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and a bullish engulfing pattern suggests potential upward momentum. The RSI is below 50, indicating room for upward movement. The stochastic is oversold, which may lead to a bounce. Although volume is neutral, the confluence of trend and pattern supports an upward move.",
    "entryPrice": 3929.83,
    "result": "PENDING",
    "confirmedAt": null,
    "endPrice": null,
    "checkAt": 1753683049008
  }
]
[
  {
    "timestamp": 1753277394399,
    "signalTime": "23/07/2025, 14:29:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100. The presence of a shooting star candle pattern at a pullback to EMA30 suggests potential continuation of the downtrend. Stochastic is overbought, indicating possible downward momentum. RSI is neutral, and volume is normal, providing no strong counter signals.",
    "entryPrice": 118088,
    "result": "CORRECT",
    "confirmedAt": "14:31:09",
    "endPrice": 117999.99,
    "checkAt": 1753277454399
  },
  {
    "timestamp": 1753277694521,
    "signalTime": "23/07/2025, 14:34:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback touching EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but with %K below %D, indicating continued bearish pressure. Despite the neutral volume, the confluence of these indicators suggests a higher probability of the price moving down.",
    "entryPrice": 117921.99,
    "result": "CORRECT",
    "confirmedAt": "14:36:10",
    "endPrice": 117850.01,
    "checkAt": 1753277754521
  },
  {
    "timestamp": 1753277755943,
    "signalTime": "23/07/2025, 14:35:55",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The prevailing trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region, but not yet showing a strong reversal signal. The presence of a Doji indicates indecision, but in the context of a downtrend, it may suggest continuation rather than reversal. Given these factors, the likelihood of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 117904.54,
    "result": "CORRECT",
    "confirmedAt": "14:37:11",
    "endPrice": 117816.6,
    "checkAt": 1753277815943
  },
  {
    "timestamp": 1753279614553,
    "signalTime": "23/07/2025, 15:06:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests potential bearish reversal after a pullback. RSI is relatively high at 59.44, indicating potential overbought conditions in a downtrend. Stochastic %K is at 100, suggesting overbought conditions, and the price is near the Fib 0.618 level, which often acts as resistance. These factors combined with the neutral volume bias suggest a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117823.52,
    "result": "CORRECT",
    "confirmedAt": "15:08:12",
    "endPrice": 117730.15,
    "checkAt": 1753279674553
  },
  {
    "timestamp": 1753279736055,
    "signalTime": "23/07/2025, 15:08:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The RSI is moderately high at 58.18, suggesting limited upside potential. The stochastic indicates overbought conditions with %K above %D. The MACD histogram is not specified, but given the other indicators, the likelihood of continuation of the downtrend is higher. The proximity to the Fib 0.618 level could provide additional resistance.",
    "entryPrice": 117836.76,
    "result": "CORRECT",
    "confirmedAt": "15:10:13",
    "endPrice": 117681.4,
    "checkAt": 1753279796055
  },
  {
    "timestamp": 1753279794466,
    "signalTime": "23/07/2025, 15:09:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The shooting star candle pattern suggests potential bearish reversal after the pullback to EMA30. Stochastic is in the overbought region, indicating a possible downward movement. The RSI is neutral, but the price action and trend provide a stronger bearish confluence.",
    "entryPrice": 117828.22,
    "result": "CORRECT",
    "confirmedAt": "15:11:14",
    "endPrice": 117735.25,
    "checkAt": 1753279854466
  },
  {
    "timestamp": 1753280393477,
    "signalTime": "23/07/2025, 15:19:53",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish shooting star candle pattern, and a volume spike indicating selling pressure. The RSI is near overbought levels, and the stochastic is also overbought, suggesting a potential downward move. Additionally, the price has pulled back to the EMA30, which often acts as resistance in a downtrend.",
    "entryPrice": 117928.77,
    "result": "WRONG",
    "confirmedAt": "15:21:15",
    "endPrice": 117965.48,
    "checkAt": 1753280453477
  },
  {
    "timestamp": 1753283694441,
    "signalTime": "23/07/2025, 16:14:54",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests a potential reversal. The RSI is below 50, indicating bearish momentum. The Stochastic %K is extremely low, suggesting oversold conditions, but the %D is not confirming a reversal. The price action showing a pullback to EMA30 and nearing the Fib 0.618 level suggests resistance. Therefore, a short-term downward movement is likely.",
    "entryPrice": 117854.08,
    "result": "WRONG",
    "confirmedAt": "16:16:17",
    "endPrice": 117859.88,
    "checkAt": 1753283754441
  },
  {
    "timestamp": 1753287117364,
    "signalTime": "23/07/2025, 17:11:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is low, suggesting potential for upward movement. The hammer candle pattern near the EMA30 suggests a bullish reversal. The Stochastic %K is at a low level, indicating potential for upward momentum. The price is near the Fib 0.618 level, which is a strong support zone. Despite the neutral volume, the confluence of these factors suggests a likely upward movement.",
    "entryPrice": 118069.66,
    "result": "WRONG",
    "confirmedAt": "17:13:19",
    "endPrice": 117927.27,
    "checkAt": 1753287177364
  },
  {
    "timestamp": 1753288375677,
    "signalTime": "23/07/2025, 17:32:55",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent pullback to EMA30 with a doji candle pattern indicates indecision but within a downtrend context. Stochastic is in the oversold region but not yet showing a strong reversal signal. Volume is neutral, providing no counter-trend support. These factors suggest a continuation of the downtrend.",
    "entryPrice": 117709.98,
    "result": "CORRECT",
    "confirmedAt": "17:34:21",
    "endPrice": 117664.88,
    "checkAt": 1753288435677
  },
  {
    "timestamp": 1753288436026,
    "signalTime": "23/07/2025, 17:33:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. The doji candle pattern and neutral volume suggest indecision, but the prevailing trend and indicators favor a continuation to the downside.",
    "entryPrice": 117674.58,
    "result": "CORRECT",
    "confirmedAt": "17:35:21",
    "endPrice": 117561.24,
    "checkAt": 1753288496026
  },
  {
    "timestamp": 1753289456091,
    "signalTime": "23/07/2025, 17:50:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star pattern at the EMA30 suggests a bearish reversal after a pullback. Stochastic is overbought, indicating potential for a downward move. RSI is neutral, providing no strong counter-signal. The MACD histogram is not provided, but other indicators suggest a continuation of the downtrend.",
    "entryPrice": 117782.89,
    "result": "WRONG",
    "confirmedAt": "17:52:23",
    "endPrice": 117814.21,
    "checkAt": 1753289516091
  },
  {
    "timestamp": 1753290298183,
    "signalTime": "23/07/2025, 18:04:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is neutral, and the doji candle pattern suggests indecision, but the price action touching EMA30 in a downtrend often acts as resistance. The MACD histogram is not provided, but the stochastic indicates potential overbought conditions. Given these factors, a short-term continuation of the downtrend is likely.",
    "entryPrice": 117833.52,
    "result": "CORRECT",
    "confirmedAt": "18:06:24",
    "endPrice": 117768.21,
    "checkAt": 1753290358183
  },
  {
    "timestamp": 1753291078015,
    "signalTime": "23/07/2025, 18:17:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the oversold region but not yet showing a strong reversal signal. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal continuation rather than reversal. Volume is neutral, providing no counter-signal to the bearish setup.",
    "entryPrice": 117544.04,
    "result": "CORRECT",
    "confirmedAt": "18:19:25",
    "endPrice": 117407.69,
    "checkAt": 1753291138015
  },
  {
    "timestamp": 1753291496582,
    "signalTime": "23/07/2025, 18:24:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, indicating bearish sentiment. The RSI is relatively high at 61.76, suggesting potential overbought conditions in a downtrend. The Stochastic %K is also high, indicating a possible reversal. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The presence of a Doji candle pattern suggests indecision, but in the context of a downtrend, it could indicate a continuation of the bearish move. The MACD histogram is not provided, but the other indicators suggest a higher probability of the price moving down.",
    "entryPrice": 117820,
    "result": "CORRECT",
    "confirmedAt": "18:25:56",
    "endPrice": 117816.6,
    "checkAt": 1753291556582
  },
  {
    "timestamp": 1753292099179,
    "signalTime": "23/07/2025, 18:34:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 59.55, suggesting potential overbought conditions in a downtrend. The Stochastic %K is also very high, indicating overbought conditions, which aligns with a potential downward move. The Doji candle pattern and price action touching EMA30 suggest indecision and a possible continuation of the downtrend. The MACD histogram is not provided, but given the other indicators, a DOWN trade is more likely.",
    "entryPrice": 117829.21,
    "result": "CORRECT",
    "confirmedAt": "18:36:06",
    "endPrice": 117752.96,
    "checkAt": 1753292159179
  },
  {
    "timestamp": 1753292458302,
    "signalTime": "23/07/2025, 18:40:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests a potential reversal or continuation of the downtrend. The RSI is neutral, but the price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is in the upper range, indicating potential overbought conditions. The confluence of these factors suggests a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 117736.44,
    "result": "WRONG",
    "confirmedAt": "18:42:07",
    "endPrice": 117792.16,
    "checkAt": 1753292518302
  },
  {
    "timestamp": 1753292636889,
    "signalTime": "23/07/2025, 18:43:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively neutral, but the stochastic is overbought, suggesting a potential for a downward move. The doji candle pattern indicates indecision, but given the downtrend and the pullback to EMA30, a continuation downward is more likely. The MACD histogram is not provided, but the lack of a volume spike suggests no strong upward momentum. The proximity to the Fib 0.618 level could act as resistance.",
    "entryPrice": 117819.18,
    "result": "CORRECT",
    "confirmedAt": "18:45:09",
    "endPrice": 117817.29,
    "checkAt": 1753292696889
  },
  {
    "timestamp": 1753292705286,
    "signalTime": "23/07/2025, 18:45:05",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star pattern suggests potential reversal or continuation of the downtrend. The RSI is relatively high at 60.50, indicating potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, supporting a potential downward move. The price action shows a pullback to EMA30, which could act as resistance. Although the volume is neutral, the confluence of these indicators suggests a higher probability of price moving down.",
    "entryPrice": 117853.33,
    "result": "WRONG",
    "confirmedAt": "18:46:10",
    "endPrice": 117873.41,
    "checkAt": 1753292765286
  },
  {
    "timestamp": 1753292816260,
    "signalTime": "23/07/2025, 18:46:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 65.05, suggesting potential for a short-term reversal or continuation of the downtrend. The price has pulled back to touch EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, indicating potential for downward movement. Despite the lack of a volume spike, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 117956.22,
    "result": "CORRECT",
    "confirmedAt": "18:48:11",
    "endPrice": 117889.72,
    "checkAt": 1753292876260
  },
  {
    "timestamp": 1753292996514,
    "signalTime": "23/07/2025, 18:49:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests potential reversal or continuation of the downtrend. The RSI is neutral but slightly above 50, indicating no strong upward momentum. The stochastic is in a neutral position, and the price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The lack of a volume spike suggests no strong buying pressure. These factors combined suggest a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117836.58,
    "result": "CORRECT",
    "confirmedAt": "18:51:12",
    "endPrice": 117735.38,
    "checkAt": 1753293056514
  },
  {
    "timestamp": 1753296777998,
    "signalTime": "23/07/2025, 19:52:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is above 50, suggesting bullish momentum. The presence of a hammer candle pattern at the EMA30 support level, along with a volume spike on the reversal candle, indicates potential bullish continuation. Stochastic values show potential for upward movement. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118313.52,
    "result": "CORRECT",
    "confirmedAt": "19:53:58",
    "endPrice": 118327.7,
    "checkAt": 1753296837998
  },
  {
    "timestamp": 1753299299920,
    "signalTime": "23/07/2025, 20:34:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA30 being above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The hammer candle pattern suggests a potential reversal back in the direction of the trend. Although the RSI is below 50, indicating some bearish momentum, the stochastic is in the oversold region, suggesting a potential upward movement. The proximity to the 0.618 Fib level adds to the likelihood of a bounce. The neutral volume does not strongly support either direction, but the confluence of other factors leans towards an upward move.",
    "entryPrice": 118285.66,
    "result": "CORRECT",
    "confirmedAt": "20:36:00",
    "endPrice": 118318.19,
    "checkAt": 1753299359920
  },
  {
    "timestamp": 1753299358499,
    "signalTime": "23/07/2025, 20:35:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is up as indicated by EMA30 being above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is neutral, suggesting no overbought or oversold conditions. The presence of a doji indicates indecision, but the volume spike on the reversal candle suggests potential buying interest. The stochastic is low, indicating potential for upward movement. The proximity to the Fib 0.618 level provides additional support for a bounce. Overall, the confluence of these factors suggests a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118292.79,
    "result": "CORRECT",
    "confirmedAt": "20:37:01",
    "endPrice": 118296.15,
    "checkAt": 1753299418499
  },
  {
    "timestamp": 1753300858347,
    "signalTime": "23/07/2025, 21:00:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is above 50, suggesting bullish sentiment. The price has pulled back to the EMA30, which often acts as support in an uptrend. Additionally, there is a recent spike in buying volume, reinforcing the likelihood of a continued upward move. The stochastic is neutral, but the overall confluence supports an UP trade.",
    "entryPrice": 118415.06,
    "result": "CORRECT",
    "confirmedAt": "21:02:03",
    "endPrice": 118439.99,
    "checkAt": 1753300918347
  },
  {
    "timestamp": 1753301759995,
    "signalTime": "23/07/2025, 21:15:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is above 50, supporting upward movement. The presence of a hammer candle pattern suggests a potential reversal or continuation of the uptrend after a pullback to EMA30. Stochastic is in the overbought region, which can be risky, but given the overall trend and support from the EMA, an upward move is more likely. The proximity to the Fib 0.618 level adds to the potential for a bounce. Volume is neutral, not contradicting the trend.",
    "entryPrice": 118471,
    "result": "WRONG",
    "confirmedAt": "21:17:05",
    "endPrice": 118412.24,
    "checkAt": 1753301819995
  },
  {
    "timestamp": 1753302057962,
    "signalTime": "23/07/2025, 21:20:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The recent pullback to EMA30 with a doji candle suggests indecision, but the volume spike on the reversal candle and the buying volume bias support a potential continuation of the uptrend. The stochastic is oversold, which could lead to a bounce. However, the RSI is below 50, indicating caution. Overall, the confluences suggest a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118336.36,
    "result": "CORRECT",
    "confirmedAt": "21:22:05",
    "endPrice": 118338.15,
    "checkAt": 1753302117962
  },
  {
    "timestamp": 1753304216641,
    "signalTime": "23/07/2025, 21:56:56",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, and a shooting star pattern indicates potential bearish reversal after a pullback. RSI is neutral, but the price action near EMA30 suggests resistance. Stochastic is not overbought, but the trend and pattern confluence support a downward move.",
    "entryPrice": 117917.33,
    "result": "WRONG",
    "confirmedAt": "21:58:08",
    "endPrice": 117930.92,
    "checkAt": 1753304276641
  },
  {
    "timestamp": 1753305780215,
    "signalTime": "23/07/2025, 22:23:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The Doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation lower. The stochastic is in the oversold region but not yet signaling a reversal. The MACD histogram is not provided, but the other indicators suggest a continuation of the downtrend. The Fib level near 0.618 may provide some support, but the confluence of other factors suggests a downward bias.",
    "entryPrice": 117718.05,
    "result": "CORRECT",
    "confirmedAt": "22:24:09",
    "endPrice": 117696.66,
    "checkAt": 1753305840215
  },
  {
    "timestamp": 1753306738164,
    "signalTime": "23/07/2025, 22:38:58",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA30, which often acts as resistance in a downtrend. Stochastic %K is below %D, suggesting potential continuation of the downward move. Despite the neutral volume, the overall indicators support a bearish outlook.",
    "entryPrice": 117603.64,
    "result": "WRONG",
    "confirmedAt": "22:40:10",
    "endPrice": 117816.08,
    "checkAt": 1753306798164
  },
  {
    "timestamp": 1753307040362,
    "signalTime": "23/07/2025, 22:44:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 61.21, suggesting potential overbought conditions in a downtrend. The Stochastic is also extremely high, indicating possible overbought conditions. The price action shows a pullback touching EMA30, which could act as resistance in a downtrend. Despite the doji candle pattern indicating indecision, the confluence of a downtrend, high RSI, and high Stochastic suggests a continuation of the downtrend is more likely.",
    "entryPrice": 117951.19,
    "result": "CORRECT",
    "confirmedAt": "22:45:11",
    "endPrice": 117866.01,
    "checkAt": 1753307100362
  },
  {
    "timestamp": 1753307217348,
    "signalTime": "23/07/2025, 22:46:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price is currently in a pullback phase touching EMA30, which often acts as resistance in a downtrend. The RSI is relatively high at 60.84, suggesting limited upside potential. Stochastic is overbought, indicating a potential for a price decrease. The lack of a candle pattern and normal volume spike reduce the confidence slightly, but the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 117979.8,
    "result": "WRONG",
    "confirmedAt": "22:48:12",
    "endPrice": 118012.89,
    "checkAt": 1753307277348
  },
  {
    "timestamp": 1753307277515,
    "signalTime": "23/07/2025, 22:47:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price action shows a pullback touching EMA30, suggesting a potential continuation of the downtrend. The Stochastic indicator is in the overbought region, which often precedes a price drop. Despite the RSI being above 60, the presence of a Doji candle pattern suggests indecision, but given the dominant downtrend, a downward move is more likely. Volume is neutral, not contradicting the trend.",
    "entryPrice": 117975.24,
    "result": "WRONG",
    "confirmedAt": "22:49:13",
    "endPrice": 118041.99,
    "checkAt": 1753307337515
  },
  {
    "timestamp": 1753307337527,
    "signalTime": "23/07/2025, 22:48:57",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high, suggesting potential overbought conditions. Stochastic is also in the overbought region, indicating a possible reversal or continuation of the downtrend. Despite the price touching EMA30, the lack of a volume spike and the presence near the Fib 0.618 level support the continuation of the downtrend. Therefore, the likelihood of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 118037.52,
    "result": "WRONG",
    "confirmedAt": "22:50:14",
    "endPrice": 118070.37,
    "checkAt": 1753307397527
  },
  {
    "timestamp": 1753309437810,
    "signalTime": "23/07/2025, 23:23:57",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is near overbought but not extreme, suggesting continued upward momentum. The hammer pattern at the EMA30 support level indicates a potential bullish reversal after the pullback. Stochastic is overbought, but the %K is above %D, supporting upward momentum. Volume is neutral, not contradicting the trend.",
    "entryPrice": 118364.06,
    "result": "CORRECT",
    "confirmedAt": "23:25:15",
    "endPrice": 118417.76,
    "checkAt": 1753309497810
  },
  {
    "timestamp": 1753309739355,
    "signalTime": "23/07/2025, 23:28:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 80,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The RSI is close to overbought but still supports upward momentum. The hammer candle pattern and the volume spike on the reversal candle suggest a potential continuation of the uptrend. The stochastic is in the overbought region, but the high %K and %D values indicate strong bullish momentum. Overall, the confluence of these factors supports an upward movement in the next 5 minutes.",
    "entryPrice": 118440.08,
    "result": "CORRECT",
    "confirmedAt": "23:30:16",
    "endPrice": 118626.09,
    "checkAt": 1753309799355
  },
  {
    "timestamp": 1753311838022,
    "signalTime": "24/07/2025, 00:03:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The overall trend is upward with EMA30 above EMA100. The RSI is below overbought levels, suggesting room for upward movement. The price has pulled back to EMA30, which often acts as support in an uptrend. The volume spike on the reversal candle indicates strong buying interest. Although the stochastic is overbought, the trend and volume suggest a continuation of the upward movement.",
    "entryPrice": 118621.25,
    "result": "CORRECT",
    "confirmedAt": "00:05:18",
    "endPrice": 118684.04,
    "checkAt": 1753311898022
  },
  {
    "timestamp": 1753315378754,
    "signalTime": "24/07/2025, 01:02:58",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 > EMA100. The RSI is not overbought, suggesting room for upward movement. The price has pulled back to the EMA30, which often acts as support in an uptrend. The stochastic is not overbought, and there is a recent spike in buying volume, indicating bullish sentiment. The proximity to the Fib 0.618 level adds to the potential for a bounce. Overall, these factors suggest a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118740.35,
    "result": "WRONG",
    "confirmedAt": "01:04:20",
    "endPrice": 118648.56,
    "checkAt": 1753315438754
  },
  {
    "timestamp": 1753316280320,
    "signalTime": "24/07/2025, 01:18:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to touch EMA30, which often acts as support in an uptrend. The RSI is above 50, indicating bullish momentum, and the hammer candle pattern suggests a potential reversal to the upside. The stochastic is in the overbought region but not extremely so, which aligns with the uptrend. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118731.18,
    "result": "CORRECT",
    "confirmedAt": "01:19:21",
    "endPrice": 118829.98,
    "checkAt": 1753316340320
  },
  {
    "timestamp": 1753320239633,
    "signalTime": "24/07/2025, 02:23:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as a support level in an uptrend. The hammer candle pattern suggests a potential reversal back to the upside. Although the RSI is neutral, the proximity to the Fibonacci 0.618 level supports a continuation of the upward trend. The Stochastic is not overbought, indicating room for upward movement. Overall, the confluence of these factors suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 118959.99,
    "result": "CORRECT",
    "confirmedAt": "02:25:23",
    "endPrice": 118976.9,
    "checkAt": 1753320299633
  },
  {
    "timestamp": 1753320959415,
    "signalTime": "24/07/2025, 02:35:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests potential bearish reversal. The RSI is below 50, indicating bearish momentum. Stochastic %K is extremely low, suggesting oversold conditions but not yet showing a reversal signal. The price has pulled back to EMA30, which could act as resistance. The proximity to the Fib 0.618 level may also act as a resistance. Given these factors, a short-term down movement is more likely.",
    "entryPrice": 118871.11,
    "result": "CORRECT",
    "confirmedAt": "02:37:24",
    "endPrice": 118868.72,
    "checkAt": 1753321019415
  },
  {
    "timestamp": 1753321079898,
    "signalTime": "24/07/2025, 02:37:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to touch EMA30, which often acts as support in an uptrend. The RSI is neutral but not overbought, and there is a recent spike in buying volume, indicating potential bullish momentum. The stochastic is not in the overbought zone, and the price is near the Fib 0.618 level, which can act as a support. These factors suggest a higher probability of the price moving up in the next 5 minutes.",
    "entryPrice": 118921.23,
    "result": "CORRECT",
    "confirmedAt": "02:39:25",
    "endPrice": 119035.06,
    "checkAt": 1753321139898
  },
  {
    "timestamp": 1753321321810,
    "signalTime": "24/07/2025, 02:42:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has recently pulled back to the EMA30, which often acts as support in an uptrend. The RSI is above 50, suggesting bullish momentum. The recent spike in buying volume indicates potential continued upward movement. Stochastic is not overbought, providing room for upward movement. Overall, the confluence of indicators suggests a higher probability of the price being above the current level in the next 5 minutes.",
    "entryPrice": 119002.03,
    "result": "CORRECT",
    "confirmedAt": "02:43:26",
    "endPrice": 119012.4,
    "checkAt": 1753321381810
  },
  {
    "timestamp": 1753321559701,
    "signalTime": "24/07/2025, 02:45:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support in an uptrend. The hammer candle pattern suggests a potential reversal back up. Although the RSI is neutral, the stochastic is near overbought, indicating potential continuation of the trend. The price is near the Fib 0.618 level, which is a strong support zone. Despite the neutral volume, the confluence of these factors suggests a higher probability of price moving up.",
    "entryPrice": 118999.99,
    "result": "WRONG",
    "confirmedAt": "02:47:27",
    "endPrice": 118975.46,
    "checkAt": 1753321619701
  },
  {
    "timestamp": 1753322221480,
    "signalTime": "24/07/2025, 02:57:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend as indicated by EMA30 being above EMA100. The RSI is above 60, suggesting bullish momentum. The price has pulled back to the EMA30, which often acts as support in an uptrend. Although the stochastic is overbought, the overall trend and RSI support a continuation upwards. The proximity to the Fib 0.618 level could provide additional support for an upward move.",
    "entryPrice": 119088.74,
    "result": "CORRECT",
    "confirmedAt": "02:58:28",
    "endPrice": 119100,
    "checkAt": 1753322281480
  },
  {
    "timestamp": 1753322579690,
    "signalTime": "24/07/2025, 03:02:59",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as a support in an uptrend. The hammer candle pattern suggests a potential reversal back upwards. RSI is neutral, allowing room for upward movement. Stochastic indicates potential upward momentum as %K is above %D. The proximity to the Fib 0.618 level, a common retracement level, adds to the potential for a bounce. However, the volume is neutral, slightly reducing confidence.",
    "entryPrice": 119059.7,
    "result": "WRONG",
    "confirmedAt": "03:04:29",
    "endPrice": 119012.54,
    "checkAt": 1753322639690
  },
  {
    "timestamp": 1753323779771,
    "signalTime": "24/07/2025, 03:22:59",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is oversold but not showing a clear reversal signal. The price action shows a pullback to EMA30, which could act as resistance in a downtrend. The lack of a volume spike and absence of a bullish candle pattern reduce the likelihood of an immediate reversal.",
    "entryPrice": 118847.47,
    "result": "CORRECT",
    "confirmedAt": "03:24:00",
    "endPrice": 118830.85,
    "checkAt": 1753323839771
  },
  {
    "timestamp": 1753324500911,
    "signalTime": "24/07/2025, 03:35:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The price action shows a pullback to EMA30, which often acts as a resistance in a downtrend. The RSI is neutral, not indicating overbought or oversold conditions, and the stochastic is in a neutral position as well. The lack of a candle pattern and normal volume suggests no strong reversal signals. Therefore, the confluence of a downtrend and resistance at EMA30 suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 118911.33,
    "result": "WRONG",
    "confirmedAt": "03:36:01",
    "endPrice": 118926.18,
    "checkAt": 1753324560911
  },
  {
    "timestamp": 1753325160617,
    "signalTime": "24/07/2025, 03:46:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is at 67.16, indicating bullish momentum, and the presence of a hammer candle pattern suggests a potential reversal to the upside. Although the stochastic is overbought, it can remain in that state during strong trends. The proximity to the Fib 0.618 level also supports a continuation of the trend. Overall, the confluence of these factors suggests a higher likelihood of the price being above the current level in the next 5 minutes.",
    "entryPrice": 119045.12,
    "result": "CORRECT",
    "confirmedAt": "03:47:02",
    "endPrice": 119060,
    "checkAt": 1753325220617
  },
  {
    "timestamp": 1753325220661,
    "signalTime": "24/07/2025, 03:47:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is near overbought but not extreme, suggesting continued strength. The hammer candle pattern at the EMA30 support level indicates potential bullish reversal after a pullback. Stochastic is at maximum, supporting bullish continuation. The proximity to the Fib 0.618 level adds confluence for a potential bounce. Overall, the setup favors an upward move in the next 5 minutes.",
    "entryPrice": 119058.35,
    "result": "CORRECT",
    "confirmedAt": "03:48:03",
    "endPrice": 119067.4,
    "checkAt": 1753325280661
  },
  {
    "timestamp": 1753326000652,
    "signalTime": "24/07/2025, 04:00:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the RSI is below 50, suggesting weak bullish momentum. The presence of a doji candle and a volume spike on a reversal candle indicates indecision and potential reversal. The stochastic is in the oversold region, but the recent selling volume spike and the price touching the EMA30 suggest a possible short-term bearish move. Additionally, the price is near the Fib 0.618 level, which can act as resistance.",
    "entryPrice": 118934.98,
    "result": "WRONG",
    "confirmedAt": "04:01:04",
    "endPrice": 118958.05,
    "checkAt": 1753326060652
  },
  {
    "timestamp": 1753326421433,
    "signalTime": "24/07/2025, 04:07:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support. The hammer candle pattern suggests a potential reversal back up. The RSI is neutral, but the stochastic is near overbought, indicating potential for continued upward movement. The proximity to the Fib 0.618 level adds confluence for a bounce. Overall, the confluence of trend, support, and candlestick pattern suggests an upward move.",
    "entryPrice": 118987.04,
    "result": "WRONG",
    "confirmedAt": "04:08:05",
    "endPrice": 118945.17,
    "checkAt": 1753326481433
  },
  {
    "timestamp": 1753326842023,
    "signalTime": "24/07/2025, 04:14:02",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and the price has pulled back to the EMA30, which often acts as support. The RSI is neutral but above 50, indicating potential for further upward movement. The hammer candle pattern suggests a reversal or continuation of the uptrend. Stochastic is in the upper range, supporting bullish momentum. The price is near the Fib 0.618 level, which is a strong retracement level, suggesting a potential bounce. Despite the neutral volume, the confluence of these factors leans towards an upward movement.",
    "entryPrice": 118995.06,
    "result": "WRONG",
    "confirmedAt": "04:15:06",
    "endPrice": 118995.05,
    "checkAt": 1753326902023
  },
  {
    "timestamp": 1753327141946,
    "signalTime": "24/07/2025, 04:19:01",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has pulled back to EMA30, which often acts as support in an uptrend. RSI is above 60, indicating bullish momentum. The Stochastic is overbought, but this can persist in strong trends. The presence of a Doji and volume spike suggests indecision but also potential for continuation. The proximity to the Fib 0.618 level adds support to the bullish bias.",
    "entryPrice": 119043.26,
    "result": "WRONG",
    "confirmedAt": "04:20:07",
    "endPrice": 119031.84,
    "checkAt": 1753327201946
  },
  {
    "timestamp": 1753327980636,
    "signalTime": "24/07/2025, 04:33:00",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market setup shows a strong uptrend with EMA30 above EMA100, a hammer candle pattern indicating potential reversal, and a volume spike suggesting buying interest. RSI is moderately bullish, and the price is near the Fib 0.618 level, which often acts as support. Although the Stochastic is not in the oversold region, the overall confluence supports a continuation of the uptrend.",
    "entryPrice": 119152.37,
    "result": "CORRECT",
    "confirmedAt": "04:34:08",
    "endPrice": 119167.33,
    "checkAt": 1753328040636
  },
  {
    "timestamp": 1753328102494,
    "signalTime": "24/07/2025, 04:35:02",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100. The price has pulled back to the EMA30, which often acts as support in an uptrend. The RSI is above 50, indicating bullish momentum. The hammer candle pattern suggests a potential reversal to the upside. Although volume is neutral, the confluence of trend, support, and candlestick pattern supports an upward move.",
    "entryPrice": 119158.36,
    "result": "WRONG",
    "confirmedAt": "04:36:09",
    "endPrice": 119064.23,
    "checkAt": 1753328162494
  },
  {
    "timestamp": 1753328401968,
    "signalTime": "24/07/2025, 04:40:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend indicated by EMA30 > EMA100, the presence of a shooting star candle pattern suggests a potential reversal. The RSI is low at 36.63, indicating bearish momentum. The Stochastic is also oversold, but the %K is at 0, suggesting limited upward momentum. The price action shows a pullback to EMA30, which could act as resistance. The proximity to the Fib 0.618 level further supports a potential reversal. Therefore, a short-term bearish move is likely.",
    "entryPrice": 118974.51,
    "result": "WRONG",
    "confirmedAt": "04:41:10",
    "endPrice": 119012.54,
    "checkAt": 1753328461968
  },
  {
    "timestamp": 1753329120617,
    "signalTime": "24/07/2025, 04:52:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The market is in a downtrend with EMA30 below EMA100. The RSI is oversold, but the presence of a shooting star candle pattern suggests bearish momentum. The Stochastic is also in the oversold region, indicating potential for further downside. The MACD histogram is not provided, but overall indicators align with a continuation of the downtrend.",
    "entryPrice": 118678.14,
    "result": "CORRECT",
    "confirmedAt": "04:53:11",
    "endPrice": 118675.21,
    "checkAt": 1753329180617
  },
  {
    "timestamp": 1753330082105,
    "signalTime": "24/07/2025, 05:08:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. Stochastic is not in an oversold condition, indicating there is room for further downside. The lack of a volume spike suggests no strong buying interest. Therefore, the probability of the price being below the current level in the next 5 minutes is higher.",
    "entryPrice": 118465.2,
    "result": "CORRECT",
    "confirmedAt": "05:09:12",
    "endPrice": 118420.81,
    "checkAt": 1753330142105
  },
  {
    "timestamp": 1753330200606,
    "signalTime": "24/07/2025, 05:10:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The presence of a shooting star candle pattern near the EMA30 resistance level indicates potential reversal back to the downside. The MACD histogram is not specified, but the stochastic is showing a slight bearish crossover. The price action touched EMA30 and is likely to continue the downtrend. Despite neutral volume, the confluence of these factors suggests a higher probability of price moving down.",
    "entryPrice": 118410.97,
    "result": "CORRECT",
    "confirmedAt": "05:11:13",
    "endPrice": 118300,
    "checkAt": 1753330260606
  },
  {
    "timestamp": 1753333921636,
    "signalTime": "24/07/2025, 06:12:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 85,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The presence of a shooting star candle pattern near the EMA30 indicates potential reversal to the downside after a pullback. Stochastic is in the oversold region but not showing a strong reversal signal. Volume is neutral, not contradicting the downtrend. These factors suggest a continuation of the downtrend in the next 5 minutes.",
    "entryPrice": 117725.04,
    "result": "CORRECT",
    "confirmedAt": "06:13:15",
    "endPrice": 117686.15,
    "checkAt": 1753333981636
  },
  {
    "timestamp": 1753334881385,
    "signalTime": "24/07/2025, 06:28:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100, and the RSI is below 50, indicating bearish momentum. The doji candle at the EMA30 suggests indecision but not a reversal. Stochastic is oversold but not yet signaling a clear reversal. Given these factors, the probability favors continuation of the downtrend in the short term.",
    "entryPrice": 117574.09,
    "result": "CORRECT",
    "confirmedAt": "06:29:16",
    "endPrice": 117552.84,
    "checkAt": 1753334941385
  },
  {
    "timestamp": 1753336021638,
    "signalTime": "24/07/2025, 06:47:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The presence of a shooting star candle pattern suggests a potential reversal or continuation of the downtrend. RSI is relatively neutral but not oversold, and the price action indicates a pullback to the EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, suggesting a potential reversal. The confluence of these factors suggests a higher probability of the price moving down in the next 5 minutes.",
    "entryPrice": 117858.07,
    "result": "WRONG",
    "confirmedAt": "06:48:17",
    "endPrice": 117864.47,
    "checkAt": 1753336081638
  },
  {
    "timestamp": 1753336440268,
    "signalTime": "24/07/2025, 06:54:00",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The Stochastic is in the oversold region but not yet showing a clear reversal signal. The neutral volume and lack of a bullish candle pattern further support a continuation of the downtrend.",
    "entryPrice": 117701.99,
    "result": "CORRECT",
    "confirmedAt": "06:55:18",
    "endPrice": 117626.41,
    "checkAt": 1753336500268
  },
  {
    "timestamp": 1753337161851,
    "signalTime": "24/07/2025, 07:06:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The recent volume spike on a reversal candle indicates strong selling pressure. The price action shows a pullback touching EMA30, which often acts as resistance in a downtrend. The stochastic is neutral, but the overall indicators suggest a continuation of the downtrend.",
    "entryPrice": 117622.28,
    "result": "WRONG",
    "confirmedAt": "07:07:19",
    "endPrice": 117653.2,
    "checkAt": 1753337221851
  },
  {
    "timestamp": 1753337882182,
    "signalTime": "24/07/2025, 07:18:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. Despite the hammer pattern and pullback to EMA30, the recent volume spike is on a red candle, indicating strong selling pressure. Stochastic %K is low, but %D is above %K, which often suggests a continuation of the current trend. The confluence of these factors supports a bearish outlook.",
    "entryPrice": 117548.46,
    "result": "WRONG",
    "confirmedAt": "07:19:21",
    "endPrice": 117591.88,
    "checkAt": 1753337942182
  },
  {
    "timestamp": 1753338362917,
    "signalTime": "24/07/2025, 07:26:02",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high, suggesting a potential overbought condition in a downtrend. The stochastic is also in the overbought region, indicating a possible reversal. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. Despite the lack of a candle pattern and neutral volume, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 117827.22,
    "result": "CORRECT",
    "confirmedAt": "07:27:22",
    "endPrice": 117803.04,
    "checkAt": 1753338422917
  },
  {
    "timestamp": 1753338664489,
    "signalTime": "24/07/2025, 07:31:04",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is neutral, suggesting no strong momentum shift. The price is pulling back to the EMA30, which often acts as resistance in a downtrend. Stochastic is overbought, indicating a potential for a downward move. The lack of a volume spike suggests no strong buying pressure. These factors combined suggest a continuation of the downtrend.",
    "entryPrice": 117823.78,
    "result": "CORRECT",
    "confirmedAt": "07:32:23",
    "endPrice": 117797.36,
    "checkAt": 1753338724489
  },
  {
    "timestamp": 1753338781934,
    "signalTime": "24/07/2025, 07:33:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively neutral, but the price action shows a pullback to the EMA30, which often acts as resistance in a downtrend. The stochastic is in the overbought region, suggesting potential for a downward move. The lack of a strong volume spike and the proximity to the Fib 0.618 level add some caution, but the trend and stochastic indicators provide a stronger case for a downward move.",
    "entryPrice": 117841.27,
    "result": "CORRECT",
    "confirmedAt": "07:34:24",
    "endPrice": 117815.84,
    "checkAt": 1753338841934
  },
  {
    "timestamp": 1753339141776,
    "signalTime": "24/07/2025, 07:39:01",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and the presence of a shooting star candle pattern suggests bearish sentiment. RSI is below 50, indicating potential continuation of the downtrend. Stochastic is oversold, but the overall trend and candle pattern suggest a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 117620.02,
    "result": "CORRECT",
    "confirmedAt": "07:40:25",
    "endPrice": 117580,
    "checkAt": 1753339201776
  },
  {
    "timestamp": 1753350738305,
    "signalTime": "24/07/2025, 10:52:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, indicating bearish momentum. The price has pulled back to the EMA30, which often acts as resistance in a downtrend. The Stochastic is in the oversold region but not showing a clear reversal signal. The MACD histogram is not provided, but other indicators suggest continuation of the downtrend. The Fib level near 0.618 could provide some support, but the confluence of bearish signals suggests a higher probability of price moving down.",
    "entryPrice": 118383.26,
    "result": "WRONG",
    "confirmedAt": "10:53:46",
    "endPrice": 118475.28,
    "checkAt": 1753350798305
  },
  {
    "timestamp": 1753350978321,
    "signalTime": "24/07/2025, 10:56:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down with EMA30 below EMA100. RSI is below 50, indicating bearish momentum. The price action shows a pullback touching EMA30, suggesting a potential continuation of the downtrend. Stochastic is not in oversold territory, providing room for further downside. The proximity to the 0.618 Fib level could act as resistance. Volume is neutral, not contradicting the downtrend bias.",
    "entryPrice": 118430.72,
    "result": "WRONG",
    "confirmedAt": "10:57:47",
    "endPrice": 118477.26,
    "checkAt": 1753351038321
  },
  {
    "timestamp": 1753351998234,
    "signalTime": "24/07/2025, 11:13:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is in the oversold region but not yet showing a reversal signal. The Doji candle pattern and neutral volume suggest indecision, but the pullback to EMA30 in a downtrend often results in continuation. The proximity to the Fib 0.618 level adds a potential resistance point, supporting a bearish outlook.",
    "entryPrice": 118357.79,
    "result": "CORRECT",
    "confirmedAt": "11:14:19",
    "endPrice": 118353.82,
    "checkAt": 1753352058234
  },
  {
    "timestamp": 1753354398096,
    "signalTime": "24/07/2025, 11:53:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 61.38, suggesting potential overbought conditions in a downtrend. The price has recently touched EMA30, which could act as resistance in a downtrend. Stochastic is in the overbought region, further supporting a potential downward move. Despite the lack of a volume spike, the confluence of these indicators suggests a continuation of the downtrend.",
    "entryPrice": 118327.21,
    "result": "WRONG",
    "confirmedAt": "11:54:21",
    "endPrice": 118354.05,
    "checkAt": 1753354458096
  },
  {
    "timestamp": 1753354518639,
    "signalTime": "24/07/2025, 11:55:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 62.16, suggesting potential overbought conditions in a downtrend. The stochastic is also in the overbought region, reinforcing the potential for a downward move. The doji pattern and neutral volume suggest indecision, but the prevailing trend and indicators favor a continuation of the downtrend.",
    "entryPrice": 118344,
    "result": "WRONG",
    "confirmedAt": "11:56:23",
    "endPrice": 118353.98,
    "checkAt": 1753354578639
  },
  {
    "timestamp": 1753354759375,
    "signalTime": "24/07/2025, 11:59:19",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 66.46, suggesting potential overbought conditions. The stochastic is extremely high, indicating a possible reversal or continuation of the downtrend. The presence of a Doji at a pullback to EMA30 suggests indecision, but given the downtrend, it may resolve downward. The price is near the Fib 0.618 level, which can act as resistance in a downtrend. Volume is neutral, not contradicting the downtrend bias.",
    "entryPrice": 118407.05,
    "result": "CORRECT",
    "confirmedAt": "12:00:24",
    "endPrice": 118392.84,
    "checkAt": 1753354819375
  },
  {
    "timestamp": 1753354878081,
    "signalTime": "24/07/2025, 12:01:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 65.05, suggesting potential overbought conditions. The stochastic is also in the overbought region, indicating possible downward pressure. Despite the price touching EMA30, the lack of a strong volume spike and the presence of a downtrend suggest a continuation of the downward movement.",
    "entryPrice": 118412.86,
    "result": "CORRECT",
    "confirmedAt": "12:02:25",
    "endPrice": 118405.3,
    "checkAt": 1753354938081
  },
  {
    "timestamp": 1753355000051,
    "signalTime": "24/07/2025, 12:03:20",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 66.57, suggesting potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, indicating a possible reversal or continuation of the downtrend. The price action shows a pullback to the EMA30, which often acts as resistance in a downtrend. Despite the lack of a significant volume spike, the confluence of indicators suggests a higher probability of the price moving down.",
    "entryPrice": 118430.64,
    "result": "WRONG",
    "confirmedAt": "12:04:25",
    "endPrice": 118435.7,
    "checkAt": 1753355060051
  },
  {
    "timestamp": 1753355058313,
    "signalTime": "24/07/2025, 12:04:18",
    "symbol": "BTCUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. Despite the hammer pattern suggesting a potential reversal, the RSI is relatively high, indicating overbought conditions. The stochastic is also in the overbought region, suggesting limited upside potential. The price touching EMA30 during a downtrend typically acts as resistance. The MACD histogram is not provided, but the lack of a volume spike suggests no strong buying pressure. Therefore, the confluence of indicators suggests a continuation of the downtrend.",
    "entryPrice": 118435.7,
    "result": "CORRECT",
    "confirmedAt": "12:05:26",
    "endPrice": 118334.4,
    "checkAt": 1753355118313
  },
  {
    "timestamp": 1753356080017,
    "signalTime": "24/07/2025, 12:21:20",
    "symbol": "BTCUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, indicating bullish momentum. The RSI is below the overbought level, suggesting room for further upward movement. The hammer candle pattern at the EMA30 support level suggests a potential reversal to the upside. Although the stochastic is in the overbought region, the overall trend and price action support an upward move. Volume remains neutral, not contradicting the bullish setup.",
    "entryPrice": 118683.77,
    "result": "WRONG",
    "confirmedAt": "12:22:28",
    "endPrice": 118666.27,
    "checkAt": 1753356140017
  },
  {
    "timestamp": 1753644027467,
    "signalTime": "27/07/2025, 20:20:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "Despite the overall uptrend, the presence of a shooting star candle pattern, a recent volume spike on a reversal candle, and the RSI being below 50 suggest potential short-term bearish pressure. Additionally, the price action touching the EMA30 and the stochastic being below 50 indicate a possible continuation of the pullback. The proximity to the Fib 0.618 level further supports a potential short-term reversal.",
    "entryPrice": 3843.47,
    "result": "WRONG",
    "confirmedAt": "20:28:53",
    "endPrice": 118928.19,
    "checkAt": 1753644087467
  },
  {
    "timestamp": 1753644270425,
    "signalTime": "27/07/2025, 20:24:30",
    "symbol": "ETHUSDT",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and a bullish engulfing pattern suggests a potential continuation of the trend. The RSI is below 50, indicating potential room for upward movement. The price has pulled back to the EMA30, which often acts as support in an uptrend. Despite the stochastic being in the oversold region, the overall confluence supports an upward move.",
    "entryPrice": 3840.55,
    "result": "CORRECT",
    "confirmedAt": "20:28:53",
    "endPrice": 118928.19,
    "checkAt": 1753644330425
  },
  {
    "timestamp": 1753647149072,
    "signalTime": "27/07/2025, 21:12:29",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 60.78, suggesting potential overbought conditions in a downtrend. The Stochastic is also in the overbought region, indicating a possible reversal. The doji candle pattern near a resistance level (EMA30) suggests indecision, but in the context of a downtrend, it could lead to a continuation downward. The price action has touched EMA30, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the other indicators suggest a higher probability of a downward move.",
    "entryPrice": 3842.47,
    "result": "WRONG",
    "confirmedAt": "21:13:56",
    "endPrice": 119119.31,
    "checkAt": 1753647209072
  },
  {
    "timestamp": 1753647207254,
    "signalTime": "27/07/2025, 21:13:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish engulfing candle pattern, and a pullback touching EMA30. Despite the RSI being above 50, the high stochastic %K and %D values suggest overbought conditions, aligning with the bearish trend. The neutral volume and proximity to the Fib 0.618 level add some risk, but overall confluence favors a downward move.",
    "entryPrice": 3841.13,
    "result": "WRONG",
    "confirmedAt": "21:14:27",
    "endPrice": 119094.59,
    "checkAt": 1753647267254
  },
  {
    "timestamp": 1753647510181,
    "signalTime": "27/07/2025, 21:18:30",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The shooting star candle pattern suggests a potential reversal or continuation of the downtrend after a pullback to EMA30. RSI is below 50, indicating bearish momentum. Stochastic %K is below %D and in the oversold region, which could suggest a potential bounce, but given the overall downtrend and the shooting star pattern, the bearish signals are stronger. The price is near the Fib 0.618 level, which could act as resistance. Volume is neutral, not contradicting the downtrend. Therefore, a DOWN trade is more likely.",
    "entryPrice": 3834.51,
    "result": "WRONG",
    "confirmedAt": "21:20:39",
    "endPrice": 119036.31,
    "checkAt": 1753647570181
  },
  {
    "timestamp": 1753647567217,
    "signalTime": "27/07/2025, 21:19:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market setup shows a downtrend with EMA30 below EMA100, a bearish engulfing pattern, and RSI below 50 indicating bearish momentum. The stochastic is oversold, but the overall confluence supports a continuation of the downtrend.",
    "entryPrice": 3832.79,
    "result": "WRONG",
    "confirmedAt": "21:20:39",
    "endPrice": 119036.31,
    "checkAt": 1753647627217
  },
  {
    "timestamp": 1753647628918,
    "signalTime": "27/07/2025, 21:20:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30, which often acts as a resistance in a downtrend. The Stochastic is also in the oversold region, but given the strong downtrend, it may remain oversold for a while. The lack of a volume spike and the neutral MACD histogram suggest no strong reversal signals. Therefore, the likelihood of the price continuing downwards is higher.",
    "entryPrice": 3832.13,
    "result": "WRONG",
    "confirmedAt": "21:21:41",
    "endPrice": 119058.53,
    "checkAt": 1753647688918
  },
  {
    "timestamp": 1753648227313,
    "signalTime": "27/07/2025, 21:30:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100. The bearish engulfing pattern and RSI below 50 support further downside. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. Stochastic is not oversold, allowing room for further decline. Volume is neutral, not contradicting the bearish bias.",
    "entryPrice": 3832.01,
    "result": "WRONG",
    "confirmedAt": "21:31:42",
    "endPrice": 118929.63,
    "checkAt": 1753648287313
  },
  {
    "timestamp": 1753649307932,
    "signalTime": "27/07/2025, 21:48:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may signal continuation. The stochastic is not in oversold territory, suggesting room for further downside. The MACD histogram is not provided, but given the other indicators, a DOWN trade is more likely.",
    "entryPrice": 3827.56,
    "result": "WRONG",
    "confirmedAt": "21:49:43",
    "endPrice": 118919.4,
    "checkAt": 1753649367932
  },
  {
    "timestamp": 1753649848114,
    "signalTime": "27/07/2025, 21:57:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price has pulled back to the EMA30 level, which often acts as resistance in a downtrend. The doji candle pattern indicates indecision, but in the context of a downtrend, it may suggest a continuation of the bearish move. The stochastic is not in an overbought condition, allowing room for further downside. The price is near the Fib 0.618 level, which can act as a resistance in a downtrend. Given these factors, a DOWN trade is more likely.",
    "entryPrice": 3824.46,
    "result": "WRONG",
    "confirmedAt": "21:58:44",
    "endPrice": 118735.4,
    "checkAt": 1753649908114
  },
  {
    "timestamp": 1753650328108,
    "signalTime": "27/07/2025, 22:05:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and a bearish engulfing pattern has formed. The RSI is below 50, indicating bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The stochastic is not in oversold territory, suggesting more room for downside. The setup aligns with the overall bearish trend, despite the neutral volume.",
    "entryPrice": 3824.83,
    "result": "WRONG",
    "confirmedAt": "22:06:46",
    "endPrice": 118767.61,
    "checkAt": 1753650388108
  },
  {
    "timestamp": 1753650627199,
    "signalTime": "27/07/2025, 22:10:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, and a bearish engulfing pattern has formed. RSI is below 50, indicating bearish momentum. The price has pulled back to EMA30, which often acts as resistance in a downtrend. Stochastic is below 50, supporting the bearish sentiment. Despite the neutral volume, the confluence of these factors suggests a continuation of the downtrend.",
    "entryPrice": 3823.67,
    "result": "WRONG",
    "confirmedAt": "22:11:47",
    "endPrice": 118790.67,
    "checkAt": 1753650687199
  },
  {
    "timestamp": 1753650808149,
    "signalTime": "27/07/2025, 22:13:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. Stochastic is oversold but not showing a strong reversal signal. The lack of a volume spike and absence of a bullish candle pattern reduces the likelihood of an immediate upward reversal.",
    "entryPrice": 3823.05,
    "result": "WRONG",
    "confirmedAt": "22:14:48",
    "endPrice": 118750.85,
    "checkAt": 1753650868149
  },
  {
    "timestamp": 1753650928135,
    "signalTime": "27/07/2025, 22:15:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is below 50, suggesting bearish momentum. The stochastic is in the oversold region but not yet showing a clear reversal signal. The doji candle pattern and neutral volume suggest indecision, but the pullback to EMA30 in a downtrend often leads to continuation. The proximity to the Fib 0.618 level could provide some support, but the confluence of indicators leans towards a short-term continuation of the downtrend.",
    "entryPrice": 3822.61,
    "result": "WRONG",
    "confirmedAt": "22:16:50",
    "endPrice": 118753.94,
    "checkAt": 1753650988135
  },
  {
    "timestamp": 1753652188253,
    "signalTime": "27/07/2025, 22:36:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The recent bearish engulfing pattern suggests further downside potential. The RSI is neutral but leaning slightly towards bearish territory. The price action shows a pullback to EMA30, which often acts as resistance in a downtrend. The MACD histogram is not provided, but the stochastic is not in an overbought condition, allowing room for further downside. The proximity to the Fib 0.618 level suggests a potential reversal, but the confluence of other indicators supports a short-term bearish outlook.",
    "entryPrice": 3825.75,
    "result": "WRONG",
    "confirmedAt": "22:37:51",
    "endPrice": 119042.91,
    "checkAt": 1753652248253
  },
  {
    "timestamp": 1753652248316,
    "signalTime": "27/07/2025, 22:37:28",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The market is in a downtrend with EMA30 below EMA100, a bearish engulfing pattern has formed, and the RSI is below 50 indicating bearish momentum. The price action shows a pullback touching EMA30, suggesting a continuation of the downtrend. Stochastic is also in a bearish position. Despite the neutral volume, the overall confluence supports a DOWN trade.",
    "entryPrice": 3824.31,
    "result": "WRONG",
    "confirmedAt": "22:38:52",
    "endPrice": 118996.83,
    "checkAt": 1753652308316
  },
  {
    "timestamp": 1753653207815,
    "signalTime": "27/07/2025, 22:53:27",
    "symbol": "ETHUSDT",
    "signal": "DOWN",
    "confidence": 75,
    "reason": "The overall trend is down as indicated by EMA30 being below EMA100. The RSI is relatively high at 63.32, suggesting potential overbought conditions in a downtrend. The doji candle pattern and touch of EMA30 indicate indecision and a possible continuation of the downtrend. Stochastic is in the overbought region, further supporting a potential downward move. Although volume is neutral, the confluence of these indicators suggests a higher probability of price moving down in the next 5 minutes.",
    "entryPrice": 3832.85,
    "result": "WRONG",
    "confirmedAt": "22:54:53",
    "endPrice": 119238.84,
    "checkAt": 1753653267815
  },
  {
    "timestamp": 1753682749008,
    "signalTime": "28/07/2025, 07:05:49",
    "symbol": "ETHUSD",
    "signal": "UP",
    "confidence": 75,
    "reason": "The market is in an uptrend with EMA30 above EMA100, and a bullish engulfing pattern suggests potential upward momentum. The RSI is below 50, indicating room for upward movement. The stochastic is oversold, which may lead to a bounce. Although volume is neutral, the confluence of trend and pattern supports an upward move.",
    "entryPrice": 3929.83,
    "result": "PENDING",
    "confirmedAt": null,
    "endPrice": null,
    "checkAt": 1753682809008
  }
]